-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2021-03-16 11:16:55
-- 服务器版本： 8.0.19
-- PHP 版本： 7.3.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `db_aqschool`
--

-- --------------------------------------------------------

--
-- 表的结构 `base_build`
--

CREATE TABLE `base_build` (
  `id` int NOT NULL COMMENT '序号',
  `build_id` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '建筑id',
  `build_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '建筑名称',
  `build_department` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所属部门',
  `build_school` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '所在学校',
  `build_campus` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `state` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '状态',
  `addTime` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_build`
--

INSERT INTO `base_build` (`id`, `build_id`, `build_name`, `build_department`, `build_school`, `build_campus`, `state`, `addTime`) VALUES
(1, 'S0001_A_01_B01', '信息楼', 'S0001_A_01', 'S0001', 'S0001_A', '1', '1587608927000'),
(2, 'S0001_A_02_B01', '财经楼', 'S0001_A_02', 'S0001', 'S0001_A', '1', '1587608927000'),
(3, 'S0001_A_03_B01', '商贸楼', 'S0001_A_03', 'S0001', 'S0001_A', '1', '1587608927000');

-- --------------------------------------------------------

--
-- 表的结构 `base_campus`
--

CREATE TABLE `base_campus` (
  `id` int NOT NULL COMMENT 'id序号',
  `campus_id` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '校区id',
  `campus_name` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '校区名称',
  `campus_school` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus_position` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '校区地址'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_campus`
--

INSERT INTO `base_campus` (`id`, `campus_id`, `campus_name`, `campus_school`, `campus_position`) VALUES
(1, 'S0001_A', '新校区', 'S0001', '440306'),
(2, 'S0001_B', '东校区', 'S0001', '440306'),
(3, 'S0002_A', '潍坊校区', 'S0002', '370784');

-- --------------------------------------------------------

--
-- 表的结构 `base_class`
--

CREATE TABLE `base_class` (
  `id` int NOT NULL COMMENT 'id序号',
  `class_id` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '班级id',
  `class_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '班级名称',
  `class_grade` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '班级年级',
  `class_skill` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在专业',
  `class_department` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `class_school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `class_campus` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间',
  `state` varchar(16) COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '班级状态',
  `status` varchar(6) COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_class`
--

INSERT INTO `base_class` (`id`, `class_id`, `class_name`, `class_grade`, `class_skill`, `class_department`, `class_school`, `class_campus`, `addTime`, `state`, `status`) VALUES
(1, 'S0001_A_01_01_1901', '19软件1班', '2019', 'S0001_A_01_01', 'S0001_A_01', 'S0001', 'S0001_A', '1587960415000', '1', '1'),
(2, 'S0001_A_01_02_1901', '19网络2班', '2019', 'S0001_A_01_02', 'S0001_A_01', 'S0001', 'S0001_A', '1587960415000', '1', '1'),
(11, 'S0001_A_01_01_1902', '19软件2班', '2019', 'S0001_A_01_01', 'S0001_A_01', 'S0001', 'S0001_A', '1591146389894', '1', '1'),
(12, 'S0001_A_01_02_1902', '19网络1班', '2019', 'S0001_A_01_02', 'S0001_A_01', 'S0001', 'S0001_A', '1591146389894', '1', '1'),
(13, 'S0001_A_01_01_1801', '18软件1班', '2018', 'S0001_A_01_01', 'S0001_A_01', 'S0001', 'S0001_A', '1591146389894', '1', '1');

-- --------------------------------------------------------

--
-- 表的结构 `base_course`
--

CREATE TABLE `base_course` (
  `id` int NOT NULL COMMENT 'id序号',
  `course_id` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '课程id',
  `course_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '课程名称',
  `course_school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `course_campus` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `course_department` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `course_profession` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在专业',
  `course_type` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '课程类型',
  `state` varchar(10) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '课程状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_course`
--

INSERT INTO `base_course` (`id`, `course_id`, `course_name`, `course_school`, `course_campus`, `course_department`, `course_profession`, `course_type`, `state`) VALUES
(2, 'S0001_A_01_01_C002', '数学', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', 'C1', '1'),
(3, 'S0001_A_01_01_C003', '语文', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', 'C1', '1'),
(4, 'S0001_A_01_01_C004', '英语', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', 'C1', '1'),
(5, 'S0001_A_01_03_C001', '会计基础', 'S0001', 'S0001_A', 'S0001_A_02', 'S0001_A_02_01', 'C2', '1'),
(6, 'S0001_A_01_01_C005', 'IT基础', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', 'C2', '1'),
(7, 'S0001_A_01_01_C006', '图形图像处理', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', 'C2', '1'),
(8, 'S0001_A_01_01_C007', '网页制作基础', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', 'C2', '1'),
(9, 'S0001_A_01_01_C008', '影视后期制作', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', 'C2', '1');

-- --------------------------------------------------------

--
-- 表的结构 `base_course_type`
--

CREATE TABLE `base_course_type` (
  `id` int NOT NULL COMMENT 'id序号',
  `course_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '课程类型id',
  `course_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '课程类型名称',
  `course_score` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '课程学分',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在班级',
  `status` varchar(6) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_course_type`
--

INSERT INTO `base_course_type` (`id`, `course_id`, `course_name`, `course_score`, `school`, `campus`, `status`, `created_user`, `addTime`) VALUES
(1, 'C1', '公共基础课', '2', 'S0001', 'S0001_A', '1', '2017217042', '1587608927000'),
(2, 'C2', '专业基础课', '2', 'S0001', 'S0001_A', '1', '2017217042', '1588579143455'),
(3, 'C3', '公共选修课', '2', 'S0001', 'S0001_A', '1', '2017217042', '1588579143455'),
(7, 'C4', '专业选修课', '2', 'S0001', 'S0001_A', '1', '2017217042', '1588579143455');

-- --------------------------------------------------------

--
-- 表的结构 `base_department`
--

CREATE TABLE `base_department` (
  `id` int NOT NULL COMMENT 'id序号',
  `department_id` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '部门id',
  `department_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '部门名称',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `department_state` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_department`
--

INSERT INTO `base_department` (`id`, `department_id`, `department_name`, `school`, `campus`, `department_state`) VALUES
(1, 'S0001_A_01', '信息部', 'S0001', 'S0001_A', '1'),
(2, 'S0001_A_02', '财经部', 'S0001', 'S0001_A', '1'),
(3, 'S0001_A_03', '商贸部', 'S0001', 'S0001_A', '1'),
(6, 'S0002_A_01', '电子信息专业教学部', 'S0002', 'S0002_A', '1'),
(7, 'S0001_A_04', '艺术部', 'S0001', 'S0001_A', '1');

-- --------------------------------------------------------

--
-- 表的结构 `base_grade`
--

CREATE TABLE `base_grade` (
  `id` int NOT NULL COMMENT 'id序号',
  `grade_id` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '年级id',
  `grade_name` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '年级名称',
  `state` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '年级状态',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `status` varchar(6) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '状态',
  `addTime` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_grade`
--

INSERT INTO `base_grade` (`id`, `grade_id`, `grade_name`, `state`, `school`, `campus`, `status`, `addTime`) VALUES
(1, '2018', '2018级', '1', 'S0001', 'S0001_A', '1', '1587960415000'),
(2, '2019', '2019级', '1', 'S0001', 'S0001_A', '1', '1587960415000');

-- --------------------------------------------------------

--
-- 表的结构 `base_profession`
--

CREATE TABLE `base_profession` (
  `id` int NOT NULL COMMENT 'id序号',
  `skill_id` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '专业id',
  `skill_name` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '专业名称',
  `skill_department` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `skill_school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `skill_campus` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `addTime` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_profession`
--

INSERT INTO `base_profession` (`id`, `skill_id`, `skill_name`, `skill_department`, `skill_school`, `skill_campus`, `addTime`) VALUES
(1, 'S0001_A_01_01', '软件与信息服务', 'S0001_A_01', 'S0001', 'S0001_A', '1587608927000'),
(2, 'S0001_A_01_02', '计算机网络技术', 'S0001_A_01', 'S0001', 'S0001_A', '1587608927000'),
(3, 'S0001_A_02_01', '会计', 'S0001_A_02', 'S0001', 'S0001_A', '1588074953292');

-- --------------------------------------------------------

--
-- 表的结构 `base_room`
--

CREATE TABLE `base_room` (
  `id` int NOT NULL COMMENT 'id序号',
  `room_id` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '房间id',
  `room_name` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '房间名称',
  `room_build` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '所在建筑',
  `room_floor` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '所在楼层',
  `room_accommodate` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '容纳人数',
  `room_department` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `room_school` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `room_campus` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `addTime` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_room`
--

INSERT INTO `base_room` (`id`, `room_id`, `room_name`, `room_build`, `room_floor`, `room_accommodate`, `room_department`, `room_school`, `room_campus`, `addTime`) VALUES
(1, 'S0001_A_01_B01_001', 'X101', 'S0001_A_01_B01', '1', '60', 'S0001_A_01', 'S0001', 'S0001_A', '1587608927000'),
(4, 'S0001_A_01_B01_002', 'X103', 'S0001_A_01_B01', '1', '60', 'S0001_A_01', 'S0001', 'S0001_A', '1590393480189'),
(5, 'S0001_A_01_B01_003', 'X105', 'S0001_A_01_B01', '1', '50', 'S0001_A_01', 'S0001', 'S0001_A', '1590393488984'),
(6, 'S0001_A_02_B01_001', 'C101', 'S0001_A_02_B01', '1', '50', 'S0001_A_02', 'S0001', 'S0001_A', '1590393501174'),
(12, 'S0001_A_01_B01_004', 'X107', 'S0001_A_01_B01', '1', '60', 'S0001_A_01', 'S0001', 'S0001_A', '1592112738453'),
(13, 'S0001_A_01_B01_005', 'X109', 'S0001_A_01_B01', '1', '60', 'S0001_A_01', 'S0001', 'S0001_A', '1592112738453'),
(14, 'S0001_A_01_B01_006', 'X111', 'S0001_A_01_B01', '1', '60', 'S0001_A_01', 'S0001', 'S0001_A', '1592112738453'),
(15, 'S0001_A_01_B01_007', 'X113', 'S0001_A_01_B01', '1', '60', 'S0001_A_01', 'S0001', 'S0001_A', '1592112738453'),
(16, 'S0001_A_01_B01_008', 'X115', 'S0001_A_01_B01', '1', '60', 'S0001_A_01', 'S0001', 'S0001_A', '1592112738453');

-- --------------------------------------------------------

--
-- 表的结构 `base_schedule`
--

CREATE TABLE `base_schedule` (
  `id` int NOT NULL COMMENT 'id序号',
  `schedule_id` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '作息id',
  `schedule_name` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '作息名称',
  `schedule_start` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '作息开始时间',
  `schedule_end` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '作息结束时间',
  `schedule_order` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '作息顺序',
  `schedule_type` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '作息类型',
  `remake` varchar(100) COLLATE utf8_bin DEFAULT NULL COMMENT '备注',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间',
  `status` varchar(6) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_schedule`
--

INSERT INTO `base_schedule` (`id`, `schedule_id`, `schedule_name`, `schedule_start`, `schedule_end`, `schedule_order`, `schedule_type`, `remake`, `school`, `campus`, `created_user`, `addTime`, `status`) VALUES
(1, 'ZX1', '第一节课', '08:20', '09:00', '1', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1587608927000', '1'),
(2, 'ZX2', '第二节课', '09:10', '09:50', '2', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1588579143455', '1'),
(3, 'ZX3', '眼保健操', '09:50', '09:55', '3', 'between_classes', NULL, 'S0001', 'S0001_A', '2017217042', '1587608927000', '1'),
(4, 'ZX4', '第三节课', '10:05', '10:45', '4', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1588579143455', '1'),
(5, 'ZX5', '第四节课', '10:55', '11:35', '5', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1587608927000', '1'),
(6, 'ZX6', '午休', '11:35', '14:30', '6', 'rest', NULL, 'S0001', 'S0001_A', '2017217042', '1588579143455', '1'),
(7, 'ZX7', '第五节课', '14:30', '15:10', '7', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1587608927000', '1'),
(8, 'ZX8', '第六节课', '15:20', '16:00', '8', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1588579143455', '1'),
(9, 'ZX9', '第七节课', '16:10', '16:50', '9', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1587608927000', '1'),
(10, 'ZX10', '晚修第一节', '19:30', '20:10', '10', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1588579143455', '1'),
(11, 'ZX11', '晚修第二节', '20:20', '21:00', '11', 'teach', NULL, 'S0001', 'S0001_A', '2017217042', '1587608927000', '1'),
(12, 'ZX12', '夜寝', '21:50', '07:20', '12', 'rest', '睡觉', 'S0001', 'S0001_A', '2017217042', '1588579143455', '1');

-- --------------------------------------------------------

--
-- 表的结构 `base_school`
--

CREATE TABLE `base_school` (
  `id` tinyint NOT NULL COMMENT 'id序号',
  `school_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校id',
  `school_name` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '学校名称',
  `addTime` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `base_school`
--

INSERT INTO `base_school` (`id`, `school_id`, `school_name`, `addTime`) VALUES
(1, 'S0001', '深圳某某某某技术学校', '1587535405000'),
(4, 'S0002', '山东某某某某技术中专', '1587994366707');

-- --------------------------------------------------------

--
-- 表的结构 `base_semester`
--

CREATE TABLE `base_semester` (
  `id` int NOT NULL COMMENT 'id序号',
  `semesterId` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '学期ID',
  `semester` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '学期名称',
  `administrative_start` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '行政开始时间',
  `administrative_end` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '行政结束时间',
  `teach_start` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '教学开始时间',
  `teach_end` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '教学结束时间',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `addTime` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '创建时间',
  `founder` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '创建者',
  `state` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='学期表格';

--
-- 转存表中的数据 `base_semester`
--

INSERT INTO `base_semester` (`id`, `semesterId`, `semester`, `administrative_start`, `administrative_end`, `teach_start`, `teach_end`, `campus`, `school`, `addTime`, `founder`, `state`) VALUES
(1, '192002', '2019-2020第二学期', '1581292800000', '1594944000000', '1581897600000', '1594339200000', 'S0001_A', 'S0001', '1587513600000', '2017217042', '0'),
(9, '202101', '2020-2021第一学期', '1598198400000', '1611244800000', '1598803200000', '1610640000000', 'S0001_A', 'S0001', '1592711790093', '2017217001', '1');

-- --------------------------------------------------------

--
-- 表的结构 `china_areas`
--

CREATE TABLE `china_areas` (
  `id` int NOT NULL,
  `areaid` varchar(20) NOT NULL,
  `area` varchar(50) NOT NULL,
  `cityid` varchar(20) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='行政区域县区信息表';

--
-- 转存表中的数据 `china_areas`
--

INSERT INTO `china_areas` (`id`, `areaid`, `area`, `cityid`) VALUES
(1, '110101', '东城区', '110100'),
(2, '110102', '西城区', '110100'),
(3, '110103', '崇文区', '110100'),
(4, '110104', '宣武区', '110100'),
(5, '110105', '朝阳区', '110100'),
(6, '110106', '丰台区', '110100'),
(7, '110107', '石景山区', '110100'),
(8, '110108', '海淀区', '110100'),
(9, '110109', '门头沟区', '110100'),
(10, '110111', '房山区', '110100'),
(11, '110112', '通州区', '110100'),
(12, '110113', '顺义区', '110100'),
(13, '110114', '昌平区', '110100'),
(14, '110115', '大兴区', '110100'),
(15, '110116', '怀柔区', '110100'),
(16, '110117', '平谷区', '110100'),
(17, '110228', '密云县', '110200'),
(18, '110229', '延庆县', '110200'),
(19, '120101', '和平区', '120100'),
(20, '120102', '河东区', '120100'),
(21, '120103', '河西区', '120100'),
(22, '120104', '南开区', '120100'),
(23, '120105', '河北区', '120100'),
(24, '120106', '红桥区', '120100'),
(25, '120107', '塘沽区', '120100'),
(26, '120108', '汉沽区', '120100'),
(27, '120109', '大港区', '120100'),
(28, '120110', '东丽区', '120100'),
(29, '120111', '西青区', '120100'),
(30, '120112', '津南区', '120100'),
(31, '120113', '北辰区', '120100'),
(32, '120114', '武清区', '120100'),
(33, '120115', '宝坻区', '120100'),
(34, '120221', '宁河县', '120200'),
(35, '120223', '静海县', '120200'),
(36, '120225', '蓟　县', '120200'),
(37, '130101', '市辖区', '130100'),
(38, '130102', '长安区', '130100'),
(39, '130103', '桥东区', '130100'),
(40, '130104', '桥西区', '130100'),
(41, '130105', '新华区', '130100'),
(42, '130107', '井陉矿区', '130100'),
(43, '130108', '裕华区', '130100'),
(44, '130121', '井陉县', '130100'),
(45, '130123', '正定县', '130100'),
(46, '130124', '栾城县', '130100'),
(47, '130125', '行唐县', '130100'),
(48, '130126', '灵寿县', '130100'),
(49, '130127', '高邑县', '130100'),
(50, '130128', '深泽县', '130100'),
(51, '130129', '赞皇县', '130100'),
(52, '130130', '无极县', '130100'),
(53, '130131', '平山县', '130100'),
(54, '130132', '元氏县', '130100'),
(55, '130133', '赵　县', '130100'),
(56, '130181', '辛集市', '130100'),
(57, '130182', '藁城市', '130100'),
(58, '130183', '晋州市', '130100'),
(59, '130184', '新乐市', '130100'),
(60, '130185', '鹿泉市', '130100'),
(61, '130201', '市辖区', '130200'),
(62, '130202', '路南区', '130200'),
(63, '130203', '路北区', '130200'),
(64, '130204', '古冶区', '130200'),
(65, '130205', '开平区', '130200'),
(66, '130207', '丰南区', '130200'),
(67, '130208', '丰润区', '130200'),
(68, '130223', '滦　县', '130200'),
(69, '130224', '滦南县', '130200'),
(70, '130225', '乐亭县', '130200'),
(71, '130227', '迁西县', '130200'),
(72, '130229', '玉田县', '130200'),
(73, '130230', '唐海县', '130200'),
(74, '130281', '遵化市', '130200'),
(75, '130283', '迁安市', '130200'),
(76, '130301', '市辖区', '130300'),
(77, '130302', '海港区', '130300'),
(78, '130303', '山海关区', '130300'),
(79, '130304', '北戴河区', '130300'),
(80, '130321', '青龙满族自治县', '130300'),
(81, '130322', '昌黎县', '130300'),
(82, '130323', '抚宁县', '130300'),
(83, '130324', '卢龙县', '130300'),
(84, '130401', '市辖区', '130400'),
(85, '130402', '邯山区', '130400'),
(86, '130403', '丛台区', '130400'),
(87, '130404', '复兴区', '130400'),
(88, '130406', '峰峰矿区', '130400'),
(89, '130421', '邯郸县', '130400'),
(90, '130423', '临漳县', '130400'),
(91, '130424', '成安县', '130400'),
(92, '130425', '大名县', '130400'),
(93, '130426', '涉　县', '130400'),
(94, '130427', '磁　县', '130400'),
(95, '130428', '肥乡县', '130400'),
(96, '130429', '永年县', '130400'),
(97, '130430', '邱　县', '130400'),
(98, '130431', '鸡泽县', '130400'),
(99, '130432', '广平县', '130400'),
(100, '130433', '馆陶县', '130400'),
(101, '130434', '魏　县', '130400'),
(102, '130435', '曲周县', '130400'),
(103, '130481', '武安市', '130400'),
(104, '130501', '市辖区', '130500'),
(105, '130502', '桥东区', '130500'),
(106, '130503', '桥西区', '130500'),
(107, '130521', '邢台县', '130500'),
(108, '130522', '临城县', '130500'),
(109, '130523', '内丘县', '130500'),
(110, '130524', '柏乡县', '130500'),
(111, '130525', '隆尧县', '130500'),
(112, '130526', '任　县', '130500'),
(113, '130527', '南和县', '130500'),
(114, '130528', '宁晋县', '130500'),
(115, '130529', '巨鹿县', '130500'),
(116, '130530', '新河县', '130500'),
(117, '130531', '广宗县', '130500'),
(118, '130532', '平乡县', '130500'),
(119, '130533', '威　县', '130500'),
(120, '130534', '清河县', '130500'),
(121, '130535', '临西县', '130500'),
(122, '130581', '南宫市', '130500'),
(123, '130582', '沙河市', '130500'),
(124, '130601', '市辖区', '130600'),
(125, '130602', '新市区', '130600'),
(126, '130603', '北市区', '130600'),
(127, '130604', '南市区', '130600'),
(128, '130621', '满城县', '130600'),
(129, '130622', '清苑县', '130600'),
(130, '130623', '涞水县', '130600'),
(131, '130624', '阜平县', '130600'),
(132, '130625', '徐水县', '130600'),
(133, '130626', '定兴县', '130600'),
(134, '130627', '唐　县', '130600'),
(135, '130628', '高阳县', '130600'),
(136, '130629', '容城县', '130600'),
(137, '130630', '涞源县', '130600'),
(138, '130631', '望都县', '130600'),
(139, '130632', '安新县', '130600'),
(140, '130633', '易　县', '130600'),
(141, '130634', '曲阳县', '130600'),
(142, '130635', '蠡　县', '130600'),
(143, '130636', '顺平县', '130600'),
(144, '130637', '博野县', '130600'),
(145, '130638', '雄　县', '130600'),
(146, '130681', '涿州市', '130600'),
(147, '130682', '定州市', '130600'),
(148, '130683', '安国市', '130600'),
(149, '130684', '高碑店市', '130600'),
(150, '130701', '市辖区', '130700'),
(151, '130702', '桥东区', '130700'),
(152, '130703', '桥西区', '130700'),
(153, '130705', '宣化区', '130700'),
(154, '130706', '下花园区', '130700'),
(155, '130721', '宣化县', '130700'),
(156, '130722', '张北县', '130700'),
(157, '130723', '康保县', '130700'),
(158, '130724', '沽源县', '130700'),
(159, '130725', '尚义县', '130700'),
(160, '130726', '蔚　县', '130700'),
(161, '130727', '阳原县', '130700'),
(162, '130728', '怀安县', '130700'),
(163, '130729', '万全县', '130700'),
(164, '130730', '怀来县', '130700'),
(165, '130731', '涿鹿县', '130700'),
(166, '130732', '赤城县', '130700'),
(167, '130733', '崇礼县', '130700'),
(168, '130801', '市辖区', '130800'),
(169, '130802', '双桥区', '130800'),
(170, '130803', '双滦区', '130800'),
(171, '130804', '鹰手营子矿区', '130800'),
(172, '130821', '承德县', '130800'),
(173, '130822', '兴隆县', '130800'),
(174, '130823', '平泉县', '130800'),
(175, '130824', '滦平县', '130800'),
(176, '130825', '隆化县', '130800'),
(177, '130826', '丰宁满族自治县', '130800'),
(178, '130827', '宽城满族自治县', '130800'),
(179, '130828', '围场满族蒙古族自治县', '130800'),
(180, '130901', '市辖区', '130900'),
(181, '130902', '新华区', '130900'),
(182, '130903', '运河区', '130900'),
(183, '130921', '沧　县', '130900'),
(184, '130922', '青　县', '130900'),
(185, '130923', '东光县', '130900'),
(186, '130924', '海兴县', '130900'),
(187, '130925', '盐山县', '130900'),
(188, '130926', '肃宁县', '130900'),
(189, '130927', '南皮县', '130900'),
(190, '130928', '吴桥县', '130900'),
(191, '130929', '献　县', '130900'),
(192, '130930', '孟村回族自治县', '130900'),
(193, '130981', '泊头市', '130900'),
(194, '130982', '任丘市', '130900'),
(195, '130983', '黄骅市', '130900'),
(196, '130984', '河间市', '130900'),
(197, '131001', '市辖区', '131000'),
(198, '131002', '安次区', '131000'),
(199, '131003', '广阳区', '131000'),
(200, '131022', '固安县', '131000'),
(201, '131023', '永清县', '131000'),
(202, '131024', '香河县', '131000'),
(203, '131025', '大城县', '131000'),
(204, '131026', '文安县', '131000'),
(205, '131028', '大厂回族自治县', '131000'),
(206, '131081', '霸州市', '131000'),
(207, '131082', '三河市', '131000'),
(208, '131101', '市辖区', '131100'),
(209, '131102', '桃城区', '131100'),
(210, '131121', '枣强县', '131100'),
(211, '131122', '武邑县', '131100'),
(212, '131123', '武强县', '131100'),
(213, '131124', '饶阳县', '131100'),
(214, '131125', '安平县', '131100'),
(215, '131126', '故城县', '131100'),
(216, '131127', '景　县', '131100'),
(217, '131128', '阜城县', '131100'),
(218, '131181', '冀州市', '131100'),
(219, '131182', '深州市', '131100'),
(220, '140101', '市辖区', '140100'),
(221, '140105', '小店区', '140100'),
(222, '140106', '迎泽区', '140100'),
(223, '140107', '杏花岭区', '140100'),
(224, '140108', '尖草坪区', '140100'),
(225, '140109', '万柏林区', '140100'),
(226, '140110', '晋源区', '140100'),
(227, '140121', '清徐县', '140100'),
(228, '140122', '阳曲县', '140100'),
(229, '140123', '娄烦县', '140100'),
(230, '140181', '古交市', '140100'),
(231, '140201', '市辖区', '140200'),
(232, '140202', '城　区', '140200'),
(233, '140203', '矿　区', '140200'),
(234, '140211', '南郊区', '140200'),
(235, '140212', '新荣区', '140200'),
(236, '140221', '阳高县', '140200'),
(237, '140222', '天镇县', '140200'),
(238, '140223', '广灵县', '140200'),
(239, '140224', '灵丘县', '140200'),
(240, '140225', '浑源县', '140200'),
(241, '140226', '左云县', '140200'),
(242, '140227', '大同县', '140200'),
(243, '140301', '市辖区', '140300'),
(244, '140302', '城　区', '140300'),
(245, '140303', '矿　区', '140300'),
(246, '140311', '郊　区', '140300'),
(247, '140321', '平定县', '140300'),
(248, '140322', '盂　县', '140300'),
(249, '140401', '市辖区', '140400'),
(250, '140402', '城　区', '140400'),
(251, '140411', '郊　区', '140400'),
(252, '140421', '长治县', '140400'),
(253, '140423', '襄垣县', '140400'),
(254, '140424', '屯留县', '140400'),
(255, '140425', '平顺县', '140400'),
(256, '140426', '黎城县', '140400'),
(257, '140427', '壶关县', '140400'),
(258, '140428', '长子县', '140400'),
(259, '140429', '武乡县', '140400'),
(260, '140430', '沁　县', '140400'),
(261, '140431', '沁源县', '140400'),
(262, '140481', '潞城市', '140400'),
(263, '140501', '市辖区', '140500'),
(264, '140502', '城　区', '140500'),
(265, '140521', '沁水县', '140500'),
(266, '140522', '阳城县', '140500'),
(267, '140524', '陵川县', '140500'),
(268, '140525', '泽州县', '140500'),
(269, '140581', '高平市', '140500'),
(270, '140601', '市辖区', '140600'),
(271, '140602', '朔城区', '140600'),
(272, '140603', '平鲁区', '140600'),
(273, '140621', '山阴县', '140600'),
(274, '140622', '应　县', '140600'),
(275, '140623', '右玉县', '140600'),
(276, '140624', '怀仁县', '140600'),
(277, '140701', '市辖区', '140700'),
(278, '140702', '榆次区', '140700'),
(279, '140721', '榆社县', '140700'),
(280, '140722', '左权县', '140700'),
(281, '140723', '和顺县', '140700'),
(282, '140724', '昔阳县', '140700'),
(283, '140725', '寿阳县', '140700'),
(284, '140726', '太谷县', '140700'),
(285, '140727', '祁　县', '140700'),
(286, '140728', '平遥县', '140700'),
(287, '140729', '灵石县', '140700'),
(288, '140781', '介休市', '140700'),
(289, '140801', '市辖区', '140800'),
(290, '140802', '盐湖区', '140800'),
(291, '140821', '临猗县', '140800'),
(292, '140822', '万荣县', '140800'),
(293, '140823', '闻喜县', '140800'),
(294, '140824', '稷山县', '140800'),
(295, '140825', '新绛县', '140800'),
(296, '140826', '绛　县', '140800'),
(297, '140827', '垣曲县', '140800'),
(298, '140828', '夏　县', '140800'),
(299, '140829', '平陆县', '140800'),
(300, '140830', '芮城县', '140800'),
(301, '140881', '永济市', '140800'),
(302, '140882', '河津市', '140800'),
(303, '140901', '市辖区', '140900'),
(304, '140902', '忻府区', '140900'),
(305, '140921', '定襄县', '140900'),
(306, '140922', '五台县', '140900'),
(307, '140923', '代　县', '140900'),
(308, '140924', '繁峙县', '140900'),
(309, '140925', '宁武县', '140900'),
(310, '140926', '静乐县', '140900'),
(311, '140927', '神池县', '140900'),
(312, '140928', '五寨县', '140900'),
(313, '140929', '岢岚县', '140900'),
(314, '140930', '河曲县', '140900'),
(315, '140931', '保德县', '140900'),
(316, '140932', '偏关县', '140900'),
(317, '140981', '原平市', '140900'),
(318, '141001', '市辖区', '141000'),
(319, '141002', '尧都区', '141000'),
(320, '141021', '曲沃县', '141000'),
(321, '141022', '翼城县', '141000'),
(322, '141023', '襄汾县', '141000'),
(323, '141024', '洪洞县', '141000'),
(324, '141025', '古　县', '141000'),
(325, '141026', '安泽县', '141000'),
(326, '141027', '浮山县', '141000'),
(327, '141028', '吉　县', '141000'),
(328, '141029', '乡宁县', '141000'),
(329, '141030', '大宁县', '141000'),
(330, '141031', '隰　县', '141000'),
(331, '141032', '永和县', '141000'),
(332, '141033', '蒲　县', '141000'),
(333, '141034', '汾西县', '141000'),
(334, '141081', '侯马市', '141000'),
(335, '141082', '霍州市', '141000'),
(336, '141101', '市辖区', '141100'),
(337, '141102', '离石区', '141100'),
(338, '141121', '文水县', '141100'),
(339, '141122', '交城县', '141100'),
(340, '141123', '兴　县', '141100'),
(341, '141124', '临　县', '141100'),
(342, '141125', '柳林县', '141100'),
(343, '141126', '石楼县', '141100'),
(344, '141127', '岚　县', '141100'),
(345, '141128', '方山县', '141100'),
(346, '141129', '中阳县', '141100'),
(347, '141130', '交口县', '141100'),
(348, '141181', '孝义市', '141100'),
(349, '141182', '汾阳市', '141100'),
(350, '150101', '市辖区', '150100'),
(351, '150102', '新城区', '150100'),
(352, '150103', '回民区', '150100'),
(353, '150104', '玉泉区', '150100'),
(354, '150105', '赛罕区', '150100'),
(355, '150121', '土默特左旗', '150100'),
(356, '150122', '托克托县', '150100'),
(357, '150123', '和林格尔县', '150100'),
(358, '150124', '清水河县', '150100'),
(359, '150125', '武川县', '150100'),
(360, '150201', '市辖区', '150200'),
(361, '150202', '东河区', '150200'),
(362, '150203', '昆都仑区', '150200'),
(363, '150204', '青山区', '150200'),
(364, '150205', '石拐区', '150200'),
(365, '150206', '白云矿区', '150200'),
(366, '150207', '九原区', '150200'),
(367, '150221', '土默特右旗', '150200'),
(368, '150222', '固阳县', '150200'),
(369, '150223', '达尔罕茂明安联合旗', '150200'),
(370, '150301', '市辖区', '150300'),
(371, '150302', '海勃湾区', '150300'),
(372, '150303', '海南区', '150300'),
(373, '150304', '乌达区', '150300'),
(374, '150401', '市辖区', '150400'),
(375, '150402', '红山区', '150400'),
(376, '150403', '元宝山区', '150400'),
(377, '150404', '松山区', '150400'),
(378, '150421', '阿鲁科尔沁旗', '150400'),
(379, '150422', '巴林左旗', '150400'),
(380, '150423', '巴林右旗', '150400'),
(381, '150424', '林西县', '150400'),
(382, '150425', '克什克腾旗', '150400'),
(383, '150426', '翁牛特旗', '150400'),
(384, '150428', '喀喇沁旗', '150400'),
(385, '150429', '宁城县', '150400'),
(386, '150430', '敖汉旗', '150400'),
(387, '150501', '市辖区', '150500'),
(388, '150502', '科尔沁区', '150500'),
(389, '150521', '科尔沁左翼中旗', '150500'),
(390, '150522', '科尔沁左翼后旗', '150500'),
(391, '150523', '开鲁县', '150500'),
(392, '150524', '库伦旗', '150500'),
(393, '150525', '奈曼旗', '150500'),
(394, '150526', '扎鲁特旗', '150500'),
(395, '150581', '霍林郭勒市', '150500'),
(396, '150602', '东胜区', '150600'),
(397, '150621', '达拉特旗', '150600'),
(398, '150622', '准格尔旗', '150600'),
(399, '150623', '鄂托克前旗', '150600'),
(400, '150624', '鄂托克旗', '150600'),
(401, '150625', '杭锦旗', '150600'),
(402, '150626', '乌审旗', '150600'),
(403, '150627', '伊金霍洛旗', '150600'),
(404, '150701', '市辖区', '150700'),
(405, '150702', '海拉尔区', '150700'),
(406, '150721', '阿荣旗', '150700'),
(407, '150722', '莫力达瓦达斡尔族自治旗', '150700'),
(408, '150723', '鄂伦春自治旗', '150700'),
(409, '150724', '鄂温克族自治旗', '150700'),
(410, '150725', '陈巴尔虎旗', '150700'),
(411, '150726', '新巴尔虎左旗', '150700'),
(412, '150727', '新巴尔虎右旗', '150700'),
(413, '150781', '满洲里市', '150700'),
(414, '150782', '牙克石市', '150700'),
(415, '150783', '扎兰屯市', '150700'),
(416, '150784', '额尔古纳市', '150700'),
(417, '150785', '根河市', '150700'),
(418, '150801', '市辖区', '150800'),
(419, '150802', '临河区', '150800'),
(420, '150821', '五原县', '150800'),
(421, '150822', '磴口县', '150800'),
(422, '150823', '乌拉特前旗', '150800'),
(423, '150824', '乌拉特中旗', '150800'),
(424, '150825', '乌拉特后旗', '150800'),
(425, '150826', '杭锦后旗', '150800'),
(426, '150901', '市辖区', '150900'),
(427, '150902', '集宁区', '150900'),
(428, '150921', '卓资县', '150900'),
(429, '150922', '化德县', '150900'),
(430, '150923', '商都县', '150900'),
(431, '150924', '兴和县', '150900'),
(432, '150925', '凉城县', '150900'),
(433, '150926', '察哈尔右翼前旗', '150900'),
(434, '150927', '察哈尔右翼中旗', '150900'),
(435, '150928', '察哈尔右翼后旗', '150900'),
(436, '150929', '四子王旗', '150900'),
(437, '150981', '丰镇市', '150900'),
(438, '152201', '乌兰浩特市', '152200'),
(439, '152202', '阿尔山市', '152200'),
(440, '152221', '科尔沁右翼前旗', '152200'),
(441, '152222', '科尔沁右翼中旗', '152200'),
(442, '152223', '扎赉特旗', '152200'),
(443, '152224', '突泉县', '152200'),
(444, '152501', '二连浩特市', '152500'),
(445, '152502', '锡林浩特市', '152500'),
(446, '152522', '阿巴嘎旗', '152500'),
(447, '152523', '苏尼特左旗', '152500'),
(448, '152524', '苏尼特右旗', '152500'),
(449, '152525', '东乌珠穆沁旗', '152500'),
(450, '152526', '西乌珠穆沁旗', '152500'),
(451, '152527', '太仆寺旗', '152500'),
(452, '152528', '镶黄旗', '152500'),
(453, '152529', '正镶白旗', '152500'),
(454, '152530', '正蓝旗', '152500'),
(455, '152531', '多伦县', '152500'),
(456, '152921', '阿拉善左旗', '152900'),
(457, '152922', '阿拉善右旗', '152900'),
(458, '152923', '额济纳旗', '152900'),
(459, '210101', '市辖区', '210100'),
(460, '210102', '和平区', '210100'),
(461, '210103', '沈河区', '210100'),
(462, '210104', '大东区', '210100'),
(463, '210105', '皇姑区', '210100'),
(464, '210106', '铁西区', '210100'),
(465, '210111', '苏家屯区', '210100'),
(466, '210112', '东陵区', '210100'),
(467, '210113', '新城子区', '210100'),
(468, '210114', '于洪区', '210100'),
(469, '210122', '辽中县', '210100'),
(470, '210123', '康平县', '210100'),
(471, '210124', '法库县', '210100'),
(472, '210181', '新民市', '210100'),
(473, '210201', '市辖区', '210200'),
(474, '210202', '中山区', '210200'),
(475, '210203', '西岗区', '210200'),
(476, '210204', '沙河口区', '210200'),
(477, '210211', '甘井子区', '210200'),
(478, '210212', '旅顺口区', '210200'),
(479, '210213', '金州区', '210200'),
(480, '210224', '长海县', '210200'),
(481, '210281', '瓦房店市', '210200'),
(482, '210282', '普兰店市', '210200'),
(483, '210283', '庄河市', '210200'),
(484, '210301', '市辖区', '210300'),
(485, '210302', '铁东区', '210300'),
(486, '210303', '铁西区', '210300'),
(487, '210304', '立山区', '210300'),
(488, '210311', '千山区', '210300'),
(489, '210321', '台安县', '210300'),
(490, '210323', '岫岩满族自治县', '210300'),
(491, '210381', '海城市', '210300'),
(492, '210401', '市辖区', '210400'),
(493, '210402', '新抚区', '210400'),
(494, '210403', '东洲区', '210400'),
(495, '210404', '望花区', '210400'),
(496, '210411', '顺城区', '210400'),
(497, '210421', '抚顺县', '210400'),
(498, '210422', '新宾满族自治县', '210400'),
(499, '210423', '清原满族自治县', '210400'),
(500, '210501', '市辖区', '210500'),
(501, '210502', '平山区', '210500'),
(502, '210503', '溪湖区', '210500'),
(503, '210504', '明山区', '210500'),
(504, '210505', '南芬区', '210500'),
(505, '210521', '本溪满族自治县', '210500'),
(506, '210522', '桓仁满族自治县', '210500'),
(507, '210601', '市辖区', '210600'),
(508, '210602', '元宝区', '210600'),
(509, '210603', '振兴区', '210600'),
(510, '210604', '振安区', '210600'),
(511, '210624', '宽甸满族自治县', '210600'),
(512, '210681', '东港市', '210600'),
(513, '210682', '凤城市', '210600'),
(514, '210701', '市辖区', '210700'),
(515, '210702', '古塔区', '210700'),
(516, '210703', '凌河区', '210700'),
(517, '210711', '太和区', '210700'),
(518, '210726', '黑山县', '210700'),
(519, '210727', '义　县', '210700'),
(520, '210781', '凌海市', '210700'),
(521, '210782', '北宁市', '210700'),
(522, '210801', '市辖区', '210800'),
(523, '210802', '站前区', '210800'),
(524, '210803', '西市区', '210800'),
(525, '210804', '鲅鱼圈区', '210800'),
(526, '210811', '老边区', '210800'),
(527, '210881', '盖州市', '210800'),
(528, '210882', '大石桥市', '210800'),
(529, '210901', '市辖区', '210900'),
(530, '210902', '海州区', '210900'),
(531, '210903', '新邱区', '210900'),
(532, '210904', '太平区', '210900'),
(533, '210905', '清河门区', '210900'),
(534, '210911', '细河区', '210900'),
(535, '210921', '阜新蒙古族自治县', '210900'),
(536, '210922', '彰武县', '210900'),
(537, '211001', '市辖区', '211000'),
(538, '211002', '白塔区', '211000'),
(539, '211003', '文圣区', '211000'),
(540, '211004', '宏伟区', '211000'),
(541, '211005', '弓长岭区', '211000'),
(542, '211011', '太子河区', '211000'),
(543, '211021', '辽阳县', '211000'),
(544, '211081', '灯塔市', '211000'),
(545, '211101', '市辖区', '211100'),
(546, '211102', '双台子区', '211100'),
(547, '211103', '兴隆台区', '211100'),
(548, '211121', '大洼县', '211100'),
(549, '211122', '盘山县', '211100'),
(550, '211201', '市辖区', '211200'),
(551, '211202', '银州区', '211200'),
(552, '211204', '清河区', '211200'),
(553, '211221', '铁岭县', '211200'),
(554, '211223', '西丰县', '211200'),
(555, '211224', '昌图县', '211200'),
(556, '211281', '调兵山市', '211200'),
(557, '211282', '开原市', '211200'),
(558, '211301', '市辖区', '211300'),
(559, '211302', '双塔区', '211300'),
(560, '211303', '龙城区', '211300'),
(561, '211321', '朝阳县', '211300'),
(562, '211322', '建平县', '211300'),
(563, '211324', '喀喇沁左翼蒙古族自治县', '211300'),
(564, '211381', '北票市', '211300'),
(565, '211382', '凌源市', '211300'),
(566, '211401', '市辖区', '211400'),
(567, '211402', '连山区', '211400'),
(568, '211403', '龙港区', '211400'),
(569, '211404', '南票区', '211400'),
(570, '211421', '绥中县', '211400'),
(571, '211422', '建昌县', '211400'),
(572, '211481', '兴城市', '211400'),
(573, '220101', '市辖区', '220100'),
(574, '220102', '南关区', '220100'),
(575, '220103', '宽城区', '220100'),
(576, '220104', '朝阳区', '220100'),
(577, '220105', '二道区', '220100'),
(578, '220106', '绿园区', '220100'),
(579, '220112', '双阳区', '220100'),
(580, '220122', '农安县', '220100'),
(581, '220181', '九台市', '220100'),
(582, '220182', '榆树市', '220100'),
(583, '220183', '德惠市', '220100'),
(584, '220201', '市辖区', '220200'),
(585, '220202', '昌邑区', '220200'),
(586, '220203', '龙潭区', '220200'),
(587, '220204', '船营区', '220200'),
(588, '220211', '丰满区', '220200'),
(589, '220221', '永吉县', '220200'),
(590, '220281', '蛟河市', '220200'),
(591, '220282', '桦甸市', '220200'),
(592, '220283', '舒兰市', '220200'),
(593, '220284', '磐石市', '220200'),
(594, '220301', '市辖区', '220300'),
(595, '220302', '铁西区', '220300'),
(596, '220303', '铁东区', '220300'),
(597, '220322', '梨树县', '220300'),
(598, '220323', '伊通满族自治县', '220300'),
(599, '220381', '公主岭市', '220300'),
(600, '220382', '双辽市', '220300'),
(601, '220401', '市辖区', '220400'),
(602, '220402', '龙山区', '220400'),
(603, '220403', '西安区', '220400'),
(604, '220421', '东丰县', '220400'),
(605, '220422', '东辽县', '220400'),
(606, '220501', '市辖区', '220500'),
(607, '220502', '东昌区', '220500'),
(608, '220503', '二道江区', '220500'),
(609, '220521', '通化县', '220500'),
(610, '220523', '辉南县', '220500'),
(611, '220524', '柳河县', '220500'),
(612, '220581', '梅河口市', '220500'),
(613, '220582', '集安市', '220500'),
(614, '220601', '市辖区', '220600'),
(615, '220602', '八道江区', '220600'),
(616, '220621', '抚松县', '220600'),
(617, '220622', '靖宇县', '220600'),
(618, '220623', '长白朝鲜族自治县', '220600'),
(619, '220625', '江源县', '220600'),
(620, '220681', '临江市', '220600'),
(621, '220701', '市辖区', '220700'),
(622, '220702', '宁江区', '220700'),
(623, '220721', '前郭尔罗斯蒙古族自治县', '220700'),
(624, '220722', '长岭县', '220700'),
(625, '220723', '乾安县', '220700'),
(626, '220724', '扶余县', '220700'),
(627, '220801', '市辖区', '220800'),
(628, '220802', '洮北区', '220800'),
(629, '220821', '镇赉县', '220800'),
(630, '220822', '通榆县', '220800'),
(631, '220881', '洮南市', '220800'),
(632, '220882', '大安市', '220800'),
(633, '222401', '延吉市', '222400'),
(634, '222402', '图们市', '222400'),
(635, '222403', '敦化市', '222400'),
(636, '222404', '珲春市', '222400'),
(637, '222405', '龙井市', '222400'),
(638, '222406', '和龙市', '222400'),
(639, '222424', '汪清县', '222400'),
(640, '222426', '安图县', '222400'),
(641, '230101', '市辖区', '230100'),
(642, '230102', '道里区', '230100'),
(643, '230103', '南岗区', '230100'),
(644, '230104', '道外区', '230100'),
(645, '230106', '香坊区', '230100'),
(646, '230107', '动力区', '230100'),
(647, '230108', '平房区', '230100'),
(648, '230109', '松北区', '230100'),
(649, '230111', '呼兰区', '230100'),
(650, '230123', '依兰县', '230100'),
(651, '230124', '方正县', '230100'),
(652, '230125', '宾　县', '230100'),
(653, '230126', '巴彦县', '230100'),
(654, '230127', '木兰县', '230100'),
(655, '230128', '通河县', '230100'),
(656, '230129', '延寿县', '230100'),
(657, '230181', '阿城市', '230100'),
(658, '230182', '双城市', '230100'),
(659, '230183', '尚志市', '230100'),
(660, '230184', '五常市', '230100'),
(661, '230201', '市辖区', '230200'),
(662, '230202', '龙沙区', '230200'),
(663, '230203', '建华区', '230200'),
(664, '230204', '铁锋区', '230200'),
(665, '230205', '昂昂溪区', '230200'),
(666, '230206', '富拉尔基区', '230200'),
(667, '230207', '碾子山区', '230200'),
(668, '230208', '梅里斯达斡尔族区', '230200'),
(669, '230221', '龙江县', '230200'),
(670, '230223', '依安县', '230200'),
(671, '230224', '泰来县', '230200'),
(672, '230225', '甘南县', '230200'),
(673, '230227', '富裕县', '230200'),
(674, '230229', '克山县', '230200'),
(675, '230230', '克东县', '230200'),
(676, '230231', '拜泉县', '230200'),
(677, '230281', '讷河市', '230200'),
(678, '230301', '市辖区', '230300'),
(679, '230302', '鸡冠区', '230300'),
(680, '230303', '恒山区', '230300'),
(681, '230304', '滴道区', '230300'),
(682, '230305', '梨树区', '230300'),
(683, '230306', '城子河区', '230300'),
(684, '230307', '麻山区', '230300'),
(685, '230321', '鸡东县', '230300'),
(686, '230381', '虎林市', '230300'),
(687, '230382', '密山市', '230300'),
(688, '230401', '市辖区', '230400'),
(689, '230402', '向阳区', '230400'),
(690, '230403', '工农区', '230400'),
(691, '230404', '南山区', '230400'),
(692, '230405', '兴安区', '230400'),
(693, '230406', '东山区', '230400'),
(694, '230407', '兴山区', '230400'),
(695, '230421', '萝北县', '230400'),
(696, '230422', '绥滨县', '230400'),
(697, '230501', '市辖区', '230500'),
(698, '230502', '尖山区', '230500'),
(699, '230503', '岭东区', '230500'),
(700, '230505', '四方台区', '230500'),
(701, '230506', '宝山区', '230500'),
(702, '230521', '集贤县', '230500'),
(703, '230522', '友谊县', '230500'),
(704, '230523', '宝清县', '230500'),
(705, '230524', '饶河县', '230500'),
(706, '230601', '市辖区', '230600'),
(707, '230602', '萨尔图区', '230600'),
(708, '230603', '龙凤区', '230600'),
(709, '230604', '让胡路区', '230600'),
(710, '230605', '红岗区', '230600'),
(711, '230606', '大同区', '230600'),
(712, '230621', '肇州县', '230600'),
(713, '230622', '肇源县', '230600'),
(714, '230623', '林甸县', '230600'),
(715, '230624', '杜尔伯特蒙古族自治县', '230600'),
(716, '230701', '市辖区', '230700'),
(717, '230702', '伊春区', '230700'),
(718, '230703', '南岔区', '230700'),
(719, '230704', '友好区', '230700'),
(720, '230705', '西林区', '230700'),
(721, '230706', '翠峦区', '230700'),
(722, '230707', '新青区', '230700'),
(723, '230708', '美溪区', '230700'),
(724, '230709', '金山屯区', '230700'),
(725, '230710', '五营区', '230700'),
(726, '230711', '乌马河区', '230700'),
(727, '230712', '汤旺河区', '230700'),
(728, '230713', '带岭区', '230700'),
(729, '230714', '乌伊岭区', '230700'),
(730, '230715', '红星区', '230700'),
(731, '230716', '上甘岭区', '230700'),
(732, '230722', '嘉荫县', '230700'),
(733, '230781', '铁力市', '230700'),
(734, '230801', '市辖区', '230800'),
(735, '230802', '永红区', '230800'),
(736, '230803', '向阳区', '230800'),
(737, '230804', '前进区', '230800'),
(738, '230805', '东风区', '230800'),
(739, '230811', '郊　区', '230800'),
(740, '230822', '桦南县', '230800'),
(741, '230826', '桦川县', '230800'),
(742, '230828', '汤原县', '230800'),
(743, '230833', '抚远县', '230800'),
(744, '230881', '同江市', '230800'),
(745, '230882', '富锦市', '230800'),
(746, '230901', '市辖区', '230900'),
(747, '230902', '新兴区', '230900'),
(748, '230903', '桃山区', '230900'),
(749, '230904', '茄子河区', '230900'),
(750, '230921', '勃利县', '230900'),
(751, '231001', '市辖区', '231000'),
(752, '231002', '东安区', '231000'),
(753, '231003', '阳明区', '231000'),
(754, '231004', '爱民区', '231000'),
(755, '231005', '西安区', '231000'),
(756, '231024', '东宁县', '231000'),
(757, '231025', '林口县', '231000'),
(758, '231081', '绥芬河市', '231000'),
(759, '231083', '海林市', '231000'),
(760, '231084', '宁安市', '231000'),
(761, '231085', '穆棱市', '231000'),
(762, '231101', '市辖区', '231100'),
(763, '231102', '爱辉区', '231100'),
(764, '231121', '嫩江县', '231100'),
(765, '231123', '逊克县', '231100'),
(766, '231124', '孙吴县', '231100'),
(767, '231181', '北安市', '231100'),
(768, '231182', '五大连池市', '231100'),
(769, '231201', '市辖区', '231200'),
(770, '231202', '北林区', '231200'),
(771, '231221', '望奎县', '231200'),
(772, '231222', '兰西县', '231200'),
(773, '231223', '青冈县', '231200'),
(774, '231224', '庆安县', '231200'),
(775, '231225', '明水县', '231200'),
(776, '231226', '绥棱县', '231200'),
(777, '231281', '安达市', '231200'),
(778, '231282', '肇东市', '231200'),
(779, '231283', '海伦市', '231200'),
(780, '232721', '呼玛县', '232700'),
(781, '232722', '塔河县', '232700'),
(782, '232723', '漠河县', '232700'),
(783, '310101', '黄浦区', '310100'),
(784, '310103', '卢湾区', '310100'),
(785, '310104', '徐汇区', '310100'),
(786, '310105', '长宁区', '310100'),
(787, '310106', '静安区', '310100'),
(788, '310107', '普陀区', '310100'),
(789, '310108', '闸北区', '310100'),
(790, '310109', '虹口区', '310100'),
(791, '310110', '杨浦区', '310100'),
(792, '310112', '闵行区', '310100'),
(793, '310113', '宝山区', '310100'),
(794, '310114', '嘉定区', '310100'),
(795, '310115', '浦东新区', '310100'),
(796, '310116', '金山区', '310100'),
(797, '310117', '松江区', '310100'),
(798, '310118', '青浦区', '310100'),
(799, '310119', '南汇区', '310100'),
(800, '310120', '奉贤区', '310100'),
(801, '310230', '崇明县', '310200'),
(802, '320101', '市辖区', '320100'),
(803, '320102', '玄武区', '320100'),
(804, '320103', '白下区', '320100'),
(805, '320104', '秦淮区', '320100'),
(806, '320105', '建邺区', '320100'),
(807, '320106', '鼓楼区', '320100'),
(808, '320107', '下关区', '320100'),
(809, '320111', '浦口区', '320100'),
(810, '320113', '栖霞区', '320100'),
(811, '320114', '雨花台区', '320100'),
(812, '320115', '江宁区', '320100'),
(813, '320116', '六合区', '320100'),
(814, '320124', '溧水县', '320100'),
(815, '320125', '高淳县', '320100'),
(816, '320201', '市辖区', '320200'),
(817, '320202', '崇安区', '320200'),
(818, '320203', '南长区', '320200'),
(819, '320204', '北塘区', '320200'),
(820, '320205', '锡山区', '320200'),
(821, '320206', '惠山区', '320200'),
(822, '320211', '滨湖区', '320200'),
(823, '320281', '江阴市', '320200'),
(824, '320282', '宜兴市', '320200'),
(825, '320301', '市辖区', '320300'),
(826, '320302', '鼓楼区', '320300'),
(827, '320303', '云龙区', '320300'),
(828, '320304', '九里区', '320300'),
(829, '320305', '贾汪区', '320300'),
(830, '320311', '泉山区', '320300'),
(831, '320321', '丰　县', '320300'),
(832, '320322', '沛　县', '320300'),
(833, '320323', '铜山县', '320300'),
(834, '320324', '睢宁县', '320300'),
(835, '320381', '新沂市', '320300'),
(836, '320382', '邳州市', '320300'),
(837, '320401', '市辖区', '320400'),
(838, '320402', '天宁区', '320400'),
(839, '320404', '钟楼区', '320400'),
(840, '320405', '戚墅堰区', '320400'),
(841, '320411', '新北区', '320400'),
(842, '320412', '武进区', '320400'),
(843, '320481', '溧阳市', '320400'),
(844, '320482', '金坛市', '320400'),
(845, '320501', '市辖区', '320500'),
(846, '320502', '沧浪区', '320500'),
(847, '320503', '平江区', '320500'),
(848, '320504', '金阊区', '320500'),
(849, '320505', '虎丘区', '320500'),
(850, '320506', '吴中区', '320500'),
(851, '320507', '相城区', '320500'),
(852, '320581', '常熟市', '320500'),
(853, '320582', '张家港市', '320500'),
(854, '320583', '昆山市', '320500'),
(855, '320584', '吴江市', '320500'),
(856, '320585', '太仓市', '320500'),
(857, '320601', '市辖区', '320600'),
(858, '320602', '崇川区', '320600'),
(859, '320611', '港闸区', '320600'),
(860, '320621', '海安县', '320600'),
(861, '320623', '如东县', '320600'),
(862, '320681', '启东市', '320600'),
(863, '320682', '如皋市', '320600'),
(864, '320683', '通州市', '320600'),
(865, '320684', '海门市', '320600'),
(866, '320701', '市辖区', '320700'),
(867, '320703', '连云区', '320700'),
(868, '320705', '新浦区', '320700'),
(869, '320706', '海州区', '320700'),
(870, '320721', '赣榆县', '320700'),
(871, '320722', '东海县', '320700'),
(872, '320723', '灌云县', '320700'),
(873, '320724', '灌南县', '320700'),
(874, '320801', '市辖区', '320800'),
(875, '320802', '清河区', '320800'),
(876, '320803', '楚州区', '320800'),
(877, '320804', '淮阴区', '320800'),
(878, '320811', '清浦区', '320800'),
(879, '320826', '涟水县', '320800'),
(880, '320829', '洪泽县', '320800'),
(881, '320830', '盱眙县', '320800'),
(882, '320831', '金湖县', '320800'),
(883, '320901', '市辖区', '320900'),
(884, '320902', '亭湖区', '320900'),
(885, '320903', '盐都区', '320900'),
(886, '320921', '响水县', '320900'),
(887, '320922', '滨海县', '320900'),
(888, '320923', '阜宁县', '320900'),
(889, '320924', '射阳县', '320900'),
(890, '320925', '建湖县', '320900'),
(891, '320981', '东台市', '320900'),
(892, '320982', '大丰市', '320900'),
(893, '321001', '市辖区', '321000'),
(894, '321002', '广陵区', '321000'),
(895, '321003', '邗江区', '321000'),
(896, '321011', '郊　区', '321000'),
(897, '321023', '宝应县', '321000'),
(898, '321081', '仪征市', '321000'),
(899, '321084', '高邮市', '321000'),
(900, '321088', '江都市', '321000'),
(901, '321101', '市辖区', '321100'),
(902, '321102', '京口区', '321100'),
(903, '321111', '润州区', '321100'),
(904, '321112', '丹徒区', '321100'),
(905, '321181', '丹阳市', '321100'),
(906, '321182', '扬中市', '321100'),
(907, '321183', '句容市', '321100'),
(908, '321201', '市辖区', '321200'),
(909, '321202', '海陵区', '321200'),
(910, '321203', '高港区', '321200'),
(911, '321281', '兴化市', '321200'),
(912, '321282', '靖江市', '321200'),
(913, '321283', '泰兴市', '321200'),
(914, '321284', '姜堰市', '321200'),
(915, '321301', '市辖区', '321300'),
(916, '321302', '宿城区', '321300'),
(917, '321311', '宿豫区', '321300'),
(918, '321322', '沭阳县', '321300'),
(919, '321323', '泗阳县', '321300'),
(920, '321324', '泗洪县', '321300'),
(921, '330101', '市辖区', '330100'),
(922, '330102', '上城区', '330100'),
(923, '330103', '下城区', '330100'),
(924, '330104', '江干区', '330100'),
(925, '330105', '拱墅区', '330100'),
(926, '330106', '西湖区', '330100'),
(927, '330108', '滨江区', '330100'),
(928, '330109', '萧山区', '330100'),
(929, '330110', '余杭区', '330100'),
(930, '330122', '桐庐县', '330100'),
(931, '330127', '淳安县', '330100'),
(932, '330182', '建德市', '330100'),
(933, '330183', '富阳市', '330100'),
(934, '330185', '临安市', '330100'),
(935, '330201', '市辖区', '330200'),
(936, '330203', '海曙区', '330200'),
(937, '330204', '江东区', '330200'),
(938, '330205', '江北区', '330200'),
(939, '330206', '北仑区', '330200'),
(940, '330211', '镇海区', '330200'),
(941, '330212', '鄞州区', '330200'),
(942, '330225', '象山县', '330200'),
(943, '330226', '宁海县', '330200'),
(944, '330281', '余姚市', '330200'),
(945, '330282', '慈溪市', '330200'),
(946, '330283', '奉化市', '330200'),
(947, '330301', '市辖区', '330300'),
(948, '330302', '鹿城区', '330300'),
(949, '330303', '龙湾区', '330300'),
(950, '330304', '瓯海区', '330300'),
(951, '330322', '洞头县', '330300'),
(952, '330324', '永嘉县', '330300'),
(953, '330326', '平阳县', '330300'),
(954, '330327', '苍南县', '330300'),
(955, '330328', '文成县', '330300'),
(956, '330329', '泰顺县', '330300'),
(957, '330381', '瑞安市', '330300'),
(958, '330382', '乐清市', '330300'),
(959, '330401', '市辖区', '330400'),
(960, '330402', '秀城区', '330400'),
(961, '330411', '秀洲区', '330400'),
(962, '330421', '嘉善县', '330400'),
(963, '330424', '海盐县', '330400'),
(964, '330481', '海宁市', '330400'),
(965, '330482', '平湖市', '330400'),
(966, '330483', '桐乡市', '330400'),
(967, '330501', '市辖区', '330500'),
(968, '330502', '吴兴区', '330500'),
(969, '330503', '南浔区', '330500'),
(970, '330521', '德清县', '330500'),
(971, '330522', '长兴县', '330500'),
(972, '330523', '安吉县', '330500'),
(973, '330601', '市辖区', '330600'),
(974, '330602', '越城区', '330600'),
(975, '330621', '绍兴县', '330600'),
(976, '330624', '新昌县', '330600'),
(977, '330681', '诸暨市', '330600'),
(978, '330682', '上虞市', '330600'),
(979, '330683', '嵊州市', '330600'),
(980, '330701', '市辖区', '330700'),
(981, '330702', '婺城区', '330700'),
(982, '330703', '金东区', '330700'),
(983, '330723', '武义县', '330700'),
(984, '330726', '浦江县', '330700'),
(985, '330727', '磐安县', '330700'),
(986, '330781', '兰溪市', '330700'),
(987, '330782', '义乌市', '330700'),
(988, '330783', '东阳市', '330700'),
(989, '330784', '永康市', '330700'),
(990, '330801', '市辖区', '330800'),
(991, '330802', '柯城区', '330800'),
(992, '330803', '衢江区', '330800'),
(993, '330822', '常山县', '330800'),
(994, '330824', '开化县', '330800'),
(995, '330825', '龙游县', '330800'),
(996, '330881', '江山市', '330800'),
(997, '330901', '市辖区', '330900'),
(998, '330902', '定海区', '330900'),
(999, '330903', '普陀区', '330900'),
(1000, '330921', '岱山县', '330900'),
(1001, '330922', '嵊泗县', '330900'),
(1002, '331001', '市辖区', '331000'),
(1003, '331002', '椒江区', '331000'),
(1004, '331003', '黄岩区', '331000'),
(1005, '331004', '路桥区', '331000'),
(1006, '331021', '玉环县', '331000'),
(1007, '331022', '三门县', '331000'),
(1008, '331023', '天台县', '331000'),
(1009, '331024', '仙居县', '331000'),
(1010, '331081', '温岭市', '331000'),
(1011, '331082', '临海市', '331000'),
(1012, '331101', '市辖区', '331100'),
(1013, '331102', '莲都区', '331100'),
(1014, '331121', '青田县', '331100'),
(1015, '331122', '缙云县', '331100'),
(1016, '331123', '遂昌县', '331100'),
(1017, '331124', '松阳县', '331100'),
(1018, '331125', '云和县', '331100'),
(1019, '331126', '庆元县', '331100'),
(1020, '331127', '景宁畲族自治县', '331100'),
(1021, '331181', '龙泉市', '331100'),
(1022, '340101', '市辖区', '340100'),
(1023, '340102', '瑶海区', '340100'),
(1024, '340103', '庐阳区', '340100'),
(1025, '340104', '蜀山区', '340100'),
(1026, '340111', '包河区', '340100'),
(1027, '340121', '长丰县', '340100'),
(1028, '340122', '肥东县', '340100'),
(1029, '340123', '肥西县', '340100'),
(1030, '340201', '市辖区', '340200'),
(1031, '340202', '镜湖区', '340200'),
(1032, '340203', '马塘区', '340200'),
(1033, '340204', '新芜区', '340200'),
(1034, '340207', '鸠江区', '340200'),
(1035, '340221', '芜湖县', '340200'),
(1036, '340222', '繁昌县', '340200'),
(1037, '340223', '南陵县', '340200'),
(1038, '340301', '市辖区', '340300'),
(1039, '340302', '龙子湖区', '340300'),
(1040, '340303', '蚌山区', '340300'),
(1041, '340304', '禹会区', '340300'),
(1042, '340311', '淮上区', '340300'),
(1043, '340321', '怀远县', '340300'),
(1044, '340322', '五河县', '340300'),
(1045, '340323', '固镇县', '340300'),
(1046, '340401', '市辖区', '340400'),
(1047, '340402', '大通区', '340400'),
(1048, '340403', '田家庵区', '340400'),
(1049, '340404', '谢家集区', '340400'),
(1050, '340405', '八公山区', '340400'),
(1051, '340406', '潘集区', '340400'),
(1052, '340421', '凤台县', '340400'),
(1053, '340501', '市辖区', '340500'),
(1054, '340502', '金家庄区', '340500'),
(1055, '340503', '花山区', '340500'),
(1056, '340504', '雨山区', '340500'),
(1057, '340521', '当涂县', '340500'),
(1058, '340601', '市辖区', '340600'),
(1059, '340602', '杜集区', '340600'),
(1060, '340603', '相山区', '340600'),
(1061, '340604', '烈山区', '340600'),
(1062, '340621', '濉溪县', '340600'),
(1063, '340701', '市辖区', '340700'),
(1064, '340702', '铜官山区', '340700'),
(1065, '340703', '狮子山区', '340700'),
(1066, '340711', '郊　区', '340700'),
(1067, '340721', '铜陵县', '340700'),
(1068, '340801', '市辖区', '340800'),
(1069, '340802', '迎江区', '340800'),
(1070, '340803', '大观区', '340800'),
(1071, '340811', '郊　区', '340800'),
(1072, '340822', '怀宁县', '340800'),
(1073, '340823', '枞阳县', '340800'),
(1074, '340824', '潜山县', '340800'),
(1075, '340825', '太湖县', '340800'),
(1076, '340826', '宿松县', '340800'),
(1077, '340827', '望江县', '340800'),
(1078, '340828', '岳西县', '340800'),
(1079, '340881', '桐城市', '340800'),
(1080, '341001', '市辖区', '341000'),
(1081, '341002', '屯溪区', '341000'),
(1082, '341003', '黄山区', '341000'),
(1083, '341004', '徽州区', '341000'),
(1084, '341021', '歙　县', '341000'),
(1085, '341022', '休宁县', '341000'),
(1086, '341023', '黟　县', '341000'),
(1087, '341024', '祁门县', '341000'),
(1088, '341101', '市辖区', '341100'),
(1089, '341102', '琅琊区', '341100'),
(1090, '341103', '南谯区', '341100'),
(1091, '341122', '来安县', '341100'),
(1092, '341124', '全椒县', '341100'),
(1093, '341125', '定远县', '341100'),
(1094, '341126', '凤阳县', '341100'),
(1095, '341181', '天长市', '341100'),
(1096, '341182', '明光市', '341100'),
(1097, '341201', '市辖区', '341200'),
(1098, '341202', '颍州区', '341200'),
(1099, '341203', '颍东区', '341200'),
(1100, '341204', '颍泉区', '341200'),
(1101, '341221', '临泉县', '341200'),
(1102, '341222', '太和县', '341200'),
(1103, '341225', '阜南县', '341200'),
(1104, '341226', '颍上县', '341200'),
(1105, '341282', '界首市', '341200'),
(1106, '341301', '市辖区', '341300'),
(1107, '341302', '墉桥区', '341300'),
(1108, '341321', '砀山县', '341300'),
(1109, '341322', '萧　县', '341300'),
(1110, '341323', '灵璧县', '341300'),
(1111, '341324', '泗　县', '341300'),
(1112, '341401', '市辖区', '341400'),
(1113, '341402', '居巢区', '341400'),
(1114, '341421', '庐江县', '341400'),
(1115, '341422', '无为县', '341400'),
(1116, '341423', '含山县', '341400'),
(1117, '341424', '和　县', '341400'),
(1118, '341501', '市辖区', '341500'),
(1119, '341502', '金安区', '341500'),
(1120, '341503', '裕安区', '341500'),
(1121, '341521', '寿　县', '341500'),
(1122, '341522', '霍邱县', '341500'),
(1123, '341523', '舒城县', '341500'),
(1124, '341524', '金寨县', '341500'),
(1125, '341525', '霍山县', '341500'),
(1126, '341601', '市辖区', '341600'),
(1127, '341602', '谯城区', '341600'),
(1128, '341621', '涡阳县', '341600'),
(1129, '341622', '蒙城县', '341600'),
(1130, '341623', '利辛县', '341600'),
(1131, '341701', '市辖区', '341700'),
(1132, '341702', '贵池区', '341700'),
(1133, '341721', '东至县', '341700'),
(1134, '341722', '石台县', '341700'),
(1135, '341723', '青阳县', '341700'),
(1136, '341801', '市辖区', '341800'),
(1137, '341802', '宣州区', '341800'),
(1138, '341821', '郎溪县', '341800'),
(1139, '341822', '广德县', '341800'),
(1140, '341823', '泾　县', '341800'),
(1141, '341824', '绩溪县', '341800'),
(1142, '341825', '旌德县', '341800'),
(1143, '341881', '宁国市', '341800'),
(1144, '350101', '市辖区', '350100'),
(1145, '350102', '鼓楼区', '350100'),
(1146, '350103', '台江区', '350100'),
(1147, '350104', '仓山区', '350100'),
(1148, '350105', '马尾区', '350100'),
(1149, '350111', '晋安区', '350100'),
(1150, '350121', '闽侯县', '350100'),
(1151, '350122', '连江县', '350100'),
(1152, '350123', '罗源县', '350100'),
(1153, '350124', '闽清县', '350100'),
(1154, '350125', '永泰县', '350100'),
(1155, '350128', '平潭县', '350100'),
(1156, '350181', '福清市', '350100'),
(1157, '350182', '长乐市', '350100'),
(1158, '350201', '市辖区', '350200'),
(1159, '350203', '思明区', '350200'),
(1160, '350205', '海沧区', '350200'),
(1161, '350206', '湖里区', '350200'),
(1162, '350211', '集美区', '350200'),
(1163, '350212', '同安区', '350200'),
(1164, '350213', '翔安区', '350200'),
(1165, '350301', '市辖区', '350300'),
(1166, '350302', '城厢区', '350300'),
(1167, '350303', '涵江区', '350300'),
(1168, '350304', '荔城区', '350300'),
(1169, '350305', '秀屿区', '350300'),
(1170, '350322', '仙游县', '350300'),
(1171, '350401', '市辖区', '350400'),
(1172, '350402', '梅列区', '350400'),
(1173, '350403', '三元区', '350400'),
(1174, '350421', '明溪县', '350400'),
(1175, '350423', '清流县', '350400'),
(1176, '350424', '宁化县', '350400'),
(1177, '350425', '大田县', '350400'),
(1178, '350426', '尤溪县', '350400'),
(1179, '350427', '沙　县', '350400'),
(1180, '350428', '将乐县', '350400'),
(1181, '350429', '泰宁县', '350400'),
(1182, '350430', '建宁县', '350400'),
(1183, '350481', '永安市', '350400'),
(1184, '350501', '市辖区', '350500'),
(1185, '350502', '鲤城区', '350500'),
(1186, '350503', '丰泽区', '350500'),
(1187, '350504', '洛江区', '350500'),
(1188, '350505', '泉港区', '350500'),
(1189, '350521', '惠安县', '350500'),
(1190, '350524', '安溪县', '350500'),
(1191, '350525', '永春县', '350500'),
(1192, '350526', '德化县', '350500'),
(1193, '350527', '金门县', '350500'),
(1194, '350581', '石狮市', '350500'),
(1195, '350582', '晋江市', '350500'),
(1196, '350583', '南安市', '350500'),
(1197, '350601', '市辖区', '350600'),
(1198, '350602', '芗城区', '350600'),
(1199, '350603', '龙文区', '350600'),
(1200, '350622', '云霄县', '350600'),
(1201, '350623', '漳浦县', '350600'),
(1202, '350624', '诏安县', '350600'),
(1203, '350625', '长泰县', '350600'),
(1204, '350626', '东山县', '350600'),
(1205, '350627', '南靖县', '350600'),
(1206, '350628', '平和县', '350600'),
(1207, '350629', '华安县', '350600'),
(1208, '350681', '龙海市', '350600'),
(1209, '350701', '市辖区', '350700'),
(1210, '350702', '延平区', '350700'),
(1211, '350721', '顺昌县', '350700'),
(1212, '350722', '浦城县', '350700'),
(1213, '350723', '光泽县', '350700'),
(1214, '350724', '松溪县', '350700'),
(1215, '350725', '政和县', '350700'),
(1216, '350781', '邵武市', '350700'),
(1217, '350782', '武夷山市', '350700'),
(1218, '350783', '建瓯市', '350700'),
(1219, '350784', '建阳市', '350700'),
(1220, '350801', '市辖区', '350800'),
(1221, '350802', '新罗区', '350800'),
(1222, '350821', '长汀县', '350800'),
(1223, '350822', '永定县', '350800'),
(1224, '350823', '上杭县', '350800'),
(1225, '350824', '武平县', '350800'),
(1226, '350825', '连城县', '350800'),
(1227, '350881', '漳平市', '350800'),
(1228, '350901', '市辖区', '350900'),
(1229, '350902', '蕉城区', '350900'),
(1230, '350921', '霞浦县', '350900'),
(1231, '350922', '古田县', '350900'),
(1232, '350923', '屏南县', '350900'),
(1233, '350924', '寿宁县', '350900'),
(1234, '350925', '周宁县', '350900'),
(1235, '350926', '柘荣县', '350900'),
(1236, '350981', '福安市', '350900'),
(1237, '350982', '福鼎市', '350900'),
(1238, '360101', '市辖区', '360100'),
(1239, '360102', '东湖区', '360100'),
(1240, '360103', '西湖区', '360100'),
(1241, '360104', '青云谱区', '360100'),
(1242, '360105', '湾里区', '360100'),
(1243, '360111', '青山湖区', '360100'),
(1244, '360121', '南昌县', '360100'),
(1245, '360122', '新建县', '360100'),
(1246, '360123', '安义县', '360100'),
(1247, '360124', '进贤县', '360100'),
(1248, '360201', '市辖区', '360200'),
(1249, '360202', '昌江区', '360200'),
(1250, '360203', '珠山区', '360200'),
(1251, '360222', '浮梁县', '360200'),
(1252, '360281', '乐平市', '360200'),
(1253, '360301', '市辖区', '360300'),
(1254, '360302', '安源区', '360300'),
(1255, '360313', '湘东区', '360300'),
(1256, '360321', '莲花县', '360300'),
(1257, '360322', '上栗县', '360300'),
(1258, '360323', '芦溪县', '360300'),
(1259, '360401', '市辖区', '360400'),
(1260, '360402', '庐山区', '360400'),
(1261, '360403', '浔阳区', '360400'),
(1262, '360421', '九江县', '360400'),
(1263, '360423', '武宁县', '360400'),
(1264, '360424', '修水县', '360400'),
(1265, '360425', '永修县', '360400'),
(1266, '360426', '德安县', '360400'),
(1267, '360427', '星子县', '360400'),
(1268, '360428', '都昌县', '360400'),
(1269, '360429', '湖口县', '360400'),
(1270, '360430', '彭泽县', '360400'),
(1271, '360481', '瑞昌市', '360400'),
(1272, '360501', '市辖区', '360500'),
(1273, '360502', '渝水区', '360500'),
(1274, '360521', '分宜县', '360500'),
(1275, '360601', '市辖区', '360600'),
(1276, '360602', '月湖区', '360600'),
(1277, '360622', '余江县', '360600'),
(1278, '360681', '贵溪市', '360600'),
(1279, '360701', '市辖区', '360700'),
(1280, '360702', '章贡区', '360700'),
(1281, '360721', '赣　县', '360700'),
(1282, '360722', '信丰县', '360700'),
(1283, '360723', '大余县', '360700'),
(1284, '360724', '上犹县', '360700'),
(1285, '360725', '崇义县', '360700'),
(1286, '360726', '安远县', '360700'),
(1287, '360727', '龙南县', '360700'),
(1288, '360728', '定南县', '360700'),
(1289, '360729', '全南县', '360700'),
(1290, '360730', '宁都县', '360700'),
(1291, '360731', '于都县', '360700'),
(1292, '360732', '兴国县', '360700'),
(1293, '360733', '会昌县', '360700'),
(1294, '360734', '寻乌县', '360700'),
(1295, '360735', '石城县', '360700'),
(1296, '360781', '瑞金市', '360700'),
(1297, '360782', '南康市', '360700'),
(1298, '360801', '市辖区', '360800'),
(1299, '360802', '吉州区', '360800'),
(1300, '360803', '青原区', '360800'),
(1301, '360821', '吉安县', '360800'),
(1302, '360822', '吉水县', '360800'),
(1303, '360823', '峡江县', '360800'),
(1304, '360824', '新干县', '360800'),
(1305, '360825', '永丰县', '360800'),
(1306, '360826', '泰和县', '360800'),
(1307, '360827', '遂川县', '360800'),
(1308, '360828', '万安县', '360800'),
(1309, '360829', '安福县', '360800'),
(1310, '360830', '永新县', '360800'),
(1311, '360881', '井冈山市', '360800'),
(1312, '360901', '市辖区', '360900'),
(1313, '360902', '袁州区', '360900'),
(1314, '360921', '奉新县', '360900'),
(1315, '360922', '万载县', '360900'),
(1316, '360923', '上高县', '360900'),
(1317, '360924', '宜丰县', '360900'),
(1318, '360925', '靖安县', '360900'),
(1319, '360926', '铜鼓县', '360900'),
(1320, '360981', '丰城市', '360900'),
(1321, '360982', '樟树市', '360900'),
(1322, '360983', '高安市', '360900'),
(1323, '361001', '市辖区', '361000'),
(1324, '361002', '临川区', '361000'),
(1325, '361021', '南城县', '361000'),
(1326, '361022', '黎川县', '361000'),
(1327, '361023', '南丰县', '361000'),
(1328, '361024', '崇仁县', '361000'),
(1329, '361025', '乐安县', '361000'),
(1330, '361026', '宜黄县', '361000'),
(1331, '361027', '金溪县', '361000'),
(1332, '361028', '资溪县', '361000'),
(1333, '361029', '东乡县', '361000'),
(1334, '361030', '广昌县', '361000'),
(1335, '361101', '市辖区', '361100'),
(1336, '361102', '信州区', '361100'),
(1337, '361121', '上饶县', '361100'),
(1338, '361122', '广丰县', '361100'),
(1339, '361123', '玉山县', '361100'),
(1340, '361124', '铅山县', '361100'),
(1341, '361125', '横峰县', '361100'),
(1342, '361126', '弋阳县', '361100'),
(1343, '361127', '余干县', '361100'),
(1344, '361128', '鄱阳县', '361100'),
(1345, '361129', '万年县', '361100'),
(1346, '361130', '婺源县', '361100'),
(1347, '361181', '德兴市', '361100'),
(1348, '370101', '市辖区', '370100'),
(1349, '370102', '历下区', '370100'),
(1350, '370103', '市中区', '370100'),
(1351, '370104', '槐荫区', '370100'),
(1352, '370105', '天桥区', '370100'),
(1353, '370112', '历城区', '370100'),
(1354, '370113', '长清区', '370100'),
(1355, '370124', '平阴县', '370100'),
(1356, '370125', '济阳县', '370100'),
(1357, '370126', '商河县', '370100'),
(1358, '370181', '章丘市', '370100'),
(1359, '370201', '市辖区', '370200'),
(1360, '370202', '市南区', '370200'),
(1361, '370203', '市北区', '370200'),
(1362, '370205', '四方区', '370200'),
(1363, '370211', '黄岛区', '370200'),
(1364, '370212', '崂山区', '370200'),
(1365, '370213', '李沧区', '370200'),
(1366, '370214', '城阳区', '370200'),
(1367, '370281', '胶州市', '370200'),
(1368, '370282', '即墨市', '370200'),
(1369, '370283', '平度市', '370200'),
(1370, '370284', '胶南市', '370200'),
(1371, '370285', '莱西市', '370200'),
(1372, '370301', '市辖区', '370300'),
(1373, '370302', '淄川区', '370300'),
(1374, '370303', '张店区', '370300'),
(1375, '370304', '博山区', '370300'),
(1376, '370305', '临淄区', '370300'),
(1377, '370306', '周村区', '370300'),
(1378, '370321', '桓台县', '370300'),
(1379, '370322', '高青县', '370300'),
(1380, '370323', '沂源县', '370300'),
(1381, '370401', '市辖区', '370400'),
(1382, '370402', '市中区', '370400'),
(1383, '370403', '薛城区', '370400'),
(1384, '370404', '峄城区', '370400'),
(1385, '370405', '台儿庄区', '370400'),
(1386, '370406', '山亭区', '370400'),
(1387, '370481', '滕州市', '370400'),
(1388, '370501', '市辖区', '370500'),
(1389, '370502', '东营区', '370500'),
(1390, '370503', '河口区', '370500'),
(1391, '370521', '垦利县', '370500'),
(1392, '370522', '利津县', '370500'),
(1393, '370523', '广饶县', '370500'),
(1394, '370601', '市辖区', '370600'),
(1395, '370602', '芝罘区', '370600'),
(1396, '370611', '福山区', '370600'),
(1397, '370612', '牟平区', '370600'),
(1398, '370613', '莱山区', '370600'),
(1399, '370634', '长岛县', '370600'),
(1400, '370681', '龙口市', '370600'),
(1401, '370682', '莱阳市', '370600'),
(1402, '370683', '莱州市', '370600'),
(1403, '370684', '蓬莱市', '370600'),
(1404, '370685', '招远市', '370600'),
(1405, '370686', '栖霞市', '370600'),
(1406, '370687', '海阳市', '370600'),
(1407, '370701', '市辖区', '370700'),
(1408, '370702', '潍城区', '370700'),
(1409, '370703', '寒亭区', '370700'),
(1410, '370704', '坊子区', '370700'),
(1411, '370705', '奎文区', '370700'),
(1412, '370724', '临朐县', '370700'),
(1413, '370725', '昌乐县', '370700'),
(1414, '370781', '青州市', '370700'),
(1415, '370782', '诸城市', '370700'),
(1416, '370783', '寿光市', '370700'),
(1417, '370784', '安丘市', '370700'),
(1418, '370785', '高密市', '370700'),
(1419, '370786', '昌邑市', '370700'),
(1420, '370801', '市辖区', '370800'),
(1421, '370802', '市中区', '370800'),
(1422, '370811', '任城区', '370800'),
(1423, '370826', '微山县', '370800'),
(1424, '370827', '鱼台县', '370800'),
(1425, '370828', '金乡县', '370800'),
(1426, '370829', '嘉祥县', '370800'),
(1427, '370830', '汶上县', '370800'),
(1428, '370831', '泗水县', '370800'),
(1429, '370832', '梁山县', '370800'),
(1430, '370881', '曲阜市', '370800'),
(1431, '370882', '兖州市', '370800'),
(1432, '370883', '邹城市', '370800'),
(1433, '370901', '市辖区', '370900'),
(1434, '370902', '泰山区', '370900'),
(1435, '370903', '岱岳区', '370900'),
(1436, '370921', '宁阳县', '370900'),
(1437, '370923', '东平县', '370900'),
(1438, '370982', '新泰市', '370900'),
(1439, '370983', '肥城市', '370900'),
(1440, '371001', '市辖区', '371000'),
(1441, '371002', '环翠区', '371000'),
(1442, '371081', '文登市', '371000'),
(1443, '371082', '荣成市', '371000'),
(1444, '371083', '乳山市', '371000'),
(1445, '371101', '市辖区', '371100'),
(1446, '371102', '东港区', '371100'),
(1447, '371103', '岚山区', '371100'),
(1448, '371121', '五莲县', '371100'),
(1449, '371122', '莒　县', '371100'),
(1450, '371201', '市辖区', '371200'),
(1451, '371202', '莱城区', '371200'),
(1452, '371203', '钢城区', '371200'),
(1453, '371301', '市辖区', '371300'),
(1454, '371302', '兰山区', '371300'),
(1455, '371311', '罗庄区', '371300'),
(1456, '371312', '河东区', '371300'),
(1457, '371321', '沂南县', '371300'),
(1458, '371322', '郯城县', '371300'),
(1459, '371323', '沂水县', '371300'),
(1460, '371324', '苍山县', '371300'),
(1461, '371325', '费　县', '371300'),
(1462, '371326', '平邑县', '371300'),
(1463, '371327', '莒南县', '371300'),
(1464, '371328', '蒙阴县', '371300'),
(1465, '371329', '临沭县', '371300'),
(1466, '371401', '市辖区', '371400'),
(1467, '371402', '德城区', '371400'),
(1468, '371421', '陵　县', '371400'),
(1469, '371422', '宁津县', '371400'),
(1470, '371423', '庆云县', '371400'),
(1471, '371424', '临邑县', '371400'),
(1472, '371425', '齐河县', '371400'),
(1473, '371426', '平原县', '371400'),
(1474, '371427', '夏津县', '371400'),
(1475, '371428', '武城县', '371400'),
(1476, '371481', '乐陵市', '371400'),
(1477, '371482', '禹城市', '371400'),
(1478, '371501', '市辖区', '371500'),
(1479, '371502', '东昌府区', '371500'),
(1480, '371521', '阳谷县', '371500'),
(1481, '371522', '莘　县', '371500'),
(1482, '371523', '茌平县', '371500'),
(1483, '371524', '东阿县', '371500'),
(1484, '371525', '冠　县', '371500'),
(1485, '371526', '高唐县', '371500'),
(1486, '371581', '临清市', '371500'),
(1487, '371601', '市辖区', '371600'),
(1488, '371602', '滨城区', '371600'),
(1489, '371621', '惠民县', '371600'),
(1490, '371622', '阳信县', '371600'),
(1491, '371623', '无棣县', '371600'),
(1492, '371624', '沾化县', '371600'),
(1493, '371625', '博兴县', '371600'),
(1494, '371626', '邹平县', '371600'),
(1495, '371701', '市辖区', '371700'),
(1496, '371702', '牡丹区', '371700'),
(1497, '371721', '曹　县', '371700'),
(1498, '371722', '单　县', '371700'),
(1499, '371723', '成武县', '371700'),
(1500, '371724', '巨野县', '371700'),
(1501, '371725', '郓城县', '371700'),
(1502, '371726', '鄄城县', '371700'),
(1503, '371727', '定陶县', '371700'),
(1504, '371728', '东明县', '371700'),
(1505, '410101', '市辖区', '410100'),
(1506, '410102', '中原区', '410100'),
(1507, '410103', '二七区', '410100'),
(1508, '410104', '管城回族区', '410100'),
(1509, '410105', '金水区', '410100'),
(1510, '410106', '上街区', '410100'),
(1511, '410108', '邙山区', '410100'),
(1512, '410122', '中牟县', '410100'),
(1513, '410181', '巩义市', '410100'),
(1514, '410182', '荥阳市', '410100'),
(1515, '410183', '新密市', '410100'),
(1516, '410184', '新郑市', '410100'),
(1517, '410185', '登封市', '410100'),
(1518, '410201', '市辖区', '410200'),
(1519, '410202', '龙亭区', '410200'),
(1520, '410203', '顺河回族区', '410200'),
(1521, '410204', '鼓楼区', '410200'),
(1522, '410205', '南关区', '410200'),
(1523, '410211', '郊　区', '410200'),
(1524, '410221', '杞　县', '410200'),
(1525, '410222', '通许县', '410200'),
(1526, '410223', '尉氏县', '410200'),
(1527, '410224', '开封县', '410200'),
(1528, '410225', '兰考县', '410200'),
(1529, '410301', '市辖区', '410300'),
(1530, '410302', '老城区', '410300'),
(1531, '410303', '西工区', '410300'),
(1532, '410304', '廛河回族区', '410300'),
(1533, '410305', '涧西区', '410300'),
(1534, '410306', '吉利区', '410300'),
(1535, '410307', '洛龙区', '410300'),
(1536, '410322', '孟津县', '410300'),
(1537, '410323', '新安县', '410300');
INSERT INTO `china_areas` (`id`, `areaid`, `area`, `cityid`) VALUES
(1538, '410324', '栾川县', '410300'),
(1539, '410325', '嵩　县', '410300'),
(1540, '410326', '汝阳县', '410300'),
(1541, '410327', '宜阳县', '410300'),
(1542, '410328', '洛宁县', '410300'),
(1543, '410329', '伊川县', '410300'),
(1544, '410381', '偃师市', '410300'),
(1545, '410401', '市辖区', '410400'),
(1546, '410402', '新华区', '410400'),
(1547, '410403', '卫东区', '410400'),
(1548, '410404', '石龙区', '410400'),
(1549, '410411', '湛河区', '410400'),
(1550, '410421', '宝丰县', '410400'),
(1551, '410422', '叶　县', '410400'),
(1552, '410423', '鲁山县', '410400'),
(1553, '410425', '郏　县', '410400'),
(1554, '410481', '舞钢市', '410400'),
(1555, '410482', '汝州市', '410400'),
(1556, '410501', '市辖区', '410500'),
(1557, '410502', '文峰区', '410500'),
(1558, '410503', '北关区', '410500'),
(1559, '410505', '殷都区', '410500'),
(1560, '410506', '龙安区', '410500'),
(1561, '410522', '安阳县', '410500'),
(1562, '410523', '汤阴县', '410500'),
(1563, '410526', '滑　县', '410500'),
(1564, '410527', '内黄县', '410500'),
(1565, '410581', '林州市', '410500'),
(1566, '410601', '市辖区', '410600'),
(1567, '410602', '鹤山区', '410600'),
(1568, '410603', '山城区', '410600'),
(1569, '410611', '淇滨区', '410600'),
(1570, '410621', '浚　县', '410600'),
(1571, '410622', '淇　县', '410600'),
(1572, '410701', '市辖区', '410700'),
(1573, '410702', '红旗区', '410700'),
(1574, '410703', '卫滨区', '410700'),
(1575, '410704', '凤泉区', '410700'),
(1576, '410711', '牧野区', '410700'),
(1577, '410721', '新乡县', '410700'),
(1578, '410724', '获嘉县', '410700'),
(1579, '410725', '原阳县', '410700'),
(1580, '410726', '延津县', '410700'),
(1581, '410727', '封丘县', '410700'),
(1582, '410728', '长垣县', '410700'),
(1583, '410781', '卫辉市', '410700'),
(1584, '410782', '辉县市', '410700'),
(1585, '410801', '市辖区', '410800'),
(1586, '410802', '解放区', '410800'),
(1587, '410803', '中站区', '410800'),
(1588, '410804', '马村区', '410800'),
(1589, '410811', '山阳区', '410800'),
(1590, '410821', '修武县', '410800'),
(1591, '410822', '博爱县', '410800'),
(1592, '410823', '武陟县', '410800'),
(1593, '410825', '温　县', '410800'),
(1594, '410881', '济源市', '410800'),
(1595, '410882', '沁阳市', '410800'),
(1596, '410883', '孟州市', '410800'),
(1597, '410901', '市辖区', '410900'),
(1598, '410902', '华龙区', '410900'),
(1599, '410922', '清丰县', '410900'),
(1600, '410923', '南乐县', '410900'),
(1601, '410926', '范　县', '410900'),
(1602, '410927', '台前县', '410900'),
(1603, '410928', '濮阳县', '410900'),
(1604, '411001', '市辖区', '411000'),
(1605, '411002', '魏都区', '411000'),
(1606, '411023', '许昌县', '411000'),
(1607, '411024', '鄢陵县', '411000'),
(1608, '411025', '襄城县', '411000'),
(1609, '411081', '禹州市', '411000'),
(1610, '411082', '长葛市', '411000'),
(1611, '411101', '市辖区', '411100'),
(1612, '411102', '源汇区', '411100'),
(1613, '411103', '郾城区', '411100'),
(1614, '411104', '召陵区', '411100'),
(1615, '411121', '舞阳县', '411100'),
(1616, '411122', '临颍县', '411100'),
(1617, '411201', '市辖区', '411200'),
(1618, '411202', '湖滨区', '411200'),
(1619, '411221', '渑池县', '411200'),
(1620, '411222', '陕　县', '411200'),
(1621, '411224', '卢氏县', '411200'),
(1622, '411281', '义马市', '411200'),
(1623, '411282', '灵宝市', '411200'),
(1624, '411301', '市辖区', '411300'),
(1625, '411302', '宛城区', '411300'),
(1626, '411303', '卧龙区', '411300'),
(1627, '411321', '南召县', '411300'),
(1628, '411322', '方城县', '411300'),
(1629, '411323', '西峡县', '411300'),
(1630, '411324', '镇平县', '411300'),
(1631, '411325', '内乡县', '411300'),
(1632, '411326', '淅川县', '411300'),
(1633, '411327', '社旗县', '411300'),
(1634, '411328', '唐河县', '411300'),
(1635, '411329', '新野县', '411300'),
(1636, '411330', '桐柏县', '411300'),
(1637, '411381', '邓州市', '411300'),
(1638, '411401', '市辖区', '411400'),
(1639, '411402', '梁园区', '411400'),
(1640, '411403', '睢阳区', '411400'),
(1641, '411421', '民权县', '411400'),
(1642, '411422', '睢　县', '411400'),
(1643, '411423', '宁陵县', '411400'),
(1644, '411424', '柘城县', '411400'),
(1645, '411425', '虞城县', '411400'),
(1646, '411426', '夏邑县', '411400'),
(1647, '411481', '永城市', '411400'),
(1648, '411501', '市辖区', '411500'),
(1649, '411502', '师河区', '411500'),
(1650, '411503', '平桥区', '411500'),
(1651, '411521', '罗山县', '411500'),
(1652, '411522', '光山县', '411500'),
(1653, '411523', '新　县', '411500'),
(1654, '411524', '商城县', '411500'),
(1655, '411525', '固始县', '411500'),
(1656, '411526', '潢川县', '411500'),
(1657, '411527', '淮滨县', '411500'),
(1658, '411528', '息　县', '411500'),
(1659, '411601', '市辖区', '411600'),
(1660, '411602', '川汇区', '411600'),
(1661, '411621', '扶沟县', '411600'),
(1662, '411622', '西华县', '411600'),
(1663, '411623', '商水县', '411600'),
(1664, '411624', '沈丘县', '411600'),
(1665, '411625', '郸城县', '411600'),
(1666, '411626', '淮阳县', '411600'),
(1667, '411627', '太康县', '411600'),
(1668, '411628', '鹿邑县', '411600'),
(1669, '411681', '项城市', '411600'),
(1670, '411701', '市辖区', '411700'),
(1671, '411702', '驿城区', '411700'),
(1672, '411721', '西平县', '411700'),
(1673, '411722', '上蔡县', '411700'),
(1674, '411723', '平舆县', '411700'),
(1675, '411724', '正阳县', '411700'),
(1676, '411725', '确山县', '411700'),
(1677, '411726', '泌阳县', '411700'),
(1678, '411727', '汝南县', '411700'),
(1679, '411728', '遂平县', '411700'),
(1680, '411729', '新蔡县', '411700'),
(1681, '420101', '市辖区', '420100'),
(1682, '420102', '江岸区', '420100'),
(1683, '420103', '江汉区', '420100'),
(1684, '420104', '乔口区', '420100'),
(1685, '420105', '汉阳区', '420100'),
(1686, '420106', '武昌区', '420100'),
(1687, '420107', '青山区', '420100'),
(1688, '420111', '洪山区', '420100'),
(1689, '420112', '东西湖区', '420100'),
(1690, '420113', '汉南区', '420100'),
(1691, '420114', '蔡甸区', '420100'),
(1692, '420115', '江夏区', '420100'),
(1693, '420116', '黄陂区', '420100'),
(1694, '420117', '新洲区', '420100'),
(1695, '420201', '市辖区', '420200'),
(1696, '420202', '黄石港区', '420200'),
(1697, '420203', '西塞山区', '420200'),
(1698, '420204', '下陆区', '420200'),
(1699, '420205', '铁山区', '420200'),
(1700, '420222', '阳新县', '420200'),
(1701, '420281', '大冶市', '420200'),
(1702, '420301', '市辖区', '420300'),
(1703, '420302', '茅箭区', '420300'),
(1704, '420303', '张湾区', '420300'),
(1705, '420321', '郧　县', '420300'),
(1706, '420322', '郧西县', '420300'),
(1707, '420323', '竹山县', '420300'),
(1708, '420324', '竹溪县', '420300'),
(1709, '420325', '房　县', '420300'),
(1710, '420381', '丹江口市', '420300'),
(1711, '420501', '市辖区', '420500'),
(1712, '420502', '西陵区', '420500'),
(1713, '420503', '伍家岗区', '420500'),
(1714, '420504', '点军区', '420500'),
(1715, '420505', '猇亭区', '420500'),
(1716, '420506', '夷陵区', '420500'),
(1717, '420525', '远安县', '420500'),
(1718, '420526', '兴山县', '420500'),
(1719, '420527', '秭归县', '420500'),
(1720, '420528', '长阳土家族自治县', '420500'),
(1721, '420529', '五峰土家族自治县', '420500'),
(1722, '420581', '宜都市', '420500'),
(1723, '420582', '当阳市', '420500'),
(1724, '420583', '枝江市', '420500'),
(1725, '420601', '市辖区', '420600'),
(1726, '420602', '襄城区', '420600'),
(1727, '420606', '樊城区', '420600'),
(1728, '420607', '襄阳区', '420600'),
(1729, '420624', '南漳县', '420600'),
(1730, '420625', '谷城县', '420600'),
(1731, '420626', '保康县', '420600'),
(1732, '420682', '老河口市', '420600'),
(1733, '420683', '枣阳市', '420600'),
(1734, '420684', '宜城市', '420600'),
(1735, '420701', '市辖区', '420700'),
(1736, '420702', '梁子湖区', '420700'),
(1737, '420703', '华容区', '420700'),
(1738, '420704', '鄂城区', '420700'),
(1739, '420801', '市辖区', '420800'),
(1740, '420802', '东宝区', '420800'),
(1741, '420804', '掇刀区', '420800'),
(1742, '420821', '京山县', '420800'),
(1743, '420822', '沙洋县', '420800'),
(1744, '420881', '钟祥市', '420800'),
(1745, '420901', '市辖区', '420900'),
(1746, '420902', '孝南区', '420900'),
(1747, '420921', '孝昌县', '420900'),
(1748, '420922', '大悟县', '420900'),
(1749, '420923', '云梦县', '420900'),
(1750, '420981', '应城市', '420900'),
(1751, '420982', '安陆市', '420900'),
(1752, '420984', '汉川市', '420900'),
(1753, '421001', '市辖区', '421000'),
(1754, '421002', '沙市区', '421000'),
(1755, '421003', '荆州区', '421000'),
(1756, '421022', '公安县', '421000'),
(1757, '421023', '监利县', '421000'),
(1758, '421024', '江陵县', '421000'),
(1759, '421081', '石首市', '421000'),
(1760, '421083', '洪湖市', '421000'),
(1761, '421087', '松滋市', '421000'),
(1762, '421101', '市辖区', '421100'),
(1763, '421102', '黄州区', '421100'),
(1764, '421121', '团风县', '421100'),
(1765, '421122', '红安县', '421100'),
(1766, '421123', '罗田县', '421100'),
(1767, '421124', '英山县', '421100'),
(1768, '421125', '浠水县', '421100'),
(1769, '421126', '蕲春县', '421100'),
(1770, '421127', '黄梅县', '421100'),
(1771, '421181', '麻城市', '421100'),
(1772, '421182', '武穴市', '421100'),
(1773, '421201', '市辖区', '421200'),
(1774, '421202', '咸安区', '421200'),
(1775, '421221', '嘉鱼县', '421200'),
(1776, '421222', '通城县', '421200'),
(1777, '421223', '崇阳县', '421200'),
(1778, '421224', '通山县', '421200'),
(1779, '421281', '赤壁市', '421200'),
(1780, '421301', '市辖区', '421300'),
(1781, '421302', '曾都区', '421300'),
(1782, '421381', '广水市', '421300'),
(1783, '422801', '恩施市', '422800'),
(1784, '422802', '利川市', '422800'),
(1785, '422822', '建始县', '422800'),
(1786, '422823', '巴东县', '422800'),
(1787, '422825', '宣恩县', '422800'),
(1788, '422826', '咸丰县', '422800'),
(1789, '422827', '来凤县', '422800'),
(1790, '422828', '鹤峰县', '422800'),
(1791, '429004', '仙桃市', '429000'),
(1792, '429005', '潜江市', '429000'),
(1793, '429006', '天门市', '429000'),
(1794, '429021', '神农架林区', '429000'),
(1795, '430101', '市辖区', '430100'),
(1796, '430102', '芙蓉区', '430100'),
(1797, '430103', '天心区', '430100'),
(1798, '430104', '岳麓区', '430100'),
(1799, '430105', '开福区', '430100'),
(1800, '430111', '雨花区', '430100'),
(1801, '430121', '长沙县', '430100'),
(1802, '430122', '望城县', '430100'),
(1803, '430124', '宁乡县', '430100'),
(1804, '430181', '浏阳市', '430100'),
(1805, '430201', '市辖区', '430200'),
(1806, '430202', '荷塘区', '430200'),
(1807, '430203', '芦淞区', '430200'),
(1808, '430204', '石峰区', '430200'),
(1809, '430211', '天元区', '430200'),
(1810, '430221', '株洲县', '430200'),
(1811, '430223', '攸　县', '430200'),
(1812, '430224', '茶陵县', '430200'),
(1813, '430225', '炎陵县', '430200'),
(1814, '430281', '醴陵市', '430200'),
(1815, '430301', '市辖区', '430300'),
(1816, '430302', '雨湖区', '430300'),
(1817, '430304', '岳塘区', '430300'),
(1818, '430321', '湘潭县', '430300'),
(1819, '430381', '湘乡市', '430300'),
(1820, '430382', '韶山市', '430300'),
(1821, '430401', '市辖区', '430400'),
(1822, '430405', '珠晖区', '430400'),
(1823, '430406', '雁峰区', '430400'),
(1824, '430407', '石鼓区', '430400'),
(1825, '430408', '蒸湘区', '430400'),
(1826, '430412', '南岳区', '430400'),
(1827, '430421', '衡阳县', '430400'),
(1828, '430422', '衡南县', '430400'),
(1829, '430423', '衡山县', '430400'),
(1830, '430424', '衡东县', '430400'),
(1831, '430426', '祁东县', '430400'),
(1832, '430481', '耒阳市', '430400'),
(1833, '430482', '常宁市', '430400'),
(1834, '430501', '市辖区', '430500'),
(1835, '430502', '双清区', '430500'),
(1836, '430503', '大祥区', '430500'),
(1837, '430511', '北塔区', '430500'),
(1838, '430521', '邵东县', '430500'),
(1839, '430522', '新邵县', '430500'),
(1840, '430523', '邵阳县', '430500'),
(1841, '430524', '隆回县', '430500'),
(1842, '430525', '洞口县', '430500'),
(1843, '430527', '绥宁县', '430500'),
(1844, '430528', '新宁县', '430500'),
(1845, '430529', '城步苗族自治县', '430500'),
(1846, '430581', '武冈市', '430500'),
(1847, '430601', '市辖区', '430600'),
(1848, '430602', '岳阳楼区', '430600'),
(1849, '430603', '云溪区', '430600'),
(1850, '430611', '君山区', '430600'),
(1851, '430621', '岳阳县', '430600'),
(1852, '430623', '华容县', '430600'),
(1853, '430624', '湘阴县', '430600'),
(1854, '430626', '平江县', '430600'),
(1855, '430681', '汨罗市', '430600'),
(1856, '430682', '临湘市', '430600'),
(1857, '430701', '市辖区', '430700'),
(1858, '430702', '武陵区', '430700'),
(1859, '430703', '鼎城区', '430700'),
(1860, '430721', '安乡县', '430700'),
(1861, '430722', '汉寿县', '430700'),
(1862, '430723', '澧　县', '430700'),
(1863, '430724', '临澧县', '430700'),
(1864, '430725', '桃源县', '430700'),
(1865, '430726', '石门县', '430700'),
(1866, '430781', '津市市', '430700'),
(1867, '430801', '市辖区', '430800'),
(1868, '430802', '永定区', '430800'),
(1869, '430811', '武陵源区', '430800'),
(1870, '430821', '慈利县', '430800'),
(1871, '430822', '桑植县', '430800'),
(1872, '430901', '市辖区', '430900'),
(1873, '430902', '资阳区', '430900'),
(1874, '430903', '赫山区', '430900'),
(1875, '430921', '南　县', '430900'),
(1876, '430922', '桃江县', '430900'),
(1877, '430923', '安化县', '430900'),
(1878, '430981', '沅江市', '430900'),
(1879, '431001', '市辖区', '431000'),
(1880, '431002', '北湖区', '431000'),
(1881, '431003', '苏仙区', '431000'),
(1882, '431021', '桂阳县', '431000'),
(1883, '431022', '宜章县', '431000'),
(1884, '431023', '永兴县', '431000'),
(1885, '431024', '嘉禾县', '431000'),
(1886, '431025', '临武县', '431000'),
(1887, '431026', '汝城县', '431000'),
(1888, '431027', '桂东县', '431000'),
(1889, '431028', '安仁县', '431000'),
(1890, '431081', '资兴市', '431000'),
(1891, '431101', '市辖区', '431100'),
(1892, '431102', '芝山区', '431100'),
(1893, '431103', '冷水滩区', '431100'),
(1894, '431121', '祁阳县', '431100'),
(1895, '431122', '东安县', '431100'),
(1896, '431123', '双牌县', '431100'),
(1897, '431124', '道　县', '431100'),
(1898, '431125', '江永县', '431100'),
(1899, '431126', '宁远县', '431100'),
(1900, '431127', '蓝山县', '431100'),
(1901, '431128', '新田县', '431100'),
(1902, '431129', '江华瑶族自治县', '431100'),
(1903, '431201', '市辖区', '431200'),
(1904, '431202', '鹤城区', '431200'),
(1905, '431221', '中方县', '431200'),
(1906, '431222', '沅陵县', '431200'),
(1907, '431223', '辰溪县', '431200'),
(1908, '431224', '溆浦县', '431200'),
(1909, '431225', '会同县', '431200'),
(1910, '431226', '麻阳苗族自治县', '431200'),
(1911, '431227', '新晃侗族自治县', '431200'),
(1912, '431228', '芷江侗族自治县', '431200'),
(1913, '431229', '靖州苗族侗族自治县', '431200'),
(1914, '431230', '通道侗族自治县', '431200'),
(1915, '431281', '洪江市', '431200'),
(1916, '431301', '市辖区', '431300'),
(1917, '431302', '娄星区', '431300'),
(1918, '431321', '双峰县', '431300'),
(1919, '431322', '新化县', '431300'),
(1920, '431381', '冷水江市', '431300'),
(1921, '431382', '涟源市', '431300'),
(1922, '433101', '吉首市', '433100'),
(1923, '433122', '泸溪县', '433100'),
(1924, '433123', '凤凰县', '433100'),
(1925, '433124', '花垣县', '433100'),
(1926, '433125', '保靖县', '433100'),
(1927, '433126', '古丈县', '433100'),
(1928, '433127', '永顺县', '433100'),
(1929, '433130', '龙山县', '433100'),
(1930, '440101', '市辖区', '440100'),
(1931, '440102', '东山区', '440100'),
(1932, '440103', '荔湾区', '440100'),
(1933, '440104', '越秀区', '440100'),
(1934, '440105', '海珠区', '440100'),
(1935, '440106', '天河区', '440100'),
(1936, '440107', '芳村区', '440100'),
(1937, '440111', '白云区', '440100'),
(1938, '440112', '黄埔区', '440100'),
(1939, '440113', '番禺区', '440100'),
(1940, '440114', '花都区', '440100'),
(1941, '440183', '增城市', '440100'),
(1942, '440184', '从化市', '440100'),
(1943, '440201', '市辖区', '440200'),
(1944, '440203', '武江区', '440200'),
(1945, '440204', '浈江区', '440200'),
(1946, '440205', '曲江区', '440200'),
(1947, '440222', '始兴县', '440200'),
(1948, '440224', '仁化县', '440200'),
(1949, '440229', '翁源县', '440200'),
(1950, '440232', '乳源瑶族自治县', '440200'),
(1951, '440233', '新丰县', '440200'),
(1952, '440281', '乐昌市', '440200'),
(1953, '440282', '南雄市', '440200'),
(1954, '440301', '市辖区', '440300'),
(1955, '440303', '罗湖区', '440300'),
(1956, '440304', '福田区', '440300'),
(1957, '440305', '南山区', '440300'),
(1958, '440306', '宝安区', '440300'),
(1959, '440307', '龙岗区', '440300'),
(1960, '440308', '盐田区', '440300'),
(1961, '440401', '市辖区', '440400'),
(1962, '440402', '香洲区', '440400'),
(1963, '440403', '斗门区', '440400'),
(1964, '440404', '金湾区', '440400'),
(1965, '440501', '市辖区', '440500'),
(1966, '440507', '龙湖区', '440500'),
(1967, '440511', '金平区', '440500'),
(1968, '440512', '濠江区', '440500'),
(1969, '440513', '潮阳区', '440500'),
(1970, '440514', '潮南区', '440500'),
(1971, '440515', '澄海区', '440500'),
(1972, '440523', '南澳县', '440500'),
(1973, '440601', '市辖区', '440600'),
(1974, '440604', '禅城区', '440600'),
(1975, '440605', '南海区', '440600'),
(1976, '440606', '顺德区', '440600'),
(1977, '440607', '三水区', '440600'),
(1978, '440608', '高明区', '440600'),
(1979, '440701', '市辖区', '440700'),
(1980, '440703', '蓬江区', '440700'),
(1981, '440704', '江海区', '440700'),
(1982, '440705', '新会区', '440700'),
(1983, '440781', '台山市', '440700'),
(1984, '440783', '开平市', '440700'),
(1985, '440784', '鹤山市', '440700'),
(1986, '440785', '恩平市', '440700'),
(1987, '440801', '市辖区', '440800'),
(1988, '440802', '赤坎区', '440800'),
(1989, '440803', '霞山区', '440800'),
(1990, '440804', '坡头区', '440800'),
(1991, '440811', '麻章区', '440800'),
(1992, '440823', '遂溪县', '440800'),
(1993, '440825', '徐闻县', '440800'),
(1994, '440881', '廉江市', '440800'),
(1995, '440882', '雷州市', '440800'),
(1996, '440883', '吴川市', '440800'),
(1997, '440901', '市辖区', '440900'),
(1998, '440902', '茂南区', '440900'),
(1999, '440903', '茂港区', '440900'),
(2000, '440923', '电白县', '440900'),
(2001, '440981', '高州市', '440900'),
(2002, '440982', '化州市', '440900'),
(2003, '440983', '信宜市', '440900'),
(2004, '441201', '市辖区', '441200'),
(2005, '441202', '端州区', '441200'),
(2006, '441203', '鼎湖区', '441200'),
(2007, '441223', '广宁县', '441200'),
(2008, '441224', '怀集县', '441200'),
(2009, '441225', '封开县', '441200'),
(2010, '441226', '德庆县', '441200'),
(2011, '441283', '高要市', '441200'),
(2012, '441284', '四会市', '441200'),
(2013, '441301', '市辖区', '441300'),
(2014, '441302', '惠城区', '441300'),
(2015, '441303', '惠阳区', '441300'),
(2016, '441322', '博罗县', '441300'),
(2017, '441323', '惠东县', '441300'),
(2018, '441324', '龙门县', '441300'),
(2019, '441401', '市辖区', '441400'),
(2020, '441402', '梅江区', '441400'),
(2021, '441421', '梅　县', '441400'),
(2022, '441422', '大埔县', '441400'),
(2023, '441423', '丰顺县', '441400'),
(2024, '441424', '五华县', '441400'),
(2025, '441426', '平远县', '441400'),
(2026, '441427', '蕉岭县', '441400'),
(2027, '441481', '兴宁市', '441400'),
(2028, '441501', '市辖区', '441500'),
(2029, '441502', '城　区', '441500'),
(2030, '441521', '海丰县', '441500'),
(2031, '441523', '陆河县', '441500'),
(2032, '441581', '陆丰市', '441500'),
(2033, '441601', '市辖区', '441600'),
(2034, '441602', '源城区', '441600'),
(2035, '441621', '紫金县', '441600'),
(2036, '441622', '龙川县', '441600'),
(2037, '441623', '连平县', '441600'),
(2038, '441624', '和平县', '441600'),
(2039, '441625', '东源县', '441600'),
(2040, '441701', '市辖区', '441700'),
(2041, '441702', '江城区', '441700'),
(2042, '441721', '阳西县', '441700'),
(2043, '441723', '阳东县', '441700'),
(2044, '441781', '阳春市', '441700'),
(2045, '441801', '市辖区', '441800'),
(2046, '441802', '清城区', '441800'),
(2047, '441821', '佛冈县', '441800'),
(2048, '441823', '阳山县', '441800'),
(2049, '441825', '连山壮族瑶族自治县', '441800'),
(2050, '441826', '连南瑶族自治县', '441800'),
(2051, '441827', '清新县', '441800'),
(2052, '441881', '英德市', '441800'),
(2053, '441882', '连州市', '441800'),
(2054, '445101', '市辖区', '445100'),
(2055, '445102', '湘桥区', '445100'),
(2056, '445121', '潮安县', '445100'),
(2057, '445122', '饶平县', '445100'),
(2058, '445201', '市辖区', '445200'),
(2059, '445202', '榕城区', '445200'),
(2060, '445221', '揭东县', '445200'),
(2061, '445222', '揭西县', '445200'),
(2062, '445224', '惠来县', '445200'),
(2063, '445281', '普宁市', '445200'),
(2064, '445301', '市辖区', '445300'),
(2065, '445302', '云城区', '445300'),
(2066, '445321', '新兴县', '445300'),
(2067, '445322', '郁南县', '445300'),
(2068, '445323', '云安县', '445300'),
(2069, '445381', '罗定市', '445300'),
(2070, '450101', '市辖区', '450100'),
(2071, '450102', '兴宁区', '450100'),
(2072, '450103', '青秀区', '450100'),
(2073, '450105', '江南区', '450100'),
(2074, '450107', '西乡塘区', '450100'),
(2075, '450108', '良庆区', '450100'),
(2076, '450109', '邕宁区', '450100'),
(2077, '450122', '武鸣县', '450100'),
(2078, '450123', '隆安县', '450100'),
(2079, '450124', '马山县', '450100'),
(2080, '450125', '上林县', '450100'),
(2081, '450126', '宾阳县', '450100'),
(2082, '450127', '横　县', '450100'),
(2083, '450201', '市辖区', '450200'),
(2084, '450202', '城中区', '450200'),
(2085, '450203', '鱼峰区', '450200'),
(2086, '450204', '柳南区', '450200'),
(2087, '450205', '柳北区', '450200'),
(2088, '450221', '柳江县', '450200'),
(2089, '450222', '柳城县', '450200'),
(2090, '450223', '鹿寨县', '450200'),
(2091, '450224', '融安县', '450200'),
(2092, '450225', '融水苗族自治县', '450200'),
(2093, '450226', '三江侗族自治县', '450200'),
(2094, '450301', '市辖区', '450300'),
(2095, '450302', '秀峰区', '450300'),
(2096, '450303', '叠彩区', '450300'),
(2097, '450304', '象山区', '450300'),
(2098, '450305', '七星区', '450300'),
(2099, '450311', '雁山区', '450300'),
(2100, '450321', '阳朔县', '450300'),
(2101, '450322', '临桂县', '450300'),
(2102, '450323', '灵川县', '450300'),
(2103, '450324', '全州县', '450300'),
(2104, '450325', '兴安县', '450300'),
(2105, '450326', '永福县', '450300'),
(2106, '450327', '灌阳县', '450300'),
(2107, '450328', '龙胜各族自治县', '450300'),
(2108, '450329', '资源县', '450300'),
(2109, '450330', '平乐县', '450300'),
(2110, '450331', '荔蒲县', '450300'),
(2111, '450332', '恭城瑶族自治县', '450300'),
(2112, '450401', '市辖区', '450400'),
(2113, '450403', '万秀区', '450400'),
(2114, '450404', '蝶山区', '450400'),
(2115, '450405', '长洲区', '450400'),
(2116, '450421', '苍梧县', '450400'),
(2117, '450422', '藤　县', '450400'),
(2118, '450423', '蒙山县', '450400'),
(2119, '450481', '岑溪市', '450400'),
(2120, '450501', '市辖区', '450500'),
(2121, '450502', '海城区', '450500'),
(2122, '450503', '银海区', '450500'),
(2123, '450512', '铁山港区', '450500'),
(2124, '450521', '合浦县', '450500'),
(2125, '450601', '市辖区', '450600'),
(2126, '450602', '港口区', '450600'),
(2127, '450603', '防城区', '450600'),
(2128, '450621', '上思县', '450600'),
(2129, '450681', '东兴市', '450600'),
(2130, '450701', '市辖区', '450700'),
(2131, '450702', '钦南区', '450700'),
(2132, '450703', '钦北区', '450700'),
(2133, '450721', '灵山县', '450700'),
(2134, '450722', '浦北县', '450700'),
(2135, '450801', '市辖区', '450800'),
(2136, '450802', '港北区', '450800'),
(2137, '450803', '港南区', '450800'),
(2138, '450804', '覃塘区', '450800'),
(2139, '450821', '平南县', '450800'),
(2140, '450881', '桂平市', '450800'),
(2141, '450901', '市辖区', '450900'),
(2142, '450902', '玉州区', '450900'),
(2143, '450921', '容　县', '450900'),
(2144, '450922', '陆川县', '450900'),
(2145, '450923', '博白县', '450900'),
(2146, '450924', '兴业县', '450900'),
(2147, '450981', '北流市', '450900'),
(2148, '451001', '市辖区', '451000'),
(2149, '451002', '右江区', '451000'),
(2150, '451021', '田阳县', '451000'),
(2151, '451022', '田东县', '451000'),
(2152, '451023', '平果县', '451000'),
(2153, '451024', '德保县', '451000'),
(2154, '451025', '靖西县', '451000'),
(2155, '451026', '那坡县', '451000'),
(2156, '451027', '凌云县', '451000'),
(2157, '451028', '乐业县', '451000'),
(2158, '451029', '田林县', '451000'),
(2159, '451030', '西林县', '451000'),
(2160, '451031', '隆林各族自治县', '451000'),
(2161, '451101', '市辖区', '451100'),
(2162, '451102', '八步区', '451100'),
(2163, '451121', '昭平县', '451100'),
(2164, '451122', '钟山县', '451100'),
(2165, '451123', '富川瑶族自治县', '451100'),
(2166, '451201', '市辖区', '451200'),
(2167, '451202', '金城江区', '451200'),
(2168, '451221', '南丹县', '451200'),
(2169, '451222', '天峨县', '451200'),
(2170, '451223', '凤山县', '451200'),
(2171, '451224', '东兰县', '451200'),
(2172, '451225', '罗城仫佬族自治县', '451200'),
(2173, '451226', '环江毛南族自治县', '451200'),
(2174, '451227', '巴马瑶族自治县', '451200'),
(2175, '451228', '都安瑶族自治县', '451200'),
(2176, '451229', '大化瑶族自治县', '451200'),
(2177, '451281', '宜州市', '451200'),
(2178, '451301', '市辖区', '451300'),
(2179, '451302', '兴宾区', '451300'),
(2180, '451321', '忻城县', '451300'),
(2181, '451322', '象州县', '451300'),
(2182, '451323', '武宣县', '451300'),
(2183, '451324', '金秀瑶族自治县', '451300'),
(2184, '451381', '合山市', '451300'),
(2185, '451401', '市辖区', '451400'),
(2186, '451402', '江洲区', '451400'),
(2187, '451421', '扶绥县', '451400'),
(2188, '451422', '宁明县', '451400'),
(2189, '451423', '龙州县', '451400'),
(2190, '451424', '大新县', '451400'),
(2191, '451425', '天等县', '451400'),
(2192, '451481', '凭祥市', '451400'),
(2193, '460101', '市辖区', '460100'),
(2194, '460105', '秀英区', '460100'),
(2195, '460106', '龙华区', '460100'),
(2196, '460107', '琼山区', '460100'),
(2197, '460108', '美兰区', '460100'),
(2198, '460201', '市辖区', '460200'),
(2199, '469001', '五指山市', '469000'),
(2200, '469002', '琼海市', '469000'),
(2201, '469003', '儋州市', '469000'),
(2202, '469005', '文昌市', '469000'),
(2203, '469006', '万宁市', '469000'),
(2204, '469007', '东方市', '469000'),
(2205, '469025', '定安县', '469000'),
(2206, '469026', '屯昌县', '469000'),
(2207, '469027', '澄迈县', '469000'),
(2208, '469028', '临高县', '469000'),
(2209, '469030', '白沙黎族自治县', '469000'),
(2210, '469031', '昌江黎族自治县', '469000'),
(2211, '469033', '乐东黎族自治县', '469000'),
(2212, '469034', '陵水黎族自治县', '469000'),
(2213, '469035', '保亭黎族苗族自治县', '469000'),
(2214, '469036', '琼中黎族苗族自治县', '469000'),
(2215, '469037', '西沙群岛', '469000'),
(2216, '469038', '南沙群岛', '469000'),
(2217, '469039', '中沙群岛的岛礁及其海域', '469000'),
(2218, '500101', '万州区', '500100'),
(2219, '500102', '涪陵区', '500100'),
(2220, '500103', '渝中区', '500100'),
(2221, '500104', '大渡口区', '500100'),
(2222, '500105', '江北区', '500100'),
(2223, '500106', '沙坪坝区', '500100'),
(2224, '500107', '九龙坡区', '500100'),
(2225, '500108', '南岸区', '500100'),
(2226, '500109', '北碚区', '500100'),
(2227, '500110', '万盛区', '500100'),
(2228, '500111', '双桥区', '500100'),
(2229, '500112', '渝北区', '500100'),
(2230, '500113', '巴南区', '500100'),
(2231, '500114', '黔江区', '500100'),
(2232, '500115', '长寿区', '500100'),
(2233, '500222', '綦江县', '500200'),
(2234, '500223', '潼南县', '500200'),
(2235, '500224', '铜梁县', '500200'),
(2236, '500225', '大足县', '500200'),
(2237, '500226', '荣昌县', '500200'),
(2238, '500227', '璧山县', '500200'),
(2239, '500228', '梁平县', '500200'),
(2240, '500229', '城口县', '500200'),
(2241, '500230', '丰都县', '500200'),
(2242, '500231', '垫江县', '500200'),
(2243, '500232', '武隆县', '500200'),
(2244, '500233', '忠　县', '500200'),
(2245, '500234', '开　县', '500200'),
(2246, '500235', '云阳县', '500200'),
(2247, '500236', '奉节县', '500200'),
(2248, '500237', '巫山县', '500200'),
(2249, '500238', '巫溪县', '500200'),
(2250, '500240', '石柱土家族自治县', '500200'),
(2251, '500241', '秀山土家族苗族自治县', '500200'),
(2252, '500242', '酉阳土家族苗族自治县', '500200'),
(2253, '500243', '彭水苗族土家族自治县', '500200'),
(2254, '500381', '江津市', '500300'),
(2255, '500382', '合川市', '500300'),
(2256, '500383', '永川市', '500300'),
(2257, '500384', '南川市', '500300'),
(2258, '510101', '市辖区', '510100'),
(2259, '510104', '锦江区', '510100'),
(2260, '510105', '青羊区', '510100'),
(2261, '510106', '金牛区', '510100'),
(2262, '510107', '武侯区', '510100'),
(2263, '510108', '成华区', '510100'),
(2264, '510112', '龙泉驿区', '510100'),
(2265, '510113', '青白江区', '510100'),
(2266, '510114', '新都区', '510100'),
(2267, '510115', '温江县', '510100'),
(2268, '510121', '金堂县', '510100'),
(2269, '510122', '双流县', '510100'),
(2270, '510124', '郫　县', '510100'),
(2271, '510129', '大邑县', '510100'),
(2272, '510131', '蒲江县', '510100'),
(2273, '510132', '新津县', '510100'),
(2274, '510181', '都江堰市', '510100'),
(2275, '510182', '彭州市', '510100'),
(2276, '510183', '邛崃市', '510100'),
(2277, '510184', '崇州市', '510100'),
(2278, '510301', '市辖区', '510300'),
(2279, '510302', '自流井区', '510300'),
(2280, '510303', '贡井区', '510300'),
(2281, '510304', '大安区', '510300'),
(2282, '510311', '沿滩区', '510300'),
(2283, '510321', '荣　县', '510300'),
(2284, '510322', '富顺县', '510300'),
(2285, '510401', '市辖区', '510400'),
(2286, '510402', '东　区', '510400'),
(2287, '510403', '西　区', '510400'),
(2288, '510411', '仁和区', '510400'),
(2289, '510421', '米易县', '510400'),
(2290, '510422', '盐边县', '510400'),
(2291, '510501', '市辖区', '510500'),
(2292, '510502', '江阳区', '510500'),
(2293, '510503', '纳溪区', '510500'),
(2294, '510504', '龙马潭区', '510500'),
(2295, '510521', '泸　县', '510500'),
(2296, '510522', '合江县', '510500'),
(2297, '510524', '叙永县', '510500'),
(2298, '510525', '古蔺县', '510500'),
(2299, '510601', '市辖区', '510600'),
(2300, '510603', '旌阳区', '510600'),
(2301, '510623', '中江县', '510600'),
(2302, '510626', '罗江县', '510600'),
(2303, '510681', '广汉市', '510600'),
(2304, '510682', '什邡市', '510600'),
(2305, '510683', '绵竹市', '510600'),
(2306, '510701', '市辖区', '510700'),
(2307, '510703', '涪城区', '510700'),
(2308, '510704', '游仙区', '510700'),
(2309, '510722', '三台县', '510700'),
(2310, '510723', '盐亭县', '510700'),
(2311, '510724', '安　县', '510700'),
(2312, '510725', '梓潼县', '510700'),
(2313, '510726', '北川羌族自治县', '510700'),
(2314, '510727', '平武县', '510700'),
(2315, '510781', '江油市', '510700'),
(2316, '510801', '市辖区', '510800'),
(2317, '510802', '市中区', '510800'),
(2318, '510811', '元坝区', '510800'),
(2319, '510812', '朝天区', '510800'),
(2320, '510821', '旺苍县', '510800'),
(2321, '510822', '青川县', '510800'),
(2322, '510823', '剑阁县', '510800'),
(2323, '510824', '苍溪县', '510800'),
(2324, '510901', '市辖区', '510900'),
(2325, '510903', '船山区', '510900'),
(2326, '510904', '安居区', '510900'),
(2327, '510921', '蓬溪县', '510900'),
(2328, '510922', '射洪县', '510900'),
(2329, '510923', '大英县', '510900'),
(2330, '511001', '市辖区', '511000'),
(2331, '511002', '市中区', '511000'),
(2332, '511011', '东兴区', '511000'),
(2333, '511024', '威远县', '511000'),
(2334, '511025', '资中县', '511000'),
(2335, '511028', '隆昌县', '511000'),
(2336, '511101', '市辖区', '511100'),
(2337, '511102', '市中区', '511100'),
(2338, '511111', '沙湾区', '511100'),
(2339, '511112', '五通桥区', '511100'),
(2340, '511113', '金口河区', '511100'),
(2341, '511123', '犍为县', '511100'),
(2342, '511124', '井研县', '511100'),
(2343, '511126', '夹江县', '511100'),
(2344, '511129', '沐川县', '511100'),
(2345, '511132', '峨边彝族自治县', '511100'),
(2346, '511133', '马边彝族自治县', '511100'),
(2347, '511181', '峨眉山市', '511100'),
(2348, '511301', '市辖区', '511300'),
(2349, '511302', '顺庆区', '511300'),
(2350, '511303', '高坪区', '511300'),
(2351, '511304', '嘉陵区', '511300'),
(2352, '511321', '南部县', '511300'),
(2353, '511322', '营山县', '511300'),
(2354, '511323', '蓬安县', '511300'),
(2355, '511324', '仪陇县', '511300'),
(2356, '511325', '西充县', '511300'),
(2357, '511381', '阆中市', '511300'),
(2358, '511401', '市辖区', '511400'),
(2359, '511402', '东坡区', '511400'),
(2360, '511421', '仁寿县', '511400'),
(2361, '511422', '彭山县', '511400'),
(2362, '511423', '洪雅县', '511400'),
(2363, '511424', '丹棱县', '511400'),
(2364, '511425', '青神县', '511400'),
(2365, '511501', '市辖区', '511500'),
(2366, '511502', '翠屏区', '511500'),
(2367, '511521', '宜宾县', '511500'),
(2368, '511522', '南溪县', '511500'),
(2369, '511523', '江安县', '511500'),
(2370, '511524', '长宁县', '511500'),
(2371, '511525', '高　县', '511500'),
(2372, '511526', '珙　县', '511500'),
(2373, '511527', '筠连县', '511500'),
(2374, '511528', '兴文县', '511500'),
(2375, '511529', '屏山县', '511500'),
(2376, '511601', '市辖区', '511600'),
(2377, '511602', '广安区', '511600'),
(2378, '511621', '岳池县', '511600'),
(2379, '511622', '武胜县', '511600'),
(2380, '511623', '邻水县', '511600'),
(2381, '511681', '华莹市', '511600'),
(2382, '511701', '市辖区', '511700'),
(2383, '511702', '通川区', '511700'),
(2384, '511721', '达　县', '511700'),
(2385, '511722', '宣汉县', '511700'),
(2386, '511723', '开江县', '511700'),
(2387, '511724', '大竹县', '511700'),
(2388, '511725', '渠　县', '511700'),
(2389, '511781', '万源市', '511700'),
(2390, '511801', '市辖区', '511800'),
(2391, '511802', '雨城区', '511800'),
(2392, '511821', '名山县', '511800'),
(2393, '511822', '荥经县', '511800'),
(2394, '511823', '汉源县', '511800'),
(2395, '511824', '石棉县', '511800'),
(2396, '511825', '天全县', '511800'),
(2397, '511826', '芦山县', '511800'),
(2398, '511827', '宝兴县', '511800'),
(2399, '511901', '市辖区', '511900'),
(2400, '511902', '巴州区', '511900'),
(2401, '511921', '通江县', '511900'),
(2402, '511922', '南江县', '511900'),
(2403, '511923', '平昌县', '511900'),
(2404, '512001', '市辖区', '512000'),
(2405, '512002', '雁江区', '512000'),
(2406, '512021', '安岳县', '512000'),
(2407, '512022', '乐至县', '512000'),
(2408, '512081', '简阳市', '512000'),
(2409, '513221', '汶川县', '513200'),
(2410, '513222', '理　县', '513200'),
(2411, '513223', '茂　县', '513200'),
(2412, '513224', '松潘县', '513200'),
(2413, '513225', '九寨沟县', '513200'),
(2414, '513226', '金川县', '513200'),
(2415, '513227', '小金县', '513200'),
(2416, '513228', '黑水县', '513200'),
(2417, '513229', '马尔康县', '513200'),
(2418, '513230', '壤塘县', '513200'),
(2419, '513231', '阿坝县', '513200'),
(2420, '513232', '若尔盖县', '513200'),
(2421, '513233', '红原县', '513200'),
(2422, '513321', '康定县', '513300'),
(2423, '513322', '泸定县', '513300'),
(2424, '513323', '丹巴县', '513300'),
(2425, '513324', '九龙县', '513300'),
(2426, '513325', '雅江县', '513300'),
(2427, '513326', '道孚县', '513300'),
(2428, '513327', '炉霍县', '513300'),
(2429, '513328', '甘孜县', '513300'),
(2430, '513329', '新龙县', '513300'),
(2431, '513330', '德格县', '513300'),
(2432, '513331', '白玉县', '513300'),
(2433, '513332', '石渠县', '513300'),
(2434, '513333', '色达县', '513300'),
(2435, '513334', '理塘县', '513300'),
(2436, '513335', '巴塘县', '513300'),
(2437, '513336', '乡城县', '513300'),
(2438, '513337', '稻城县', '513300'),
(2439, '513338', '得荣县', '513300'),
(2440, '513401', '西昌市', '513400'),
(2441, '513422', '木里藏族自治县', '513400'),
(2442, '513423', '盐源县', '513400'),
(2443, '513424', '德昌县', '513400'),
(2444, '513425', '会理县', '513400'),
(2445, '513426', '会东县', '513400'),
(2446, '513427', '宁南县', '513400'),
(2447, '513428', '普格县', '513400'),
(2448, '513429', '布拖县', '513400'),
(2449, '513430', '金阳县', '513400'),
(2450, '513431', '昭觉县', '513400'),
(2451, '513432', '喜德县', '513400'),
(2452, '513433', '冕宁县', '513400'),
(2453, '513434', '越西县', '513400'),
(2454, '513435', '甘洛县', '513400'),
(2455, '513436', '美姑县', '513400'),
(2456, '513437', '雷波县', '513400'),
(2457, '520101', '市辖区', '520100'),
(2458, '520102', '南明区', '520100'),
(2459, '520103', '云岩区', '520100'),
(2460, '520111', '花溪区', '520100'),
(2461, '520112', '乌当区', '520100'),
(2462, '520113', '白云区', '520100'),
(2463, '520114', '小河区', '520100'),
(2464, '520121', '开阳县', '520100'),
(2465, '520122', '息烽县', '520100'),
(2466, '520123', '修文县', '520100'),
(2467, '520181', '清镇市', '520100'),
(2468, '520201', '钟山区', '520200'),
(2469, '520203', '六枝特区', '520200'),
(2470, '520221', '水城县', '520200'),
(2471, '520222', '盘　县', '520200'),
(2472, '520301', '市辖区', '520300'),
(2473, '520302', '红花岗区', '520300'),
(2474, '520303', '汇川区', '520300'),
(2475, '520321', '遵义县', '520300'),
(2476, '520322', '桐梓县', '520300'),
(2477, '520323', '绥阳县', '520300'),
(2478, '520324', '正安县', '520300'),
(2479, '520325', '道真仡佬族苗族自治县', '520300'),
(2480, '520326', '务川仡佬族苗族自治县', '520300'),
(2481, '520327', '凤冈县', '520300'),
(2482, '520328', '湄潭县', '520300'),
(2483, '520329', '余庆县', '520300'),
(2484, '520330', '习水县', '520300'),
(2485, '520381', '赤水市', '520300'),
(2486, '520382', '仁怀市', '520300'),
(2487, '520401', '市辖区', '520400'),
(2488, '520402', '西秀区', '520400'),
(2489, '520421', '平坝县', '520400'),
(2490, '520422', '普定县', '520400'),
(2491, '520423', '镇宁布依族苗族自治县', '520400'),
(2492, '520424', '关岭布依族苗族自治县', '520400'),
(2493, '520425', '紫云苗族布依族自治县', '520400'),
(2494, '522201', '铜仁市', '522200'),
(2495, '522222', '江口县', '522200'),
(2496, '522223', '玉屏侗族自治县', '522200'),
(2497, '522224', '石阡县', '522200'),
(2498, '522225', '思南县', '522200'),
(2499, '522226', '印江土家族苗族自治县', '522200'),
(2500, '522227', '德江县', '522200'),
(2501, '522228', '沿河土家族自治县', '522200'),
(2502, '522229', '松桃苗族自治县', '522200'),
(2503, '522230', '万山特区', '522200'),
(2504, '522301', '兴义市', '522300'),
(2505, '522322', '兴仁县', '522300'),
(2506, '522323', '普安县', '522300'),
(2507, '522324', '晴隆县', '522300'),
(2508, '522325', '贞丰县', '522300'),
(2509, '522326', '望谟县', '522300'),
(2510, '522327', '册亨县', '522300'),
(2511, '522328', '安龙县', '522300'),
(2512, '522401', '毕节市', '522400'),
(2513, '522422', '大方县', '522400'),
(2514, '522423', '黔西县', '522400'),
(2515, '522424', '金沙县', '522400'),
(2516, '522425', '织金县', '522400'),
(2517, '522426', '纳雍县', '522400'),
(2518, '522427', '威宁彝族回族苗族自治县', '522400'),
(2519, '522428', '赫章县', '522400'),
(2520, '522601', '凯里市', '522600'),
(2521, '522622', '黄平县', '522600'),
(2522, '522623', '施秉县', '522600'),
(2523, '522624', '三穗县', '522600'),
(2524, '522625', '镇远县', '522600'),
(2525, '522626', '岑巩县', '522600'),
(2526, '522627', '天柱县', '522600'),
(2527, '522628', '锦屏县', '522600'),
(2528, '522629', '剑河县', '522600'),
(2529, '522630', '台江县', '522600'),
(2530, '522631', '黎平县', '522600'),
(2531, '522632', '榕江县', '522600'),
(2532, '522633', '从江县', '522600'),
(2533, '522634', '雷山县', '522600'),
(2534, '522635', '麻江县', '522600'),
(2535, '522636', '丹寨县', '522600'),
(2536, '522701', '都匀市', '522700'),
(2537, '522702', '福泉市', '522700'),
(2538, '522722', '荔波县', '522700'),
(2539, '522723', '贵定县', '522700'),
(2540, '522725', '瓮安县', '522700'),
(2541, '522726', '独山县', '522700'),
(2542, '522727', '平塘县', '522700'),
(2543, '522728', '罗甸县', '522700'),
(2544, '522729', '长顺县', '522700'),
(2545, '522730', '龙里县', '522700'),
(2546, '522731', '惠水县', '522700'),
(2547, '522732', '三都水族自治县', '522700'),
(2548, '530101', '市辖区', '530100'),
(2549, '530102', '五华区', '530100'),
(2550, '530103', '盘龙区', '530100'),
(2551, '530111', '官渡区', '530100'),
(2552, '530112', '西山区', '530100'),
(2553, '530113', '东川区', '530100'),
(2554, '530121', '呈贡县', '530100'),
(2555, '530122', '晋宁县', '530100'),
(2556, '530124', '富民县', '530100'),
(2557, '530125', '宜良县', '530100'),
(2558, '530126', '石林彝族自治县', '530100'),
(2559, '530127', '嵩明县', '530100'),
(2560, '530128', '禄劝彝族苗族自治县', '530100'),
(2561, '530129', '寻甸回族彝族自治县', '530100'),
(2562, '530181', '安宁市', '530100'),
(2563, '530301', '市辖区', '530300'),
(2564, '530302', '麒麟区', '530300'),
(2565, '530321', '马龙县', '530300'),
(2566, '530322', '陆良县', '530300'),
(2567, '530323', '师宗县', '530300'),
(2568, '530324', '罗平县', '530300'),
(2569, '530325', '富源县', '530300'),
(2570, '530326', '会泽县', '530300'),
(2571, '530328', '沾益县', '530300'),
(2572, '530381', '宣威市', '530300'),
(2573, '530401', '市辖区', '530400'),
(2574, '530402', '红塔区', '530400'),
(2575, '530421', '江川县', '530400'),
(2576, '530422', '澄江县', '530400'),
(2577, '530423', '通海县', '530400'),
(2578, '530424', '华宁县', '530400'),
(2579, '530425', '易门县', '530400'),
(2580, '530426', '峨山彝族自治县', '530400'),
(2581, '530427', '新平彝族傣族自治县', '530400'),
(2582, '530428', '元江哈尼族彝族傣族自治县', '530400'),
(2583, '530501', '市辖区', '530500'),
(2584, '530502', '隆阳区', '530500'),
(2585, '530521', '施甸县', '530500'),
(2586, '530522', '腾冲县', '530500'),
(2587, '530523', '龙陵县', '530500'),
(2588, '530524', '昌宁县', '530500'),
(2589, '530601', '市辖区', '530600'),
(2590, '530602', '昭阳区', '530600'),
(2591, '530621', '鲁甸县', '530600'),
(2592, '530622', '巧家县', '530600'),
(2593, '530623', '盐津县', '530600'),
(2594, '530624', '大关县', '530600'),
(2595, '530625', '永善县', '530600'),
(2596, '530626', '绥江县', '530600'),
(2597, '530627', '镇雄县', '530600'),
(2598, '530628', '彝良县', '530600'),
(2599, '530629', '威信县', '530600'),
(2600, '530630', '水富县', '530600'),
(2601, '530701', '市辖区', '530700'),
(2602, '530702', '古城区', '530700'),
(2603, '530721', '玉龙纳西族自治县', '530700'),
(2604, '530722', '永胜县', '530700'),
(2605, '530723', '华坪县', '530700'),
(2606, '530724', '宁蒗彝族自治县', '530700'),
(2607, '530801', '市辖区', '530800'),
(2608, '530802', '翠云区', '530800'),
(2609, '530821', '普洱哈尼族彝族自治县', '530800'),
(2610, '530822', '墨江哈尼族自治县', '530800'),
(2611, '530823', '景东彝族自治县', '530800'),
(2612, '530824', '景谷傣族彝族自治县', '530800'),
(2613, '530825', '镇沅彝族哈尼族拉祜族自治县', '530800'),
(2614, '530826', '江城哈尼族彝族自治县', '530800'),
(2615, '530827', '孟连傣族拉祜族佤族自治县', '530800'),
(2616, '530828', '澜沧拉祜族自治县', '530800'),
(2617, '530829', '西盟佤族自治县', '530800'),
(2618, '530901', '市辖区', '530900'),
(2619, '530902', '临翔区', '530900'),
(2620, '530921', '凤庆县', '530900'),
(2621, '530922', '云　县', '530900'),
(2622, '530923', '永德县', '530900'),
(2623, '530924', '镇康县', '530900'),
(2624, '530925', '双江拉祜族佤族布朗族傣族自治县', '530900'),
(2625, '530926', '耿马傣族佤族自治县', '530900'),
(2626, '530927', '沧源佤族自治县', '530900'),
(2627, '532301', '楚雄市', '532300'),
(2628, '532322', '双柏县', '532300'),
(2629, '532323', '牟定县', '532300'),
(2630, '532324', '南华县', '532300'),
(2631, '532325', '姚安县', '532300'),
(2632, '532326', '大姚县', '532300'),
(2633, '532327', '永仁县', '532300'),
(2634, '532328', '元谋县', '532300'),
(2635, '532329', '武定县', '532300'),
(2636, '532331', '禄丰县', '532300'),
(2637, '532501', '个旧市', '532500'),
(2638, '532502', '开远市', '532500'),
(2639, '532522', '蒙自县', '532500'),
(2640, '532523', '屏边苗族自治县', '532500'),
(2641, '532524', '建水县', '532500'),
(2642, '532525', '石屏县', '532500'),
(2643, '532526', '弥勒县', '532500'),
(2644, '532527', '泸西县', '532500'),
(2645, '532528', '元阳县', '532500'),
(2646, '532529', '红河县', '532500'),
(2647, '532530', '金平苗族瑶族傣族自治县', '532500'),
(2648, '532531', '绿春县', '532500'),
(2649, '532532', '河口瑶族自治县', '532500'),
(2650, '532621', '文山县', '532600'),
(2651, '532622', '砚山县', '532600'),
(2652, '532623', '西畴县', '532600'),
(2653, '532624', '麻栗坡县', '532600'),
(2654, '532625', '马关县', '532600'),
(2655, '532626', '丘北县', '532600'),
(2656, '532627', '广南县', '532600'),
(2657, '532628', '富宁县', '532600'),
(2658, '532801', '景洪市', '532800'),
(2659, '532822', '勐海县', '532800'),
(2660, '532823', '勐腊县', '532800'),
(2661, '532901', '大理市', '532900'),
(2662, '532922', '漾濞彝族自治县', '532900'),
(2663, '532923', '祥云县', '532900'),
(2664, '532924', '宾川县', '532900'),
(2665, '532925', '弥渡县', '532900'),
(2666, '532926', '南涧彝族自治县', '532900'),
(2667, '532927', '巍山彝族回族自治县', '532900'),
(2668, '532928', '永平县', '532900'),
(2669, '532929', '云龙县', '532900'),
(2670, '532930', '洱源县', '532900'),
(2671, '532931', '剑川县', '532900'),
(2672, '532932', '鹤庆县', '532900'),
(2673, '533102', '瑞丽市', '533100'),
(2674, '533103', '潞西市', '533100'),
(2675, '533122', '梁河县', '533100'),
(2676, '533123', '盈江县', '533100'),
(2677, '533124', '陇川县', '533100'),
(2678, '533321', '泸水县', '533300'),
(2679, '533323', '福贡县', '533300'),
(2680, '533324', '贡山独龙族怒族自治县', '533300'),
(2681, '533325', '兰坪白族普米族自治县', '533300'),
(2682, '533421', '香格里拉县', '533400'),
(2683, '533422', '德钦县', '533400'),
(2684, '533423', '维西傈僳族自治县', '533400'),
(2685, '540101', '市辖区', '540100'),
(2686, '540102', '城关区', '540100'),
(2687, '540121', '林周县', '540100'),
(2688, '540122', '当雄县', '540100'),
(2689, '540123', '尼木县', '540100'),
(2690, '540124', '曲水县', '540100'),
(2691, '540125', '堆龙德庆县', '540100'),
(2692, '540126', '达孜县', '540100'),
(2693, '540127', '墨竹工卡县', '540100'),
(2694, '542121', '昌都县', '542100'),
(2695, '542122', '江达县', '542100'),
(2696, '542123', '贡觉县', '542100'),
(2697, '542124', '类乌齐县', '542100'),
(2698, '542125', '丁青县', '542100'),
(2699, '542126', '察雅县', '542100'),
(2700, '542127', '八宿县', '542100'),
(2701, '542128', '左贡县', '542100'),
(2702, '542129', '芒康县', '542100'),
(2703, '542132', '洛隆县', '542100'),
(2704, '542133', '边坝县', '542100'),
(2705, '542221', '乃东县', '542200'),
(2706, '542222', '扎囊县', '542200'),
(2707, '542223', '贡嘎县', '542200'),
(2708, '542224', '桑日县', '542200'),
(2709, '542225', '琼结县', '542200'),
(2710, '542226', '曲松县', '542200'),
(2711, '542227', '措美县', '542200'),
(2712, '542228', '洛扎县', '542200'),
(2713, '542229', '加查县', '542200'),
(2714, '542231', '隆子县', '542200'),
(2715, '542232', '错那县', '542200'),
(2716, '542233', '浪卡子县', '542200'),
(2717, '542301', '日喀则市', '542300'),
(2718, '542322', '南木林县', '542300'),
(2719, '542323', '江孜县', '542300'),
(2720, '542324', '定日县', '542300'),
(2721, '542325', '萨迦县', '542300'),
(2722, '542326', '拉孜县', '542300'),
(2723, '542327', '昂仁县', '542300'),
(2724, '542328', '谢通门县', '542300'),
(2725, '542329', '白朗县', '542300'),
(2726, '542330', '仁布县', '542300'),
(2727, '542331', '康马县', '542300'),
(2728, '542332', '定结县', '542300'),
(2729, '542333', '仲巴县', '542300'),
(2730, '542334', '亚东县', '542300'),
(2731, '542335', '吉隆县', '542300'),
(2732, '542336', '聂拉木县', '542300'),
(2733, '542337', '萨嘎县', '542300'),
(2734, '542338', '岗巴县', '542300'),
(2735, '542421', '那曲县', '542400'),
(2736, '542422', '嘉黎县', '542400'),
(2737, '542423', '比如县', '542400'),
(2738, '542424', '聂荣县', '542400'),
(2739, '542425', '安多县', '542400'),
(2740, '542426', '申扎县', '542400'),
(2741, '542427', '索　县', '542400'),
(2742, '542428', '班戈县', '542400'),
(2743, '542429', '巴青县', '542400'),
(2744, '542430', '尼玛县', '542400'),
(2745, '542521', '普兰县', '542500'),
(2746, '542522', '札达县', '542500'),
(2747, '542523', '噶尔县', '542500'),
(2748, '542524', '日土县', '542500'),
(2749, '542525', '革吉县', '542500'),
(2750, '542526', '改则县', '542500'),
(2751, '542527', '措勤县', '542500'),
(2752, '542621', '林芝县', '542600'),
(2753, '542622', '工布江达县', '542600'),
(2754, '542623', '米林县', '542600'),
(2755, '542624', '墨脱县', '542600'),
(2756, '542625', '波密县', '542600'),
(2757, '542626', '察隅县', '542600'),
(2758, '542627', '朗　县', '542600'),
(2759, '610101', '市辖区', '610100'),
(2760, '610102', '新城区', '610100'),
(2761, '610103', '碑林区', '610100'),
(2762, '610104', '莲湖区', '610100'),
(2763, '610111', '灞桥区', '610100'),
(2764, '610112', '未央区', '610100'),
(2765, '610113', '雁塔区', '610100'),
(2766, '610114', '阎良区', '610100'),
(2767, '610115', '临潼区', '610100'),
(2768, '610116', '长安区', '610100'),
(2769, '610122', '蓝田县', '610100'),
(2770, '610124', '周至县', '610100'),
(2771, '610125', '户　县', '610100'),
(2772, '610126', '高陵县', '610100'),
(2773, '610201', '市辖区', '610200'),
(2774, '610202', '王益区', '610200'),
(2775, '610203', '印台区', '610200'),
(2776, '610204', '耀州区', '610200'),
(2777, '610222', '宜君县', '610200'),
(2778, '610301', '市辖区', '610300'),
(2779, '610302', '渭滨区', '610300'),
(2780, '610303', '金台区', '610300'),
(2781, '610304', '陈仓区', '610300'),
(2782, '610322', '凤翔县', '610300'),
(2783, '610323', '岐山县', '610300'),
(2784, '610324', '扶风县', '610300'),
(2785, '610326', '眉　县', '610300'),
(2786, '610327', '陇　县', '610300'),
(2787, '610328', '千阳县', '610300'),
(2788, '610329', '麟游县', '610300'),
(2789, '610330', '凤　县', '610300'),
(2790, '610331', '太白县', '610300'),
(2791, '610401', '市辖区', '610400'),
(2792, '610402', '秦都区', '610400'),
(2793, '610403', '杨凌区', '610400'),
(2794, '610404', '渭城区', '610400'),
(2795, '610422', '三原县', '610400'),
(2796, '610423', '泾阳县', '610400'),
(2797, '610424', '乾　县', '610400'),
(2798, '610425', '礼泉县', '610400'),
(2799, '610426', '永寿县', '610400'),
(2800, '610427', '彬　县', '610400'),
(2801, '610428', '长武县', '610400'),
(2802, '610429', '旬邑县', '610400'),
(2803, '610430', '淳化县', '610400'),
(2804, '610431', '武功县', '610400'),
(2805, '610481', '兴平市', '610400'),
(2806, '610501', '市辖区', '610500'),
(2807, '610502', '临渭区', '610500'),
(2808, '610521', '华　县', '610500'),
(2809, '610522', '潼关县', '610500'),
(2810, '610523', '大荔县', '610500'),
(2811, '610524', '合阳县', '610500'),
(2812, '610525', '澄城县', '610500'),
(2813, '610526', '蒲城县', '610500'),
(2814, '610527', '白水县', '610500'),
(2815, '610528', '富平县', '610500'),
(2816, '610581', '韩城市', '610500'),
(2817, '610582', '华阴市', '610500'),
(2818, '610601', '市辖区', '610600'),
(2819, '610602', '宝塔区', '610600'),
(2820, '610621', '延长县', '610600'),
(2821, '610622', '延川县', '610600'),
(2822, '610623', '子长县', '610600'),
(2823, '610624', '安塞县', '610600'),
(2824, '610625', '志丹县', '610600'),
(2825, '610626', '吴旗县', '610600'),
(2826, '610627', '甘泉县', '610600'),
(2827, '610628', '富　县', '610600'),
(2828, '610629', '洛川县', '610600'),
(2829, '610630', '宜川县', '610600'),
(2830, '610631', '黄龙县', '610600'),
(2831, '610632', '黄陵县', '610600'),
(2832, '610701', '市辖区', '610700'),
(2833, '610702', '汉台区', '610700'),
(2834, '610721', '南郑县', '610700'),
(2835, '610722', '城固县', '610700'),
(2836, '610723', '洋　县', '610700'),
(2837, '610724', '西乡县', '610700'),
(2838, '610725', '勉　县', '610700'),
(2839, '610726', '宁强县', '610700'),
(2840, '610727', '略阳县', '610700'),
(2841, '610728', '镇巴县', '610700'),
(2842, '610729', '留坝县', '610700'),
(2843, '610730', '佛坪县', '610700'),
(2844, '610801', '市辖区', '610800'),
(2845, '610802', '榆阳区', '610800'),
(2846, '610821', '神木县', '610800'),
(2847, '610822', '府谷县', '610800'),
(2848, '610823', '横山县', '610800'),
(2849, '610824', '靖边县', '610800'),
(2850, '610825', '定边县', '610800'),
(2851, '610826', '绥德县', '610800'),
(2852, '610827', '米脂县', '610800'),
(2853, '610828', '佳　县', '610800'),
(2854, '610829', '吴堡县', '610800'),
(2855, '610830', '清涧县', '610800'),
(2856, '610831', '子洲县', '610800'),
(2857, '610901', '市辖区', '610900'),
(2858, '610902', '汉滨区', '610900'),
(2859, '610921', '汉阴县', '610900'),
(2860, '610922', '石泉县', '610900'),
(2861, '610923', '宁陕县', '610900'),
(2862, '610924', '紫阳县', '610900'),
(2863, '610925', '岚皋县', '610900'),
(2864, '610926', '平利县', '610900'),
(2865, '610927', '镇坪县', '610900'),
(2866, '610928', '旬阳县', '610900'),
(2867, '610929', '白河县', '610900'),
(2868, '611001', '市辖区', '611000'),
(2869, '611002', '商州区', '611000'),
(2870, '611021', '洛南县', '611000'),
(2871, '611022', '丹凤县', '611000'),
(2872, '611023', '商南县', '611000'),
(2873, '611024', '山阳县', '611000'),
(2874, '611025', '镇安县', '611000'),
(2875, '611026', '柞水县', '611000'),
(2876, '620101', '市辖区', '620100'),
(2877, '620102', '城关区', '620100'),
(2878, '620103', '七里河区', '620100'),
(2879, '620104', '西固区', '620100'),
(2880, '620105', '安宁区', '620100'),
(2881, '620111', '红古区', '620100'),
(2882, '620121', '永登县', '620100'),
(2883, '620122', '皋兰县', '620100'),
(2884, '620123', '榆中县', '620100'),
(2885, '620201', '市辖区', '620200'),
(2886, '620301', '市辖区', '620300'),
(2887, '620302', '金川区', '620300'),
(2888, '620321', '永昌县', '620300'),
(2889, '620401', '市辖区', '620400'),
(2890, '620402', '白银区', '620400'),
(2891, '620403', '平川区', '620400'),
(2892, '620421', '靖远县', '620400'),
(2893, '620422', '会宁县', '620400'),
(2894, '620423', '景泰县', '620400'),
(2895, '620501', '市辖区', '620500'),
(2896, '620502', '秦城区', '620500'),
(2897, '620503', '北道区', '620500'),
(2898, '620521', '清水县', '620500'),
(2899, '620522', '秦安县', '620500'),
(2900, '620523', '甘谷县', '620500'),
(2901, '620524', '武山县', '620500'),
(2902, '620525', '张家川回族自治县', '620500'),
(2903, '620601', '市辖区', '620600'),
(2904, '620602', '凉州区', '620600'),
(2905, '620621', '民勤县', '620600'),
(2906, '620622', '古浪县', '620600'),
(2907, '620623', '天祝藏族自治县', '620600'),
(2908, '620701', '市辖区', '620700'),
(2909, '620702', '甘州区', '620700'),
(2910, '620721', '肃南裕固族自治县', '620700'),
(2911, '620722', '民乐县', '620700'),
(2912, '620723', '临泽县', '620700'),
(2913, '620724', '高台县', '620700'),
(2914, '620725', '山丹县', '620700'),
(2915, '620801', '市辖区', '620800'),
(2916, '620802', '崆峒区', '620800'),
(2917, '620821', '泾川县', '620800'),
(2918, '620822', '灵台县', '620800'),
(2919, '620823', '崇信县', '620800'),
(2920, '620824', '华亭县', '620800'),
(2921, '620825', '庄浪县', '620800'),
(2922, '620826', '静宁县', '620800'),
(2923, '620901', '市辖区', '620900'),
(2924, '620902', '肃州区', '620900'),
(2925, '620921', '金塔县', '620900'),
(2926, '620922', '安西县', '620900'),
(2927, '620923', '肃北蒙古族自治县', '620900'),
(2928, '620924', '阿克塞哈萨克族自治县', '620900'),
(2929, '620981', '玉门市', '620900'),
(2930, '620982', '敦煌市', '620900'),
(2931, '621001', '市辖区', '621000'),
(2932, '621002', '西峰区', '621000'),
(2933, '621021', '庆城县', '621000'),
(2934, '621022', '环　县', '621000'),
(2935, '621023', '华池县', '621000'),
(2936, '621024', '合水县', '621000'),
(2937, '621025', '正宁县', '621000'),
(2938, '621026', '宁　县', '621000'),
(2939, '621027', '镇原县', '621000'),
(2940, '621101', '市辖区', '621100'),
(2941, '621102', '安定区', '621100'),
(2942, '621121', '通渭县', '621100'),
(2943, '621122', '陇西县', '621100'),
(2944, '621123', '渭源县', '621100'),
(2945, '621124', '临洮县', '621100'),
(2946, '621125', '漳　县', '621100'),
(2947, '621126', '岷　县', '621100'),
(2948, '621201', '市辖区', '621200'),
(2949, '621202', '武都区', '621200'),
(2950, '621221', '成　县', '621200'),
(2951, '621222', '文　县', '621200'),
(2952, '621223', '宕昌县', '621200'),
(2953, '621224', '康　县', '621200'),
(2954, '621225', '西和县', '621200'),
(2955, '621226', '礼　县', '621200'),
(2956, '621227', '徽　县', '621200'),
(2957, '621228', '两当县', '621200'),
(2958, '622901', '临夏市', '622900'),
(2959, '622921', '临夏县', '622900'),
(2960, '622922', '康乐县', '622900'),
(2961, '622923', '永靖县', '622900'),
(2962, '622924', '广河县', '622900'),
(2963, '622925', '和政县', '622900'),
(2964, '622926', '东乡族自治县', '622900'),
(2965, '622927', '积石山保安族东乡族撒拉族自治县', '622900'),
(2966, '623001', '合作市', '623000'),
(2967, '623021', '临潭县', '623000'),
(2968, '623022', '卓尼县', '623000'),
(2969, '623023', '舟曲县', '623000'),
(2970, '623024', '迭部县', '623000'),
(2971, '623025', '玛曲县', '623000'),
(2972, '623026', '碌曲县', '623000'),
(2973, '623027', '夏河县', '623000'),
(2974, '630101', '市辖区', '630100'),
(2975, '630102', '城东区', '630100'),
(2976, '630103', '城中区', '630100'),
(2977, '630104', '城西区', '630100'),
(2978, '630105', '城北区', '630100'),
(2979, '630121', '大通回族土族自治县', '630100'),
(2980, '630122', '湟中县', '630100'),
(2981, '630123', '湟源县', '630100'),
(2982, '632121', '平安县', '632100'),
(2983, '632122', '民和回族土族自治县', '632100'),
(2984, '632123', '乐都县', '632100'),
(2985, '632126', '互助土族自治县', '632100'),
(2986, '632127', '化隆回族自治县', '632100'),
(2987, '632128', '循化撒拉族自治县', '632100'),
(2988, '632221', '门源回族自治县', '632200'),
(2989, '632222', '祁连县', '632200'),
(2990, '632223', '海晏县', '632200'),
(2991, '632224', '刚察县', '632200'),
(2992, '632321', '同仁县', '632300'),
(2993, '632322', '尖扎县', '632300'),
(2994, '632323', '泽库县', '632300'),
(2995, '632324', '河南蒙古族自治县', '632300'),
(2996, '632521', '共和县', '632500'),
(2997, '632522', '同德县', '632500'),
(2998, '632523', '贵德县', '632500'),
(2999, '632524', '兴海县', '632500'),
(3000, '632525', '贵南县', '632500'),
(3001, '632621', '玛沁县', '632600'),
(3002, '632622', '班玛县', '632600'),
(3003, '632623', '甘德县', '632600'),
(3004, '632624', '达日县', '632600'),
(3005, '632625', '久治县', '632600'),
(3006, '632626', '玛多县', '632600'),
(3007, '632721', '玉树县', '632700'),
(3008, '632722', '杂多县', '632700'),
(3009, '632723', '称多县', '632700'),
(3010, '632724', '治多县', '632700'),
(3011, '632725', '囊谦县', '632700'),
(3012, '632726', '曲麻莱县', '632700'),
(3013, '632801', '格尔木市', '632800'),
(3014, '632802', '德令哈市', '632800'),
(3015, '632821', '乌兰县', '632800'),
(3016, '632822', '都兰县', '632800'),
(3017, '632823', '天峻县', '632800'),
(3018, '640101', '市辖区', '640100'),
(3019, '640104', '兴庆区', '640100'),
(3020, '640105', '西夏区', '640100'),
(3021, '640106', '金凤区', '640100'),
(3022, '640121', '永宁县', '640100'),
(3023, '640122', '贺兰县', '640100'),
(3024, '640181', '灵武市', '640100'),
(3025, '640201', '市辖区', '640200'),
(3026, '640202', '大武口区', '640200'),
(3027, '640205', '惠农区', '640200'),
(3028, '640221', '平罗县', '640200'),
(3029, '640301', '市辖区', '640300'),
(3030, '640302', '利通区', '640300'),
(3031, '640323', '盐池县', '640300'),
(3032, '640324', '同心县', '640300'),
(3033, '640381', '青铜峡市', '640300');
INSERT INTO `china_areas` (`id`, `areaid`, `area`, `cityid`) VALUES
(3034, '640401', '市辖区', '640400'),
(3035, '640402', '原州区', '640400'),
(3036, '640422', '西吉县', '640400'),
(3037, '640423', '隆德县', '640400'),
(3038, '640424', '泾源县', '640400'),
(3039, '640425', '彭阳县', '640400'),
(3040, '640501', '市辖区', '640500'),
(3041, '640502', '沙坡头区', '640500'),
(3042, '640521', '中宁县', '640500'),
(3043, '640522', '海原县', '640400'),
(3044, '650101', '市辖区', '650100'),
(3045, '650102', '天山区', '650100'),
(3046, '650103', '沙依巴克区', '650100'),
(3047, '650104', '新市区', '650100'),
(3048, '650105', '水磨沟区', '650100'),
(3049, '650106', '头屯河区', '650100'),
(3050, '650107', '达坂城区', '650100'),
(3051, '650108', '东山区', '650100'),
(3052, '650121', '乌鲁木齐县', '650100'),
(3053, '650201', '市辖区', '650200'),
(3054, '650202', '独山子区', '650200'),
(3055, '650203', '克拉玛依区', '650200'),
(3056, '650204', '白碱滩区', '650200'),
(3057, '650205', '乌尔禾区', '650200'),
(3058, '652101', '吐鲁番市', '652100'),
(3059, '652122', '鄯善县', '652100'),
(3060, '652123', '托克逊县', '652100'),
(3061, '652201', '哈密市', '652200'),
(3062, '652222', '巴里坤哈萨克自治县', '652200'),
(3063, '652223', '伊吾县', '652200'),
(3064, '652301', '昌吉市', '652300'),
(3065, '652302', '阜康市', '652300'),
(3066, '652303', '米泉市', '652300'),
(3067, '652323', '呼图壁县', '652300'),
(3068, '652324', '玛纳斯县', '652300'),
(3069, '652325', '奇台县', '652300'),
(3070, '652327', '吉木萨尔县', '652300'),
(3071, '652328', '木垒哈萨克自治县', '652300'),
(3072, '652701', '博乐市', '652700'),
(3073, '652722', '精河县', '652700'),
(3074, '652723', '温泉县', '652700'),
(3075, '652801', '库尔勒市', '652800'),
(3076, '652822', '轮台县', '652800'),
(3077, '652823', '尉犁县', '652800'),
(3078, '652824', '若羌县', '652800'),
(3079, '652825', '且末县', '652800'),
(3080, '652826', '焉耆回族自治县', '652800'),
(3081, '652827', '和静县', '652800'),
(3082, '652828', '和硕县', '652800'),
(3083, '652829', '博湖县', '652800'),
(3084, '652901', '阿克苏市', '652900'),
(3085, '652922', '温宿县', '652900'),
(3086, '652923', '库车县', '652900'),
(3087, '652924', '沙雅县', '652900'),
(3088, '652925', '新和县', '652900'),
(3089, '652926', '拜城县', '652900'),
(3090, '652927', '乌什县', '652900'),
(3091, '652928', '阿瓦提县', '652900'),
(3092, '652929', '柯坪县', '652900'),
(3093, '653001', '阿图什市', '653000'),
(3094, '653022', '阿克陶县', '653000'),
(3095, '653023', '阿合奇县', '653000'),
(3096, '653024', '乌恰县', '653000'),
(3097, '653101', '喀什市', '653100'),
(3098, '653121', '疏附县', '653100'),
(3099, '653122', '疏勒县', '653100'),
(3100, '653123', '英吉沙县', '653100'),
(3101, '653124', '泽普县', '653100'),
(3102, '653125', '莎车县', '653100'),
(3103, '653126', '叶城县', '653100'),
(3104, '653127', '麦盖提县', '653100'),
(3105, '653128', '岳普湖县', '653100'),
(3106, '653129', '伽师县', '653100'),
(3107, '653130', '巴楚县', '653100'),
(3108, '653131', '塔什库尔干塔吉克自治县', '653100'),
(3109, '653201', '和田市', '653200'),
(3110, '653221', '和田县', '653200'),
(3111, '653222', '墨玉县', '653200'),
(3112, '653223', '皮山县', '653200'),
(3113, '653224', '洛浦县', '653200'),
(3114, '653225', '策勒县', '653200'),
(3115, '653226', '于田县', '653200'),
(3116, '653227', '民丰县', '653200'),
(3117, '654002', '伊宁市', '654000'),
(3118, '654003', '奎屯市', '654000'),
(3119, '654021', '伊宁县', '654000'),
(3120, '654022', '察布查尔锡伯自治县', '654000'),
(3121, '654023', '霍城县', '654000'),
(3122, '654024', '巩留县', '654000'),
(3123, '654025', '新源县', '654000'),
(3124, '654026', '昭苏县', '654000'),
(3125, '654027', '特克斯县', '654000'),
(3126, '654028', '尼勒克县', '654000'),
(3127, '654201', '塔城市', '654200'),
(3128, '654202', '乌苏市', '654200'),
(3129, '654221', '额敏县', '654200'),
(3130, '654223', '沙湾县', '654200'),
(3131, '654224', '托里县', '654200'),
(3132, '654225', '裕民县', '654200'),
(3133, '654226', '和布克赛尔蒙古自治县', '654200'),
(3134, '654301', '阿勒泰市', '654300'),
(3135, '654321', '布尔津县', '654300'),
(3136, '654322', '富蕴县', '654300'),
(3137, '654323', '福海县', '654300'),
(3138, '654324', '哈巴河县', '654300'),
(3139, '654325', '青河县', '654300'),
(3140, '654326', '吉木乃县', '654300'),
(3141, '659001', '石河子市', '659000'),
(3142, '659002', '阿拉尔市', '659000'),
(3143, '659003', '图木舒克市', '659000'),
(3144, '659004', '五家渠市', '659000');

-- --------------------------------------------------------

--
-- 表的结构 `china_cities`
--

CREATE TABLE `china_cities` (
  `id` int NOT NULL,
  `cityid` varchar(20) NOT NULL,
  `city` varchar(50) NOT NULL,
  `provinceid` varchar(20) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='行政区域地州市信息表';

--
-- 转存表中的数据 `china_cities`
--

INSERT INTO `china_cities` (`id`, `cityid`, `city`, `provinceid`) VALUES
(1, '110100', '市辖区', '110000'),
(2, '110200', '县', '110000'),
(3, '120100', '市辖区', '120000'),
(4, '120200', '县', '120000'),
(5, '130100', '石家庄市', '130000'),
(6, '130200', '唐山市', '130000'),
(7, '130300', '秦皇岛市', '130000'),
(8, '130400', '邯郸市', '130000'),
(9, '130500', '邢台市', '130000'),
(10, '130600', '保定市', '130000'),
(11, '130700', '张家口市', '130000'),
(12, '130800', '承德市', '130000'),
(13, '130900', '沧州市', '130000'),
(14, '131000', '廊坊市', '130000'),
(15, '131100', '衡水市', '130000'),
(16, '140100', '太原市', '140000'),
(17, '140200', '大同市', '140000'),
(18, '140300', '阳泉市', '140000'),
(19, '140400', '长治市', '140000'),
(20, '140500', '晋城市', '140000'),
(21, '140600', '朔州市', '140000'),
(22, '140700', '晋中市', '140000'),
(23, '140800', '运城市', '140000'),
(24, '140900', '忻州市', '140000'),
(25, '141000', '临汾市', '140000'),
(26, '141100', '吕梁市', '140000'),
(27, '150100', '呼和浩特市', '150000'),
(28, '150200', '包头市', '150000'),
(29, '150300', '乌海市', '150000'),
(30, '150400', '赤峰市', '150000'),
(31, '150500', '通辽市', '150000'),
(32, '150600', '鄂尔多斯市', '150000'),
(33, '150700', '呼伦贝尔市', '150000'),
(34, '150800', '巴彦淖尔市', '150000'),
(35, '150900', '乌兰察布市', '150000'),
(36, '152200', '兴安盟', '150000'),
(37, '152500', '锡林郭勒盟', '150000'),
(38, '152900', '阿拉善盟', '150000'),
(39, '210100', '沈阳市', '210000'),
(40, '210200', '大连市', '210000'),
(41, '210300', '鞍山市', '210000'),
(42, '210400', '抚顺市', '210000'),
(43, '210500', '本溪市', '210000'),
(44, '210600', '丹东市', '210000'),
(45, '210700', '锦州市', '210000'),
(46, '210800', '营口市', '210000'),
(47, '210900', '阜新市', '210000'),
(48, '211000', '辽阳市', '210000'),
(49, '211100', '盘锦市', '210000'),
(50, '211200', '铁岭市', '210000'),
(51, '211300', '朝阳市', '210000'),
(52, '211400', '葫芦岛市', '210000'),
(53, '220100', '长春市', '220000'),
(54, '220200', '吉林市', '220000'),
(55, '220300', '四平市', '220000'),
(56, '220400', '辽源市', '220000'),
(57, '220500', '通化市', '220000'),
(58, '220600', '白山市', '220000'),
(59, '220700', '松原市', '220000'),
(60, '220800', '白城市', '220000'),
(61, '222400', '延边朝鲜族自治州', '220000'),
(62, '230100', '哈尔滨市', '230000'),
(63, '230200', '齐齐哈尔市', '230000'),
(64, '230300', '鸡西市', '230000'),
(65, '230400', '鹤岗市', '230000'),
(66, '230500', '双鸭山市', '230000'),
(67, '230600', '大庆市', '230000'),
(68, '230700', '伊春市', '230000'),
(69, '230800', '佳木斯市', '230000'),
(70, '230900', '七台河市', '230000'),
(71, '231000', '牡丹江市', '230000'),
(72, '231100', '黑河市', '230000'),
(73, '231200', '绥化市', '230000'),
(74, '232700', '大兴安岭地区', '230000'),
(75, '310100', '市辖区', '310000'),
(76, '310200', '县', '310000'),
(77, '320100', '南京市', '320000'),
(78, '320200', '无锡市', '320000'),
(79, '320300', '徐州市', '320000'),
(80, '320400', '常州市', '320000'),
(81, '320500', '苏州市', '320000'),
(82, '320600', '南通市', '320000'),
(83, '320700', '连云港市', '320000'),
(84, '320800', '淮安市', '320000'),
(85, '320900', '盐城市', '320000'),
(86, '321000', '扬州市', '320000'),
(87, '321100', '镇江市', '320000'),
(88, '321200', '泰州市', '320000'),
(89, '321300', '宿迁市', '320000'),
(90, '330100', '杭州市', '330000'),
(91, '330200', '宁波市', '330000'),
(92, '330300', '温州市', '330000'),
(93, '330400', '嘉兴市', '330000'),
(94, '330500', '湖州市', '330000'),
(95, '330600', '绍兴市', '330000'),
(96, '330700', '金华市', '330000'),
(97, '330800', '衢州市', '330000'),
(98, '330900', '舟山市', '330000'),
(99, '331000', '台州市', '330000'),
(100, '331100', '丽水市', '330000'),
(101, '340100', '合肥市', '340000'),
(102, '340200', '芜湖市', '340000'),
(103, '340300', '蚌埠市', '340000'),
(104, '340400', '淮南市', '340000'),
(105, '340500', '马鞍山市', '340000'),
(106, '340600', '淮北市', '340000'),
(107, '340700', '铜陵市', '340000'),
(108, '340800', '安庆市', '340000'),
(109, '341000', '黄山市', '340000'),
(110, '341100', '滁州市', '340000'),
(111, '341200', '阜阳市', '340000'),
(112, '341300', '宿州市', '340000'),
(113, '341400', '巢湖市', '340000'),
(114, '341500', '六安市', '340000'),
(115, '341600', '亳州市', '340000'),
(116, '341700', '池州市', '340000'),
(117, '341800', '宣城市', '340000'),
(118, '350100', '福州市', '350000'),
(119, '350200', '厦门市', '350000'),
(120, '350300', '莆田市', '350000'),
(121, '350400', '三明市', '350000'),
(122, '350500', '泉州市', '350000'),
(123, '350600', '漳州市', '350000'),
(124, '350700', '南平市', '350000'),
(125, '350800', '龙岩市', '350000'),
(126, '350900', '宁德市', '350000'),
(127, '360100', '南昌市', '360000'),
(128, '360200', '景德镇市', '360000'),
(129, '360300', '萍乡市', '360000'),
(130, '360400', '九江市', '360000'),
(131, '360500', '新余市', '360000'),
(132, '360600', '鹰潭市', '360000'),
(133, '360700', '赣州市', '360000'),
(134, '360800', '吉安市', '360000'),
(135, '360900', '宜春市', '360000'),
(136, '361000', '抚州市', '360000'),
(137, '361100', '上饶市', '360000'),
(138, '370100', '济南市', '370000'),
(139, '370200', '青岛市', '370000'),
(140, '370300', '淄博市', '370000'),
(141, '370400', '枣庄市', '370000'),
(142, '370500', '东营市', '370000'),
(143, '370600', '烟台市', '370000'),
(144, '370700', '潍坊市', '370000'),
(145, '370800', '济宁市', '370000'),
(146, '370900', '泰安市', '370000'),
(147, '371000', '威海市', '370000'),
(148, '371100', '日照市', '370000'),
(149, '371200', '莱芜市', '370000'),
(150, '371300', '临沂市', '370000'),
(151, '371400', '德州市', '370000'),
(152, '371500', '聊城市', '370000'),
(153, '371600', '滨州市', '370000'),
(154, '371700', '荷泽市', '370000'),
(155, '410100', '郑州市', '410000'),
(156, '410200', '开封市', '410000'),
(157, '410300', '洛阳市', '410000'),
(158, '410400', '平顶山市', '410000'),
(159, '410500', '安阳市', '410000'),
(160, '410600', '鹤壁市', '410000'),
(161, '410700', '新乡市', '410000'),
(162, '410800', '焦作市', '410000'),
(163, '410900', '濮阳市', '410000'),
(164, '411000', '许昌市', '410000'),
(165, '411100', '漯河市', '410000'),
(166, '411200', '三门峡市', '410000'),
(167, '411300', '南阳市', '410000'),
(168, '411400', '商丘市', '410000'),
(169, '411500', '信阳市', '410000'),
(170, '411600', '周口市', '410000'),
(171, '411700', '驻马店市', '410000'),
(172, '420100', '武汉市', '420000'),
(173, '420200', '黄石市', '420000'),
(174, '420300', '十堰市', '420000'),
(175, '420500', '宜昌市', '420000'),
(176, '420600', '襄樊市', '420000'),
(177, '420700', '鄂州市', '420000'),
(178, '420800', '荆门市', '420000'),
(179, '420900', '孝感市', '420000'),
(180, '421000', '荆州市', '420000'),
(181, '421100', '黄冈市', '420000'),
(182, '421200', '咸宁市', '420000'),
(183, '421300', '随州市', '420000'),
(184, '422800', '恩施土家族苗族自治州', '420000'),
(185, '429000', '省直辖行政单位', '420000'),
(186, '430100', '长沙市', '430000'),
(187, '430200', '株洲市', '430000'),
(188, '430300', '湘潭市', '430000'),
(189, '430400', '衡阳市', '430000'),
(190, '430500', '邵阳市', '430000'),
(191, '430600', '岳阳市', '430000'),
(192, '430700', '常德市', '430000'),
(193, '430800', '张家界市', '430000'),
(194, '430900', '益阳市', '430000'),
(195, '431000', '郴州市', '430000'),
(196, '431100', '永州市', '430000'),
(197, '431200', '怀化市', '430000'),
(198, '431300', '娄底市', '430000'),
(199, '433100', '湘西土家族苗族自治州', '430000'),
(200, '440100', '广州市', '440000'),
(201, '440200', '韶关市', '440000'),
(202, '440300', '深圳市', '440000'),
(203, '440400', '珠海市', '440000'),
(204, '440500', '汕头市', '440000'),
(205, '440600', '佛山市', '440000'),
(206, '440700', '江门市', '440000'),
(207, '440800', '湛江市', '440000'),
(208, '440900', '茂名市', '440000'),
(209, '441200', '肇庆市', '440000'),
(210, '441300', '惠州市', '440000'),
(211, '441400', '梅州市', '440000'),
(212, '441500', '汕尾市', '440000'),
(213, '441600', '河源市', '440000'),
(214, '441700', '阳江市', '440000'),
(215, '441800', '清远市', '440000'),
(216, '441900', '东莞市', '440000'),
(217, '442000', '中山市', '440000'),
(218, '445100', '潮州市', '440000'),
(219, '445200', '揭阳市', '440000'),
(220, '445300', '云浮市', '440000'),
(221, '450100', '南宁市', '450000'),
(222, '450200', '柳州市', '450000'),
(223, '450300', '桂林市', '450000'),
(224, '450400', '梧州市', '450000'),
(225, '450500', '北海市', '450000'),
(226, '450600', '防城港市', '450000'),
(227, '450700', '钦州市', '450000'),
(228, '450800', '贵港市', '450000'),
(229, '450900', '玉林市', '450000'),
(230, '451000', '百色市', '450000'),
(231, '451100', '贺州市', '450000'),
(232, '451200', '河池市', '450000'),
(233, '451300', '来宾市', '450000'),
(234, '451400', '崇左市', '450000'),
(235, '460100', '海口市', '460000'),
(236, '460200', '三亚市', '460000'),
(237, '469000', '省直辖县级行政单位', '460000'),
(238, '500100', '市辖区', '500000'),
(239, '500200', '县', '500000'),
(240, '500300', '市', '500000'),
(241, '510100', '成都市', '510000'),
(242, '510300', '自贡市', '510000'),
(243, '510400', '攀枝花市', '510000'),
(244, '510500', '泸州市', '510000'),
(245, '510600', '德阳市', '510000'),
(246, '510700', '绵阳市', '510000'),
(247, '510800', '广元市', '510000'),
(248, '510900', '遂宁市', '510000'),
(249, '511000', '内江市', '510000'),
(250, '511100', '乐山市', '510000'),
(251, '511300', '南充市', '510000'),
(252, '511400', '眉山市', '510000'),
(253, '511500', '宜宾市', '510000'),
(254, '511600', '广安市', '510000'),
(255, '511700', '达州市', '510000'),
(256, '511800', '雅安市', '510000'),
(257, '511900', '巴中市', '510000'),
(258, '512000', '资阳市', '510000'),
(259, '513200', '阿坝藏族羌族自治州', '510000'),
(260, '513300', '甘孜藏族自治州', '510000'),
(261, '513400', '凉山彝族自治州', '510000'),
(262, '520100', '贵阳市', '520000'),
(263, '520200', '六盘水市', '520000'),
(264, '520300', '遵义市', '520000'),
(265, '520400', '安顺市', '520000'),
(266, '522200', '铜仁地区', '520000'),
(267, '522300', '黔西南布依族苗族自治州', '520000'),
(268, '522400', '毕节地区', '520000'),
(269, '522600', '黔东南苗族侗族自治州', '520000'),
(270, '522700', '黔南布依族苗族自治州', '520000'),
(271, '530100', '昆明市', '530000'),
(272, '530300', '曲靖市', '530000'),
(273, '530400', '玉溪市', '530000'),
(274, '530500', '保山市', '530000'),
(275, '530600', '昭通市', '530000'),
(276, '530700', '丽江市', '530000'),
(277, '530800', '思茅市', '530000'),
(278, '530900', '临沧市', '530000'),
(279, '532300', '楚雄彝族自治州', '530000'),
(280, '532500', '红河哈尼族彝族自治州', '530000'),
(281, '532600', '文山壮族苗族自治州', '530000'),
(282, '532800', '西双版纳傣族自治州', '530000'),
(283, '532900', '大理白族自治州', '530000'),
(284, '533100', '德宏傣族景颇族自治州', '530000'),
(285, '533300', '怒江傈僳族自治州', '530000'),
(286, '533400', '迪庆藏族自治州', '530000'),
(287, '540100', '拉萨市', '540000'),
(288, '542100', '昌都地区', '540000'),
(289, '542200', '山南地区', '540000'),
(290, '542300', '日喀则地区', '540000'),
(291, '542400', '那曲地区', '540000'),
(292, '542500', '阿里地区', '540000'),
(293, '542600', '林芝地区', '540000'),
(294, '610100', '西安市', '610000'),
(295, '610200', '铜川市', '610000'),
(296, '610300', '宝鸡市', '610000'),
(297, '610400', '咸阳市', '610000'),
(298, '610500', '渭南市', '610000'),
(299, '610600', '延安市', '610000'),
(300, '610700', '汉中市', '610000'),
(301, '610800', '榆林市', '610000'),
(302, '610900', '安康市', '610000'),
(303, '611000', '商洛市', '610000'),
(304, '620100', '兰州市', '620000'),
(305, '620200', '嘉峪关市', '620000'),
(306, '620300', '金昌市', '620000'),
(307, '620400', '白银市', '620000'),
(308, '620500', '天水市', '620000'),
(309, '620600', '武威市', '620000'),
(310, '620700', '张掖市', '620000'),
(311, '620800', '平凉市', '620000'),
(312, '620900', '酒泉市', '620000'),
(313, '621000', '庆阳市', '620000'),
(314, '621100', '定西市', '620000'),
(315, '621200', '陇南市', '620000'),
(316, '622900', '临夏回族自治州', '620000'),
(317, '623000', '甘南藏族自治州', '620000'),
(318, '630100', '西宁市', '630000'),
(319, '632100', '海东地区', '630000'),
(320, '632200', '海北藏族自治州', '630000'),
(321, '632300', '黄南藏族自治州', '630000'),
(322, '632500', '海南藏族自治州', '630000'),
(323, '632600', '果洛藏族自治州', '630000'),
(324, '632700', '玉树藏族自治州', '630000'),
(325, '632800', '海西蒙古族藏族自治州', '630000'),
(326, '640100', '银川市', '640000'),
(327, '640200', '石嘴山市', '640000'),
(328, '640300', '吴忠市', '640000'),
(329, '640400', '固原市', '640000'),
(330, '640500', '中卫市', '640000'),
(331, '650100', '乌鲁木齐市', '650000'),
(332, '650200', '克拉玛依市', '650000'),
(333, '652100', '吐鲁番地区', '650000'),
(334, '652200', '哈密地区', '650000'),
(335, '652300', '昌吉回族自治州', '650000'),
(336, '652700', '博尔塔拉蒙古自治州', '650000'),
(337, '652800', '巴音郭楞蒙古自治州', '650000'),
(338, '652900', '阿克苏地区', '650000'),
(339, '653000', '克孜勒苏柯尔克孜自治州', '650000'),
(340, '653100', '喀什地区', '650000'),
(341, '653200', '和田地区', '650000'),
(342, '654000', '伊犁哈萨克自治州', '650000'),
(343, '654200', '塔城地区', '650000'),
(344, '654300', '阿勒泰地区', '650000'),
(345, '659000', '省直辖行政单位', '650000');

-- --------------------------------------------------------

--
-- 表的结构 `china_provinces`
--

CREATE TABLE `china_provinces` (
  `id` int NOT NULL,
  `provinceid` varchar(20) NOT NULL,
  `province` varchar(50) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='省份信息表';

--
-- 转存表中的数据 `china_provinces`
--

INSERT INTO `china_provinces` (`id`, `provinceid`, `province`) VALUES
(1, '110000', '北京市'),
(2, '120000', '天津市'),
(3, '130000', '河北省'),
(4, '140000', '山西省'),
(5, '150000', '内蒙古自治区'),
(6, '210000', '辽宁省'),
(7, '220000', '吉林省'),
(8, '230000', '黑龙江省'),
(9, '310000', '上海市'),
(10, '320000', '江苏省'),
(11, '330000', '浙江省'),
(12, '340000', '安徽省'),
(13, '350000', '福建省'),
(14, '360000', '江西省'),
(15, '370000', '山东省'),
(16, '410000', '河南省'),
(17, '420000', '湖北省'),
(18, '430000', '湖南省'),
(19, '440000', '广东省'),
(20, '450000', '广西壮族自治区'),
(21, '460000', '海南省'),
(22, '500000', '重庆市'),
(23, '510000', '四川省'),
(24, '520000', '贵州省'),
(25, '530000', '云南省'),
(26, '540000', '西藏自治区'),
(27, '610000', '陕西省'),
(28, '620000', '甘肃省'),
(29, '630000', '青海省'),
(30, '640000', '宁夏回族自治区'),
(31, '650000', '新疆维吾尔自治区'),
(32, '710000', '台湾省'),
(33, '810000', '香港特别行政区'),
(34, '820000', '澳门特别行政区');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_affairs`
--

CREATE TABLE `commonly_affairs` (
  `id` int NOT NULL COMMENT 'id序号',
  `title` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '事务标题',
  `addDate` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '事务日期',
  `start_time` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '开始时间',
  `end_time` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '结束时间',
  `content` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '事务内容',
  `type` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '事务发送类型',
  `scope` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '事务发送范围',
  `object` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '事务发送对象',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='事务表';

--
-- 转存表中的数据 `commonly_affairs`
--

INSERT INTO `commonly_affairs` (`id`, `title`, `addDate`, `start_time`, `end_time`, `content`, `type`, `scope`, `object`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '今天中午我要吃三头牛', '1599926400000', '11:50', '12:30', 'This is a test affairs.', '0', '2', '2017217001', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599971088529'),
(2, '明天收班费', '1600012800000', '07:30', '08:00', '明天班长收集一下班费，每人500元', '1', '0', 'all', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599970057064'),
(3, '下午去一趟校长办公室', '1599926400000', '16:00', '16:30', '下午小心点，校长找你。', '1', '1', '2018218040', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599970141317'),
(4, '备课', '1600012800000', '08:20', '09:00', '预备好下午数学公开课的内容。', '0', '2', '2017217001', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600007626753');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_attendance_between`
--

CREATE TABLE `commonly_attendance_between` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '日期',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `attendance` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '出勤',
  `discipline` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '违纪',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_attendance_between`
--

INSERT INTO `commonly_attendance_between` (`id`, `student`, `class`, `date`, `semester`, `attendance`, `discipline`, `school`, `campus`, `department`, `created_user`, `addTime`) VALUES
(1, '2018218011', 'S0001_A_01_01_1901', '1591286400000', '192002', 'T10', '[\"T14\",\"T13\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591319984000'),
(2, '2017217041', 'S0001_A_01_01_1901', '1591286400000', '192002', 'T8', '[\"T14\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591319984000'),
(3, '2018218011', 'S0001_A_01_01_1901', '1591372800000', '192002', 'T8', '[\"T13\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591436180000'),
(4, '2017217041', 'S0001_A_01_01_1901', '1591372800000', '192002', 'T10', '[\"T14\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591436180000'),
(5, '2018218011', 'S0001_A_01_01_1901', '1591545600000', '192002', 'T8', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591617323000'),
(6, '2017217041', 'S0001_A_01_01_1901', '1591545600000', '192002', 'T8', '[\"T14\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591617323000'),
(7, '2018218011', 'S0001_A_01_01_1901', '1591632000000', '192002', 'T9', '[\"T13\",\"T14\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591668361000'),
(8, '2017217041', 'S0001_A_01_01_1901', '1591632000000', '192002', 'T8', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591668361000'),
(9, '2018218011', 'S0001_A_01_01_1901', '1591804800000', '192002', 'T12', '[\"T13\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836245000'),
(10, '2017217041', 'S0001_A_01_01_1901', '1591804800000', '192002', 'T9', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836245000'),
(11, '2018218041', 'S0001_A_01_01_1801', '1599408000000', '202101', 'T8', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599459158000'),
(12, '2018218040', 'S0001_A_01_01_1801', '1599408000000', '202101', 'T8', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599459158000'),
(13, '2018218041', 'S0001_A_01_01_1801', '1599494400000', '202101', 'T10', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599548517000'),
(14, '2018218040', 'S0001_A_01_01_1801', '1599494400000', '202101', 'T8', '[\"T14\",\"T13\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599548517000');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_attendance_course`
--

CREATE TABLE `commonly_attendance_course` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `session` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '节次',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '日期',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `attendance` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '出勤',
  `discipline` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '违纪',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_attendance_course`
--

INSERT INTO `commonly_attendance_course` (`id`, `student`, `class`, `session`, `date`, `semester`, `attendance`, `discipline`, `school`, `campus`, `department`, `created_user`, `addTime`) VALUES
(1, '2018218011', 'S0001_A_01_01_1901', 'ZX1', '1591200000000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591274420000'),
(2, '2017217041', 'S0001_A_01_01_1901', 'ZX1', '1591200000000', '192002', 'T1', '[\"T3\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591274420000'),
(3, '2018218011', 'S0001_A_01_01_1901', 'ZX1', '1591286400000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591326341000'),
(4, '2017217041', 'S0001_A_01_01_1901', 'ZX1', '1591286400000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591326341000'),
(5, '2018218011', 'S0001_A_01_01_1901', 'ZX2', '1591286400000', '192002', 'T2', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591326349000'),
(6, '2017217041', 'S0001_A_01_01_1901', 'ZX2', '1591286400000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591326349000'),
(7, '2018218011', 'S0001_A_01_01_1901', 'ZX1', '1591372800000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591436168000'),
(8, '2017217041', 'S0001_A_01_01_1901', 'ZX1', '1591372800000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591436168000'),
(9, '2018218011', 'S0001_A_01_01_1901', 'ZX1', '1591545600000', '192002', 'T1', '[\"T3\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591617313000'),
(10, '2017217041', 'S0001_A_01_01_1901', 'ZX1', '1591545600000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591617313000'),
(11, '2018218031', 'S0001_A_01_02_1901', 'ZX2', '1591545600000', '192002', 'T2', '[\"T3\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591617338000'),
(12, '2018218011', 'S0001_A_01_01_1901', 'ZX2', '1591632000000', '192002', 'T2', '[\"T3\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591668346000'),
(13, '2017217041', 'S0001_A_01_01_1901', 'ZX2', '1591632000000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591668346000'),
(14, '2018218011', 'S0001_A_01_01_1901', 'ZX1', '1591718400000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591749499000'),
(15, '2017217041', 'S0001_A_01_01_1901', 'ZX1', '1591718400000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591749499000'),
(16, '2018218031', 'S0001_A_01_02_1901', 'ZX1', '1591718400000', '192002', 'T1', '[\"T3\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591749516000'),
(17, '2018218011', 'S0001_A_01_01_1901', 'ZX2', '1591718400000', '192002', 'T1', '[\"T15\",\"T3\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591756413000'),
(18, '2017217041', 'S0001_A_01_01_1901', 'ZX2', '1591718400000', '192002', 'T4', '[\"T15\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591756413000'),
(19, '2018218011', 'S0001_A_01_01_1901', 'ZX1', '1591804800000', '192002', 'T2', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836232000'),
(20, '2017217041', 'S0001_A_01_01_1901', 'ZX1', '1591804800000', '192002', 'T2', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836232000'),
(21, '2018218019', 'S0001_A_01_02_1901', 'ZX1', '1591804800000', '192002', 'T1', '[\"T3\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836256000'),
(22, '2018218031', 'S0001_A_01_02_1901', 'ZX1', '1591804800000', '192002', 'T2', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836256000'),
(24, '2017217041', 'S0001_A_01_01_1901', 'ZX4', '1591804800000', '192002', 'T4', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591880642000'),
(25, '2018218041', 'S0001_A_01_01_1801', 'ZX2', '1599494400000', '202101', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599548497000'),
(26, '2018218040', 'S0001_A_01_01_1801', 'ZX2', '1599494400000', '202101', 'T2', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599548497000');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_attendance_early`
--

CREATE TABLE `commonly_attendance_early` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '时间',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `attendance` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '出勤',
  `discipline` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '违纪',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_attendance_early`
--

INSERT INTO `commonly_attendance_early` (`id`, `student`, `class`, `date`, `semester`, `attendance`, `discipline`, `school`, `campus`, `department`, `created_user`, `addTime`) VALUES
(1, '2018218011', 'S0001_A_01_01_1901', '1591286400000', '192002', 'T5', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591318439000'),
(2, '2017217041', 'S0001_A_01_01_1901', '1591286400000', '192002', 'T6', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591318439000'),
(3, '2018218011', 'S0001_A_01_01_1901', '1591372800000', '192002', 'T5', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591436173000'),
(4, '2017217041', 'S0001_A_01_01_1901', '1591372800000', '192002', 'T5', '[\"T7\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591436173000'),
(5, '2018218011', 'S0001_A_01_01_1901', '1591545600000', '192002', 'T5', '[\"T7\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591617318000'),
(6, '2017217041', 'S0001_A_01_01_1901', '1591545600000', '192002', 'T5', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591617318000'),
(7, '2018218011', 'S0001_A_01_01_1901', '1591632000000', '192002', 'T6', '[\"T7\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591668355000'),
(8, '2017217041', 'S0001_A_01_01_1901', '1591632000000', '192002', 'T5', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591668355000'),
(9, '2018218011', 'S0001_A_01_01_1901', '1591804800000', '192002', 'T5', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836237000'),
(10, '2017217041', 'S0001_A_01_01_1901', '1591804800000', '192002', 'T5', '[\"T7\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1591836237000'),
(11, '2018218041', 'S0001_A_01_01_1801', '1599494400000', '202101', 'T6', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599548502000'),
(12, '2018218040', 'S0001_A_01_01_1801', '1599494400000', '202101', 'T5', '[\"T7\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599548502000');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_health_blackboard`
--

CREATE TABLE `commonly_health_blackboard` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '日期',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `score` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '分数',
  `content` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '内容',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_health_blackboard`
--

INSERT INTO `commonly_health_blackboard` (`id`, `class`, `date`, `semester`, `score`, `content`, `department`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01_01_1901', '1591372800000', '192002', '10', '[{\"option_id\":\"S0001_A_H2_O4\",\"score\":\"6\"},{\"option_id\":\"S0001_A_H2_O1\",\"score\":\"4\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1591424331372'),
(2, 'S0001_A_01_02_1901', '1599494400000', '202101', '20', '[{\"option_id\":\"S0001_A_H2_O4\",\"score\":\"10\"},{\"option_id\":\"S0001_A_H2_O1\",\"score\":\"10\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1599548546407'),
(3, 'S0001_A_01_01_1801', '1599494400000', '202101', '16', '[{\"option_id\":\"S0001_A_H2_O4\",\"score\":\"8\"},{\"option_id\":\"S0001_A_H2_O1\",\"score\":\"8\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1599549188483');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_health_classroom`
--

CREATE TABLE `commonly_health_classroom` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '日期',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `score` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '分数',
  `content` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '内容',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_health_classroom`
--

INSERT INTO `commonly_health_classroom` (`id`, `class`, `date`, `semester`, `score`, `content`, `department`, `school`, `campus`, `created_user`, `addTime`) VALUES
(3, 'S0001_A_01_01_1901', '1591372800000', '192002', '16', '[{\"option_id\":\"S0001_A_H1_O2\",\"score\":\"8\"},{\"option_id\":\"S0001_A_H1_O1\",\"score\":\"8\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1591420510748'),
(4, 'S0001_A_01_02_1901', '1591372800000', '192002', '12', '[{\"option_id\":\"S0001_A_H1_O2\",\"score\":\"4\"},{\"option_id\":\"S0001_A_H1_O1\",\"score\":\"8\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1591420535015'),
(6, 'S0001_A_01_01_1901', '1591891200000', '192002', '16', '[{\"option_id\":\"S0001_A_H1_O2\",\"score\":\"8\"},{\"option_id\":\"S0001_A_H1_O1\",\"score\":\"8\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1591932411754'),
(7, 'S0001_A_01_01_1801', '1599494400000', '202101', '16', '[{\"option_id\":\"S0001_A_H1_O2\",\"score\":\"8\"},{\"option_id\":\"S0001_A_H1_O1\",\"score\":\"8\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1599549171584'),
(8, 'S0001_A_01_01_1901', '1599494400000', '202101', '14', '[{\"option_id\":\"S0001_A_H1_O2\",\"score\":\"4\"},{\"option_id\":\"S0001_A_H1_O1\",\"score\":\"10\"}]', 'S0001_A_01', 'S0001', 'S0001_A', '2017217001', '1599549182612');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_health_stuhealth`
--

CREATE TABLE `commonly_health_stuhealth` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '班级',
  `date` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '日期',
  `semester` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学期',
  `score` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '分数',
  `content` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '内容',
  `department` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '部门',
  `school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '校区',
  `created_user` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- --------------------------------------------------------

--
-- 表的结构 `commonly_homework`
--

CREATE TABLE `commonly_homework` (
  `id` int NOT NULL COMMENT 'id序号',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `title` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '作业标题',
  `course` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '课程',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `duration` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '作业时长',
  `end_date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '提交日期',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '作业类型',
  `content` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '作业内容',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_homework`
--

INSERT INTO `commonly_homework` (`id`, `semester`, `title`, `course`, `class`, `duration`, `end_date`, `type`, `content`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '192002', '解放黑人奴隶', 'S0001_A_01_01_C002', 'S0001_A_01_01_1901', '01:00', '1592928000000', '实操', '<p>请各位回家把三角贸易买来的黑奴解放！</p>', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1592913295244'),
(3, '202101', '背诵唐诗宋词1000首', 'S0001_A_01_01_C003', 'S0001_A_01_01_1801', '02:00', '1599753600000', '书面', '<p>请各位小朋友们于明天之前背完唐诗宋词1000首，老师明天抽查哦！~</p>', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599736111071'),
(5, '202101', '自主学习高数', 'S0001_A_01_01_C002', 'S0001_A_01_01_1901', '02:00', '1600704000000', '书面', '<p>19软件1班的同学们：</p><p>&nbsp;&nbsp;&nbsp;&nbsp;请各位同学进行自主学习，学习完高数内容并进行课后练习，老师将进行随机抽查，感谢配合。</p><p style=\"text-align: right;\">2020年9月22日</p><p style=\"text-align: right;\">周老师</p>', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600776682086');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_homework_register`
--

CREATE TABLE `commonly_homework_register` (
  `id` int NOT NULL COMMENT 'id序号',
  `homework` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '作业',
  `student` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '作业情况',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_homework_register`
--

INSERT INTO `commonly_homework_register` (`id`, `homework`, `student`, `state`, `semester`, `class`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '1', '2018218011', '1', '192002', 'S0001_A_01_01_1901', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1592960718000'),
(2, '1', '2017217041', '1', '192002', 'S0001_A_01_01_1901', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1592960718000');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_message`
--

CREATE TABLE `commonly_message` (
  `id` int NOT NULL COMMENT 'id序号',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `title` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '通知标题',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '通知对象',
  `target` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '通知范围',
  `aims` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '通知范围选项',
  `content` mediumtext CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '通知内容',
  `annex` varchar(30) COLLATE utf8_bin DEFAULT '0' COMMENT '附件id',
  `department` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_message`
--

INSERT INTO `commonly_message` (`id`, `semester`, `title`, `type`, `target`, `aims`, `content`, `annex`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '202101', '国庆放假通知', 'student', 'campus', 'S0001_A', '<p>祝全校学生国庆快乐！</p>', '2', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600617071479'),
(2, '202101', '中秋放假通知', 'student', 'department', 'S0001_A_01', '<p>祝信息部的孩子们中秋快乐</p>', '0', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600663015788'),
(3, '202101', '信息部所有人的假期通知', 'all', 'department', 'S0001_A_01', '<p>祝信息部的所有人中秋国庆佳节快乐！</p>', '0', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600675229711');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_message_annex`
--

CREATE TABLE `commonly_message_annex` (
  `id` int NOT NULL COMMENT 'id序号',
  `filename` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '文件名称',
  `campus` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_message_annex`
--

INSERT INTO `commonly_message_annex` (`id`, `filename`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'smartSchool-A1ABEA6B-02A1-38DC-4723-33F0FAEE4604-20200920234510.zip', 'S0001_A', 'S0001', '2017217001', '1600616710079'),
(2, 'smartSchool-32857921-BC19-BB54-AB4D-D6F29A5935E2-20200920235111.zip', 'S0001_A', 'S0001', '2017217001', '1600617071479');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_second_contest`
--

CREATE TABLE `commonly_second_contest` (
  `id` int NOT NULL COMMENT 'id序号',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `skill` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '专业',
  `teacher` varchar(30) COLLATE utf8_bin DEFAULT NULL COMMENT '教师',
  `should_num` tinyint NOT NULL DEFAULT '0' COMMENT '学生应到',
  `actually_num` tinyint NOT NULL DEFAULT '0' COMMENT '学生实到',
  `discipline` tinyint NOT NULL DEFAULT '0' COMMENT '纪律',
  `safety` tinyint NOT NULL DEFAULT '0' COMMENT '安全',
  `health` tinyint NOT NULL DEFAULT '0' COMMENT '卫生',
  `inspection` tinyint NOT NULL DEFAULT '0' COMMENT '校级督查',
  `other` tinyint NOT NULL DEFAULT '0' COMMENT '其它',
  `addDate` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '填写日期',
  `semester` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='大赛办督查表';

--
-- 转存表中的数据 `commonly_second_contest`
--

INSERT INTO `commonly_second_contest` (`id`, `department`, `skill`, `teacher`, `should_num`, `actually_num`, `discipline`, `safety`, `health`, `inspection`, `other`, `addDate`, `semester`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_02', 'SK5', '2017217040', 4, 3, 0, 0, 0, 0, 0, '1599840000000', '202101', 'S0001_A', 'S0001', '2017217001', '1599900136000'),
(2, 'S0001_A_02', 'SK6', '2017217040', 4, 4, 0, 0, 0, 0, 0, '1599840000000', '202101', 'S0001_A', 'S0001', '2017217001', '1599900136000'),
(3, 'S0001_A_01', 'SK1', '2017217042', 4, 4, 30, 30, 8, 5, 3, '1599840000000', '202101', 'S0001_A', 'S0001', '2017217001', '1599900136000'),
(4, 'S0001_A_01', 'SK2', '2017217001', 9, 9, 25, 30, 8, 18, 2, '1599840000000', '202101', 'S0001_A', 'S0001', '2017217001', '1599900136000'),
(5, 'S0001_A_01', 'SK3', '2017217042', 6, 5, 28, 28, 10, 28, 0, '1599840000000', '202101', 'S0001_A', 'S0001', '2017217001', '1599900136000'),
(6, 'S0001_A_01', 'SK4', '2017217001', 7, 6, 30, 30, 10, 10, 0, '1599840000000', '202101', 'S0001_A', 'S0001', '2017217001', '1599900136000');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_second_education`
--

CREATE TABLE `commonly_second_education` (
  `id` int NOT NULL COMMENT 'id序号',
  `department` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `teach` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '教学秩序',
  `teach_plus` tinyint NOT NULL DEFAULT '0' COMMENT '教学秩序加分',
  `teach_minus` tinyint NOT NULL DEFAULT '0' COMMENT '教学秩序减分',
  `teach_reason` tinytext COLLATE utf8_bin COMMENT '教学秩序扣分原因',
  `study` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '自习情况',
  `study_plus` tinyint NOT NULL DEFAULT '0' COMMENT '自习情况加分',
  `study_minus` tinyint NOT NULL DEFAULT '0' COMMENT '自习情况减分',
  `study_reason` tinytext COLLATE utf8_bin COMMENT '自习情况扣分原因',
  `health` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '教室卫生',
  `health_plus` tinyint NOT NULL DEFAULT '0' COMMENT '教室卫生加分',
  `health_minus` tinyint NOT NULL DEFAULT '0' COMMENT '教室卫生减分',
  `health_reason` tinytext COLLATE utf8_bin COMMENT '教室卫生扣分原因',
  `phone` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '手机管理',
  `phone_plus` tinyint NOT NULL DEFAULT '0' COMMENT '手机管理加分',
  `phone_minus` tinyint NOT NULL DEFAULT '0' COMMENT '手机管理减分',
  `phone_reason` tinytext COLLATE utf8_bin COMMENT '手机管理扣分原因',
  `inspection` tinytext COLLATE utf8_bin COMMENT '校级督查',
  `inspection_plus` tinyint NOT NULL DEFAULT '0' COMMENT '校级督查加分',
  `inspection_minus` tinyint NOT NULL DEFAULT '0' COMMENT '校级督查扣分',
  `inspection_reason` tinytext COLLATE utf8_bin COMMENT '扣分原因',
  `other` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '其它',
  `other_plus` tinyint NOT NULL DEFAULT '0' COMMENT '其它加分',
  `other_minus` tinyint NOT NULL DEFAULT '0' COMMENT '其它减分',
  `other_reason` tinytext COLLATE utf8_bin COMMENT '其它扣分原因',
  `addDate` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '填写日期',
  `semester` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `campus` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '添加时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='二级督查_政教处督查';

--
-- 转存表中的数据 `commonly_second_education`
--

INSERT INTO `commonly_second_education` (`id`, `department`, `teach`, `teach_plus`, `teach_minus`, `teach_reason`, `study`, `study_plus`, `study_minus`, `study_reason`, `health`, `health_plus`, `health_minus`, `health_reason`, `phone`, `phone_plus`, `phone_minus`, `phone_reason`, `inspection`, `inspection_plus`, `inspection_minus`, `inspection_reason`, `other`, `other_plus`, `other_minus`, `other_reason`, `addDate`, `semester`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_04', 'sgdfdf', 0, 0, NULL, NULL, 3, 0, NULL, '', 0, 0, 'sdg', NULL, 0, 0, NULL, '不错', 0, -10, '0', '', 9, 0, '0', '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599813434000'),
(2, 'S0001_A_03', NULL, 0, 0, NULL, NULL, 0, -10, NULL, '这次不行', 0, 0, NULL, NULL, 5, 0, 'sdfg', 'sgdf', 0, 0, '0', '', 0, 0, '0', '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599813434000'),
(3, 'S0001_A_02', '2', 0, 0, NULL, '2345', 0, -3, '2345', '', 0, 0, NULL, NULL, 0, 0, 'sdfg', 'sdfg', 0, 2, '0', '扣分', 0, 0, '0', '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599813434000'),
(4, 'S0001_A_01', '123', 0, 0, '123', NULL, 5, 0, NULL, '4124', 0, 0, '41', NULL, 0, 0, NULL, '123', 10, -20, '4', '下次加油', 0, 0, '23452', '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599813434000');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_second_political`
--

CREATE TABLE `commonly_second_political` (
  `id` int NOT NULL COMMENT 'id序号',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `health` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '卫生',
  `health_plus` tinyint NOT NULL DEFAULT '0' COMMENT '卫生加分',
  `health_minus` tinyint NOT NULL DEFAULT '0' COMMENT '卫生减分',
  `discipline` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '纪律',
  `discipline_plus` tinyint NOT NULL DEFAULT '0' COMMENT '纪律加分',
  `discipline_minus` tinyint NOT NULL DEFAULT '0' COMMENT '纪律减分',
  `exercises` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '两操',
  `exercises_plus` tinyint NOT NULL DEFAULT '0' COMMENT '两操加分',
  `exercises_minus` tinyint NOT NULL DEFAULT '0' COMMENT '两操减分',
  `inspection` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '校级督查',
  `inspection_plus` tinyint NOT NULL DEFAULT '0' COMMENT '校级督查加分',
  `inspection_minus` tinyint NOT NULL DEFAULT '0' COMMENT '校级督查减分',
  `other` tinytext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '其它',
  `other_plus` tinyint NOT NULL DEFAULT '0' COMMENT '其它加分',
  `other_minus` tinyint NOT NULL DEFAULT '0' COMMENT '其它减分',
  `addDate` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '填写日期',
  `semester` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '添加时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='二级督查_政教处督查';

--
-- 转存表中的数据 `commonly_second_political`
--

INSERT INTO `commonly_second_political` (`id`, `department`, `health`, `health_plus`, `health_minus`, `discipline`, `discipline_plus`, `discipline_minus`, `exercises`, `exercises_plus`, `exercises_minus`, `inspection`, `inspection_plus`, `inspection_minus`, `other`, `other_plus`, `other_minus`, `addDate`, `semester`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01', '', 0, 0, '还行', 0, -5, '', 0, -3, '不错', 0, 0, '', 0, 0, '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599800716000'),
(2, 'S0001_A_02', '这次不行', 0, 0, '', 0, 0, '下次加油', 0, -3, '', 0, 0, '', 0, 0, '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599800716000'),
(3, 'S0001_A_03', '', 0, 0, '不行', 0, -10, '', 0, 0, '', 0, 0, '扣分', 0, 0, '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599800716000'),
(4, 'S0001_A_04', '', 0, 0, '也就这样', 0, -2, '', 0, -3, '', 0, 0, '下次加油', 0, 0, '1599753600000', '202101', 'S0001_A', 'S0001', '2017217001', '1599800716000');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_second_practice`
--

CREATE TABLE `commonly_second_practice` (
  `id` int NOT NULL COMMENT 'id序号',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `place` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '实习间',
  `class` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '班级',
  `teacher` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '教师',
  `reason` tinytext COLLATE utf8_bin COMMENT '加减分说明',
  `attendance` tinyint NOT NULL DEFAULT '0' COMMENT '学生出勤',
  `orderly` tinyint NOT NULL DEFAULT '0' COMMENT '实训秩序',
  `phone` tinyint NOT NULL DEFAULT '0' COMMENT '手机使用',
  `health` tinyint NOT NULL DEFAULT '0' COMMENT '实训室卫生',
  `toilet` tinyint NOT NULL DEFAULT '0' COMMENT '厕所卫生',
  `inspection` tinyint NOT NULL DEFAULT '0' COMMENT '校级督查',
  `other` tinyint NOT NULL DEFAULT '0' COMMENT '其它',
  `addDate` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '填写日期',
  `semester` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='实习处督察表';

-- --------------------------------------------------------

--
-- 表的结构 `commonly_second_practice_place`
--

CREATE TABLE `commonly_second_practice_place` (
  `id` int NOT NULL COMMENT 'id序号',
  `place_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '实训id',
  `place_name` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '实训名称',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='实训地点表';

--
-- 转存表中的数据 `commonly_second_practice_place`
--

INSERT INTO `commonly_second_practice_place` (`id`, `place_id`, `place_name`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'P1', '机电一体化（东三楼）', 'S0001_A_01', 'S0001_A', 'S0001', '2017217042', '1599830039107'),
(2, 'P2', '计算机实训基地(办公楼二楼)', 'S0001_A_03', 'S0001_A', 'S0001', '2017217001', '1599831429110'),
(3, 'P3', '舞蹈室、琴房（办公楼一楼）', 'S0001_A_04', 'S0001_A', 'S0001', '2017217001', '1599831453728');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_second_skill`
--

CREATE TABLE `commonly_second_skill` (
  `id` int NOT NULL COMMENT 'id序号',
  `skill_id` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '专业编号',
  `skill_name` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '专业名称',
  `teacher` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '指导教师',
  `student_num` tinyint NOT NULL COMMENT '学生数量',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `schoool` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='大赛专业表';

--
-- 转存表中的数据 `commonly_second_skill`
--

INSERT INTO `commonly_second_skill` (`id`, `skill_id`, `skill_name`, `teacher`, `student_num`, `department`, `campus`, `schoool`, `created_user`, `addTime`) VALUES
(1, 'SK1', '动画制作', '王振运,胡乔生', 4, 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599894111435'),
(2, 'SK2', '网络搭建', '李增辉,胡乔生', 9, 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599894459385'),
(3, 'SK3', '工业产品设计', '董金龙', 6, 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599894473703'),
(4, 'SK4', '3D打印', '宿莲强,董金龙', 7, 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599894490679'),
(5, 'SK5', '会计手工', '高晓晓,董国红', 4, 'S0001_A_02', 'S0001_A', 'S0001', '2017217001', '1599894507177'),
(6, 'SK6', '会计电算化', '刘爱超,刘海明', 4, 'S0001_A_02', 'S0001_A', 'S0001', '2017217001', '1599894524801');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_week_dormitory`
--

CREATE TABLE `commonly_week_dormitory` (
  `id` int NOT NULL COMMENT 'id序号',
  `dormroom` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '宿舍',
  `build` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '宿舍楼',
  `dormitory` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '宿管',
  `week` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '周次',
  `semester` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学校',
  `should_num` mediumint NOT NULL COMMENT '应到人数',
  `real_num` mediumint NOT NULL COMMENT '实到人数',
  `thing_num` mediumint NOT NULL COMMENT '请假人数',
  `noback_num` mediumint NOT NULL COMMENT '未返校人数',
  `practice_num` mediumint NOT NULL COMMENT '实习人数',
  `leave_num` mediumint NOT NULL COMMENT '退学人数',
  `state` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '提报状态',
  `dep_state` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '部门审核状态',
  `office_state` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '政教处审核状态',
  `leader_state` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '领导审核状态',
  `remark` varchar(150) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '备注',
  `created_user` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_week_dormitory`
--

INSERT INTO `commonly_week_dormitory` (`id`, `dormroom`, `build`, `dormitory`, `week`, `semester`, `department`, `campus`, `school`, `should_num`, `real_num`, `thing_num`, `noback_num`, `practice_num`, `leave_num`, `state`, `dep_state`, `office_state`, `leader_state`, `remark`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_C_001', 'S0001_A_C', '2018181088', '18', '192002', 'S0001_A_01', 'S0001_A', 'S0001', 6, 2, 1, 1, 1, 1, '1', '0', '0', '0', '', '2017217001', '1592552196100'),
(2, 'S0001_A_C_002', 'S0001_A_C', '2017217038', '18', '192002', 'S0001_A_01', 'S0001_A', 'S0001', 6, 5, 1, 0, 0, 0, '0', '0', '0', '0', '', '2017217001', '1592552440690');

-- --------------------------------------------------------

--
-- 表的结构 `commonly_week_head_teacher`
--

CREATE TABLE `commonly_week_head_teacher` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `teacher` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '教师',
  `week` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '周次',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `should_num` mediumint NOT NULL COMMENT '应到人数',
  `real_num` mediumint NOT NULL COMMENT '实到人数',
  `thing_num` mediumint NOT NULL COMMENT '请假人数',
  `noback_num` mediumint NOT NULL COMMENT '未返校人数',
  `practice_num` mediumint NOT NULL COMMENT '实习人数',
  `leave_num` mediumint NOT NULL COMMENT '退学人数',
  `state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '提报状态',
  `dep_state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '部门审核状态',
  `office_state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '政教处审核状态',
  `leader_state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '领导审核状态',
  `remark` varchar(150) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '备注',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `commonly_week_head_teacher`
--

INSERT INTO `commonly_week_head_teacher` (`id`, `class`, `teacher`, `week`, `semester`, `department`, `campus`, `school`, `should_num`, `real_num`, `thing_num`, `noback_num`, `practice_num`, `leave_num`, `state`, `dep_state`, `office_state`, `leader_state`, `remark`, `created_user`, `addTime`) VALUES
(2, 'S0001_A_01_02_1901', '2017217001', '18', '192002', 'S0001_A_01', 'S0001_A', 'S0001', 50, 1, 0, 0, 0, 49, '1', '1', '1', '1', '', '2017217001', '1592527347722'),
(3, 'S0001_A_01_01_1901', '2017217001', '18', '192002', 'S0001_A_01', 'S0001_A', 'S0001', 50, 2, 0, 0, 48, 0, '0', '0', '0', '0', '', '2017217001', '1592529210476');

-- --------------------------------------------------------

--
-- 表的结构 `dormitory_attendance`
--

CREATE TABLE `dormitory_attendance` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学生',
  `dormroom` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '宿舍',
  `hour` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '时辰',
  `dormitory` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿管',
  `reg_date` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '日期',
  `semester` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学期',
  `attendance` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '出勤',
  `discipline` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '违纪',
  `school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '部门',
  `created_user` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `dormitory_attendance`
--

INSERT INTO `dormitory_attendance` (`id`, `student`, `dormroom`, `hour`, `dormitory`, `reg_date`, `semester`, `attendance`, `discipline`, `school`, `campus`, `department`, `created_user`, `addTime`) VALUES
(1, '2018218034', 'S0001_A_C_003', '早上', '2017217001', '1593532800000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593582958923'),
(2, '2018218033', 'S0001_A_C_003', '早上', '2017217001', '1593532800000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593582958923'),
(3, '2018218038', 'S0001_A_C_003', '早上', '2017217001', '1593532800000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593582958923'),
(13, '2018218034', 'S0001_A_C_003', '早上', '2017217001', '1593619200000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669540577'),
(14, '2018218033', 'S0001_A_C_003', '早上', '2017217001', '1593619200000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669540578'),
(15, '2018218038', 'S0001_A_C_003', '早上', '2017217001', '1593619200000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669540578'),
(16, '2018218034', 'S0001_A_C_003', '中午', '2017217001', '1593619200000', '192002', 'T2', '[\"T4\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669545631'),
(17, '2018218033', 'S0001_A_C_003', '中午', '2017217001', '1593619200000', '192002', 'T3', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669545631'),
(18, '2018218038', 'S0001_A_C_003', '中午', '2017217001', '1593619200000', '192002', 'T1', '[\"T4\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669545631'),
(19, '2018218034', 'S0001_A_C_003', '下午', '2017217001', '1593619200000', '192002', 'T1', '[\"T4\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669552077'),
(20, '2018218033', 'S0001_A_C_003', '下午', '2017217001', '1593619200000', '192002', 'T2', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669552077'),
(21, '2018218038', 'S0001_A_C_003', '下午', '2017217001', '1593619200000', '192002', 'T1', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593669552077'),
(22, '2018218034', 'S0001_A_C_003', '早上', '2017217001', '1593792000000', '192002', 'T1', '[\"T4\"]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593833026095'),
(23, '2018218033', 'S0001_A_C_003', '早上', '2017217001', '1593792000000', '192002', 'T3', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593833026095'),
(24, '2018218038', 'S0001_A_C_003', '早上', '2017217001', '1593792000000', '192002', 'T3', '[]', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1593833026095');

-- --------------------------------------------------------

--
-- 表的结构 `dormitory_attendance_option`
--

CREATE TABLE `dormitory_attendance_option` (
  `id` int NOT NULL COMMENT 'id序号',
  `option_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '选项id',
  `option_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '选项名称',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '类型',
  `score` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '分数',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '是否启用',
  `status` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '状态',
  `remark` varchar(150) COLLATE utf8_bin NOT NULL COMMENT '备注',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `dormitory_attendance_option`
--

INSERT INTO `dormitory_attendance_option` (`id`, `option_id`, `option_name`, `type`, `score`, `campus`, `school`, `state`, `status`, `remark`, `created_user`, `addTime`) VALUES
(1, 'T1', '出勤', 'attendance', '0', 'S0001_A', 'S0001', '1', '1', '', '2017217042', '1587608927000'),
(2, 'T2', '请假', 'attendance', '0', 'S0001_A', 'S0001', '1', '1', '', '2017217001', '1593517986070'),
(3, 'T3', '公假', 'attendance', '0', 'S0001_A', 'S0001', '1', '1', '', '2017217001', '1593518304228'),
(4, 'T4', '内务值日', 'discipline', '-1', 'S0001_A', 'S0001', '1', '1', '', '2017217001', '1593518316858');

-- --------------------------------------------------------

--
-- 表的结构 `dormitory_build`
--

CREATE TABLE `dormitory_build` (
  `id` int NOT NULL COMMENT 'id序号',
  `build_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿舍楼id',
  `build_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿舍楼名称',
  `build_floor_num` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿舍楼楼层数',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `department` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `type` varchar(16) COLLATE utf8_bin NOT NULL DEFAULT '学生宿舍' COMMENT '宿舍楼类型',
  `status` varchar(2) COLLATE utf8_bin NOT NULL COMMENT '宿舍楼状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `dormitory_build`
--

INSERT INTO `dormitory_build` (`id`, `build_id`, `build_name`, `build_floor_num`, `school`, `campus`, `department`, `type`, `status`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_A', '教职工一宿舍', '6', 'S0001', 'S0001_A', 'S0001_A_01', '教职工宿舍', '1', '2017217042', '1587608927000'),
(2, 'S0001_A_B', '教职工二宿舍', '6', 'S0001', 'S0001_A', 'S0001_A_01', '教职工宿舍', '1', '2017217042', '1588579143455'),
(3, 'S0001_A_C', '一栋宿舍', '6', 'S0001', 'S0001_A', 'S0001_A_01', '学生宿舍', '1', '2017217042', '1589248496732'),
(4, 'S0001_A_D', '二栋宿舍', '6', 'S0001', 'S0001_A', 'S0001_A_01', '学生宿舍', '1', '2017217001', '1590478368079');

-- --------------------------------------------------------

--
-- 表的结构 `dormitory_dormroom`
--

CREATE TABLE `dormitory_dormroom` (
  `id` int NOT NULL COMMENT 'id序号',
  `dormroom_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿舍房间id',
  `dormroom_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿舍房间号',
  `dormroom_bed_num` varchar(5) COLLATE utf8_bin NOT NULL COMMENT '房间床位数量',
  `build` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在宿舍楼',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `status` varchar(6) COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `dormitory_dormroom`
--

INSERT INTO `dormitory_dormroom` (`id`, `dormroom_id`, `dormroom_name`, `dormroom_bed_num`, `build`, `campus`, `school`, `status`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_A_001', 'T1101', '4', 'S0001_A_A', 'S0001_A', 'S0001', '1', '2017217042', '1587608927000'),
(2, 'S0001_A_A_002', 'T1102', '4', 'S0001_A_A', 'S0001_A', 'S0001', '1', '2017217042', '1589269006170'),
(3, 'S0001_A_C_001', '1101', '6', 'S0001_A_C', 'S0001_A', 'S0001', '1', '2017217001', '1590478493047'),
(4, 'S0001_A_C_002', '1102', '6', 'S0001_A_C', 'S0001_A', 'S0001', '1', '2017217001', '1590478499000'),
(5, 'S0001_A_D_001', '2101', '6', 'S0001_A_D', 'S0001_A', 'S0001', '1', '2017217001', '1590478505372'),
(7, 'S0001_A_C_003', '1103', '6', 'S0001_A_C', 'S0001_A', 'S0001', '1', '2017217001', '1592663332015'),
(8, 'S0001_A_C_004', '1104', '6', 'S0001_A_C', 'S0001_A', 'S0001', '1', '2017217001', '1592663332015');

-- --------------------------------------------------------

--
-- 表的结构 `dormitory_housemaster`
--

CREATE TABLE `dormitory_housemaster` (
  `id` int NOT NULL COMMENT 'id序号',
  `dormroom_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿舍id',
  `housemaster` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿管id',
  `build` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在宿舍楼',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `dormitory_housemaster`
--

INSERT INTO `dormitory_housemaster` (`id`, `dormroom_id`, `housemaster`, `build`, `campus`, `school`, `semester`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_C_001', '2018181088', 'S0001_A_C', 'S0001_A', 'S0001', '192002', '2017217042', '1587608927000'),
(2, 'S0001_A_C_002', '2017217038', 'S0001_A_C', 'S0001_A', 'S0001', '192002', '2017217042', '1589373754102');

-- --------------------------------------------------------

--
-- 表的结构 `dormitory_stu_arrangement`
--

CREATE TABLE `dormitory_stu_arrangement` (
  `id` int NOT NULL COMMENT 'id序号',
  `dormroom` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '宿舍',
  `student` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `build` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在宿舍楼',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在班级',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL,
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `dormitory_stu_arrangement`
--

INSERT INTO `dormitory_stu_arrangement` (`id`, `dormroom`, `student`, `semester`, `build`, `school`, `campus`, `department`, `class`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_C_001', '2018218011', '192002', 'S0001_A_C', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1901', '2017217042', '1587608927000'),
(3, 'S0001_A_C_003', '2018218038', '192002', 'S0001_A_C', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_02_1901', '2017217001', '1592718452136'),
(4, 'S0001_A_C_003', '2018218033', '192002', 'S0001_A_C', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_02_1901', '2017217001', '1592718452136'),
(5, 'S0001_A_C_003', '2018218034', '192002', 'S0001_A_C', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_02_1901', '2017217001', '1592718452136');

-- --------------------------------------------------------

--
-- 表的结构 `finance_revenue`
--

CREATE TABLE `finance_revenue` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '教师',
  `user_id` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '身份证',
  `job_wage` mediumint NOT NULL DEFAULT '0' COMMENT '岗位工资',
  `salary_wage` mediumint NOT NULL DEFAULT '0' COMMENT '薪级工资',
  `base_performance_wage` mediumint NOT NULL DEFAULT '0' COMMENT '基础绩效工资',
  `special_salary_wage` mediumint NOT NULL DEFAULT '0' COMMENT '特岗工资',
  `teacher_age_wage` mediumint NOT NULL DEFAULT '0' COMMENT '教护龄补贴',
  `house_wage` mediumint NOT NULL DEFAULT '0' COMMENT '住房补贴',
  `only_child_wage` mediumint NOT NULL DEFAULT '0' COMMENT '独生子女补贴',
  `one_day_donation` mediumint NOT NULL DEFAULT '0' COMMENT '一日捐',
  `pension_insurance` mediumint NOT NULL DEFAULT '0' COMMENT '养老保险金',
  `occupational_pension` mediumint NOT NULL DEFAULT '0' COMMENT '职业年金',
  `house_fund` mediumint NOT NULL DEFAULT '0' COMMENT '住房公积金',
  `unemployment_insurance` mediumint NOT NULL DEFAULT '0' COMMENT '失业保险金',
  `medical_insurance` mediumint NOT NULL DEFAULT '0' COMMENT '医疗保险金',
  `personal_income_tax` mediumint NOT NULL DEFAULT '0' COMMENT '个人所得税',
  `reward_performance_deduction` mediumint NOT NULL DEFAULT '0' COMMENT '奖励绩效扣除',
  `should_sum` mediumint NOT NULL DEFAULT '0' COMMENT '应发小计',
  `should_deduct` mediumint NOT NULL DEFAULT '0' COMMENT '应扣小计',
  `actual_sum` mediumint NOT NULL DEFAULT '0' COMMENT '实发金额',
  `bank_card` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '银行卡号',
  `file` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '对应文件',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- --------------------------------------------------------

--
-- 表的结构 `finance_upload`
--

CREATE TABLE `finance_upload` (
  `id` int NOT NULL COMMENT 'id序号',
  `filename` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '文件名',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- --------------------------------------------------------

--
-- 表的结构 `oa_allow`
--

CREATE TABLE `oa_allow` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '教师',
  `state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '是否允许',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `oa_allow`
--

INSERT INTO `oa_allow` (`id`, `teacher`, `state`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '2017217001', '1', 'S0001_A_01', 'S0001_A', 'S0001', '2017217042', '1587608927000'),
(2, '2017217042', '1', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1595049349000');

-- --------------------------------------------------------

--
-- 表的结构 `oa_approval_process`
--

CREATE TABLE `oa_approval_process` (
  `id` int NOT NULL COMMENT 'id序号',
  `approval_id` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '审批编号',
  `approval_name` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '审批名称',
  `approval_type` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '审批类别',
  `approvers` varchar(255) COLLATE utf8_bin DEFAULT '' COMMENT '审批人员',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `oa_approval_process`
--

INSERT INTO `oa_approval_process` (`id`, `approval_id`, `approval_name`, `approval_type`, `approvers`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_A0001', '部门负责人意见', '分部设置', '', 'S0001_A', 'S0001', '2017217001', '1595135374283'),
(2, 'S0001_A_A0002', '分管财务副部长意见', '统一设置', '[\"2017217001\",\"1233211234567\"]', 'S0001_A', 'S0001', '2017217001', '1595137799924');

-- --------------------------------------------------------

--
-- 表的结构 `oa_contain_option`
--

CREATE TABLE `oa_contain_option` (
  `id` int NOT NULL COMMENT 'id序号',
  `option_id` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '包含选项id',
  `option_name` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '包含选项名称',
  `campus` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='OA支出类型';

--
-- 转存表中的数据 `oa_contain_option`
--

INSERT INTO `oa_contain_option` (`id`, `option_id`, `option_name`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_O0001', '含采购', 'S0001_A', 'S0001', '2017217042', '1587608927000'),
(2, 'S0001_A_O0002', '含接待', 'S0001_A', 'S0001', '2017217001', '1594985186976');

-- --------------------------------------------------------

--
-- 表的结构 `oa_expenditure_type`
--

CREATE TABLE `oa_expenditure_type` (
  `id` int NOT NULL COMMENT 'id序号',
  `type_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '支出类型id',
  `type_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '支出类型名称',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='OA支出类型';

--
-- 转存表中的数据 `oa_expenditure_type`
--

INSERT INTO `oa_expenditure_type` (`id`, `type_id`, `type_name`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_0001', '采购', 'S0001_A', 'S0001', '2017217042', '1587608927000'),
(2, 'S0001_A_0002', '维修', 'S0001_A', 'S0001', '2017217001', '1594975025706'),
(3, 'S0001_A_0003', '考察', 'S0001_A', 'S0001', '2017217001', '1594976409936'),
(4, 'S0001_A_0004', '教学仪器', 'S0001_A', 'S0001', '2017217001', '1594976415308');

-- --------------------------------------------------------

--
-- 表的结构 `oa_form`
--

CREATE TABLE `oa_form` (
  `id` int NOT NULL COMMENT 'id序号',
  `form_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '表单编号',
  `form_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '表单名称',
  `title` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '表单标题',
  `alias` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '别名',
  `unit` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '单位',
  `authority` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '发起权限',
  `icon` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '图标',
  `content` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '表单提示',
  `process` varchar(255) COLLATE utf8_bin DEFAULT '' COMMENT '审批流程',
  `state` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '启用状态',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `oa_form`
--

INSERT INTO `oa_form` (`id`, `form_id`, `form_name`, `title`, `alias`, `unit`, `authority`, `icon`, `content`, `process`, `state`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_F0001', '支装饮用水', '深圳市某某某某技术学校支装饮用水申请表', '饮用水', '箱', '权限组', 'coffee', '请填写用水原因，默认单位为24支/箱。', '[\"S0001_A_A0002\",\"S0001_A_A0001\"]', '1', 'S0001_A', 'S0001', '2017217001', '1595171100361');

-- --------------------------------------------------------

--
-- 表的结构 `oa_form_process`
--

CREATE TABLE `oa_form_process` (
  `id` int NOT NULL COMMENT 'id序号',
  `form_id` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '表单',
  `approval_id` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '流程',
  `queue` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '顺序',
  `end` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '是否结束',
  `money` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '金额',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `oa_form_process`
--

INSERT INTO `oa_form_process` (`id`, `form_id`, `approval_id`, `queue`, `end`, `money`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_F0001', 'S0001_A_A0001', '1', '1', '5', 'S0001_A', 'S0001', '2017217001', '1595303765231'),
(2, 'S0001_A_F0001', 'S0001_A_A0002', '2', '1', '10', 'S0001_A', 'S0001', '2017217001', '1595303765231');

-- --------------------------------------------------------

--
-- 表的结构 `oa_organization`
--

CREATE TABLE `oa_organization` (
  `id` int NOT NULL COMMENT 'id序号',
  `organization_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '组织架构id',
  `organization_name` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '组织架构名称',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `sponsor` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '发起人',
  `department_responsible` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '部门负责人',
  `course_responsible` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '专业部课程负责人',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `oa_organization`
--

INSERT INTO `oa_organization` (`id`, `organization_id`, `organization_name`, `department`, `sponsor`, `department_responsible`, `course_responsible`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_G0001', '信息部', 'S0001_A_01', '[\"2017217001\"]', '[\"2017217001\"]', '[\"2017217001\"]', 'S0001_A', 'S0001', '2017217001', '1595120449203'),
(2, 'S0001_A_G0002', '财经部', 'S0001_A_02', '', '', '', 'S0001_A', 'S0001', '2017217001', '1595120469950'),
(3, 'S0001_A_G0003', '商贸部', 'S0001_A_03', '', '', '', 'S0001_A', 'S0001', '2017217001', '1595121648687');

-- --------------------------------------------------------

--
-- 表的结构 `property_asset`
--

CREATE TABLE `property_asset` (
  `id` int UNSIGNED NOT NULL COMMENT 'id序号',
  `asset_type` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '资产类别',
  `asset_name` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '资产名称',
  `asset_brand` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '资产品牌',
  `asset_model` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '资产规格型号',
  `buy_type` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '购买方式',
  `asset_id` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '资产编码',
  `unit` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '单位',
  `num` smallint UNSIGNED NOT NULL COMMENT '资产数量',
  `borrow_num` smallint UNSIGNED NOT NULL COMMENT '借用数量',
  `scrapped_num` smallint UNSIGNED NOT NULL COMMENT '报废数量',
  `single_price` double UNSIGNED NOT NULL COMMENT '资产单价',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '采购学期',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `property_asset`
--

INSERT INTO `property_asset` (`id`, `asset_type`, `asset_name`, `asset_brand`, `asset_model`, `buy_type`, `asset_id`, `unit`, `num`, `borrow_num`, `scrapped_num`, `single_price`, `school`, `campus`, `semester`, `created_user`, `addTime`) VALUES
(1, 'AS_001', '黑色简约办公桌', '宜家', '1.5宽*2.5长*1高，实木黑色', '调拨', 'BAZX-BGJJ-0001', '张', 5, 2, 1, 199.98, 'S0001', 'S0001_A', '192002', '2017217042', '1588149597361'),
(2, 'AS_002', '小霸王学习家教机', '小霸王', '小学人教版语文-黑白-点读版', '调拨', 'BAZX-ZSYGMSYDDX', '台', 10, 1, 1, 98.99, 'S0001', 'S0001_A', '192002', '2017217042', '1589935128874');

-- --------------------------------------------------------

--
-- 表的结构 `property_asset_type`
--

CREATE TABLE `property_asset_type` (
  `id` int NOT NULL COMMENT 'id序号',
  `type_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '资产类型id',
  `type_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '资产类型名称',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `property_asset_type`
--

INSERT INTO `property_asset_type` (`id`, `type_id`, `type_name`, `created_user`, `addTime`) VALUES
(1, 'AS_001', '办公家具', '2017217042', '1587608927000'),
(2, 'AS_002', '教学器材', '2017217042', '1587608927000'),
(3, 'AS_003', '图书文档', '2017217042', '1590037083392');

-- --------------------------------------------------------

--
-- 表的结构 `property_borrow`
--

CREATE TABLE `property_borrow` (
  `id` int NOT NULL COMMENT 'id序号',
  `asset_id` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '资产id',
  `get_type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '获取类型',
  `borrow_num` smallint NOT NULL COMMENT '获取数量',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `department` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `property_borrow`
--

INSERT INTO `property_borrow` (`id`, `asset_id`, `get_type`, `borrow_num`, `school`, `campus`, `department`, `semester`, `created_user`, `addTime`) VALUES
(1, 'BAZX-BGJJ-0001', '领用', 1, 'S0001', 'S0001_A', 'S0001_A_01', '192002', '2017217042', '1587608927000'),
(2, 'BAZX-ZSYGMSYDDX', '领用', 1, 'S0001', 'S0001_A', 'S0001_A_01', '192002', '2017217042', '1589951782646'),
(3, 'BAZX-BGJJ-0001', '领用', 1, 'S0001', 'S0001_A', 'S0001_A_01', '192002', '2017217042', '1589951849853');

-- --------------------------------------------------------

--
-- 表的结构 `property_scrapped`
--

CREATE TABLE `property_scrapped` (
  `id` int NOT NULL COMMENT 'id序号',
  `asset_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '资产id',
  `scrapped_type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '报废类型',
  `scrapped_num` smallint NOT NULL COMMENT '报废数量',
  `scrapped_store` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '存放位置',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `property_scrapped`
--

INSERT INTO `property_scrapped` (`id`, `asset_id`, `scrapped_type`, `scrapped_num`, `scrapped_store`, `semester`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'BAZX-BGJJ-0001', 'AC_001', 1, 'S0001_A_01', '192002', 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(4, 'BAZX-ZSYGMSYDDX', 'AC_001', 1, 'S0001_A_01', '192002', 'S0001', 'S0001_A', '2017217042', '1590023227806');

-- --------------------------------------------------------

--
-- 表的结构 `property_scrapped_type`
--

CREATE TABLE `property_scrapped_type` (
  `id` tinyint NOT NULL COMMENT 'id序号',
  `type_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '损坏类型id',
  `type_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '损坏类型名称',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `property_scrapped_type`
--

INSERT INTO `property_scrapped_type` (`id`, `type_id`, `type_name`, `created_user`, `addTime`) VALUES
(1, 'AC_001', '损坏', '2017217042', '1588149597361'),
(2, 'AC_002', '丢失', '2017217042', '1590038222753');

-- --------------------------------------------------------

--
-- 表的结构 `student_certificate`
--

CREATE TABLE `student_certificate` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `certificate_id` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '证书id',
  `certificate_type` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '证书类型',
  `certificate_img` varchar(50) COLLATE utf8_bin DEFAULT NULL COMMENT '证书图片',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `grade` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '年级',
  `department` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- --------------------------------------------------------

--
-- 表的结构 `student_certificate_type`
--

CREATE TABLE `student_certificate_type` (
  `id` int NOT NULL COMMENT 'id序号',
  `certificate_name` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '证书名称',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '证书类型',
  `lever` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '证书等级',
  `issue` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '颁发部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `student_certificate_type`
--

INSERT INTO `student_certificate_type` (`id`, `certificate_name`, `type`, `lever`, `issue`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '全国计算机一级证书（MS Office）', '通用', '初级', '教育部考证中心', 'S0001_A', 'S0001', '2017217001', '1595475826783');

-- --------------------------------------------------------

--
-- 表的结构 `student_info`
--

CREATE TABLE `student_info` (
  `id` int NOT NULL COMMENT 'id序号',
  `userid` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '学号',
  `username` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '姓名',
  `sex` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '性别',
  `nature` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '性格',
  `school` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '学校',
  `campus` varchar(25) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `grade` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '年级',
  `department` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '系部',
  `skill` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '专业',
  `class` varchar(25) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '班级',
  `address_province` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '居住地址(省)',
  `address_city` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '居住地址(市)',
  `address_area` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '居住地址(区)',
  `address_detailed` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '居住地址(详细)',
  `house_register_provinces` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '户籍所在省',
  `house_register_city` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '户籍所在市',
  `house_register_area` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '户籍所在区',
  `house_register_type` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '0' COMMENT '户籍类型',
  `phone_me` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '手机号码',
  `phone_home` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '家庭电话',
  `phone_parent` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '父母电话',
  `bornDate` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '出生日期',
  `nation` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '民族',
  `china_member` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '是否团员',
  `exam` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '中考分数',
  `job` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所属用户组',
  `type` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '当前状态',
  `parent_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '父（母）名称',
  `user_ID` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '身份证',
  `evaluation` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '自我评价',
  `msgSet` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '通知设置',
  `created_user` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='学生信息';

--
-- 转存表中的数据 `student_info`
--

INSERT INTO `student_info` (`id`, `userid`, `username`, `sex`, `nature`, `school`, `campus`, `grade`, `department`, `skill`, `class`, `address_province`, `address_city`, `address_area`, `address_detailed`, `house_register_provinces`, `house_register_city`, `house_register_area`, `house_register_type`, `phone_me`, `phone_home`, `phone_parent`, `bornDate`, `nation`, `china_member`, `exam`, `job`, `type`, `parent_name`, `user_ID`, `evaluation`, `msgSet`, `created_user`, `addTime`) VALUES
(1, '2017217041', '李某某', '男', '健壮,热心,帅气', 'S0001', 'S0001_A', '2019', 'S0001_A_01', 'S0001_A_01_01', 'S0001_A_01_01_1901', '370000', '370700', '370784', '新安街道大花园5栋32楼', '370000', '370700', '370784', '1', '13598987878', '12345678', '13512345678', '20020113', '汉', '1', '250', 'S1', 'T1', '李大某', '440300123400881234', '你好啊大家！！', '1,1', '2017217042', '1587608927000'),
(5, '2018218011', '许某某', '女', '', 'S0001', 'S0001_A', '2019', 'S0001_A_01', 'S0001_A_01_01', 'S0001_A_01_01_1901', '440000', '440300', '440306', '数组保安交警大队天桥下', '370000', '370700', '370784', '1', '13877665544', '12345678', '13800998877', '20200526', '汉', '0', '250', 'S1', 'T1', '许大某', '440188202005261234', '', '1,1', '2017217042', '1589621422284'),
(9, '2018218038', '潘小某', '女', '', 'S0001', 'S0001_A', '2019', 'S0001_A_01', 'S0001_A_01_02', 'S0001_A_01_02_1901', '150000', '150100', '150121', '流浪汉', '150000', '150100', '150121', '0', '18900001111', '61529898', '13777778888', '20200612', '维吾尔族', '0', '0', 'S1', 'T1', '潘大某', '4401002020061212341', '', '1,1', '2017217001', '1591933407705'),
(12, '2018218033', '梁某某', '女', '', 'S0001', 'S0001_A', '2019', 'S0001_A_01', 'S0001_A_01_02', 'S0001_A_01_02_1901', '440000', '440300', '440306', '保安交警大队天桥底下', '440000', '440300', '440306', '城市', '13577582588', '5118340', '12345678900', '', '壮族', '1', '', 'S1', 'T1', '梁大某', '330811201111223000', '', '1,1', '2017217001', '1592231011851'),
(13, '2018218034', '张某某', '男', '', 'S0001', 'S0001_A', '2019', 'S0001_A_01', 'S0001_A_01_02', 'S0001_A_01_02_1901', '440000', '440300', '440306', '保安交警大队天桥底下', '440000', '440300', '440306', '城市', '13551183400', '7758258', '13500008888', '20200615', '回族', '0', '1', 'S1', 'T1', '张大某', '330811201122224444', '', '1,1', '2017217001', '1592231011852'),
(14, '2018218040', '叶某某', '女', '', 'S0001', 'S0001_A', '2018', 'S0001_A_01', 'S0001_A_01_01', 'S0001_A_01_01_1801', '150000', '150100', '150101', '草原上', '150000', '150100', '150103', '0', '13512341355', '27727369', '13530112345', '20200904', '汉', '0', '0', 'S1', 'T1', '叶大某', '441511202009041234', '', '1,1', '2017217001', '1599189044280'),
(15, '2018218041', '许小某', '女', '', 'S0001', 'S0001_A', '2018', 'S0001_A_01', 'S0001_A_01_01', 'S0001_A_01_01_1801', '540000', '540100', '540122', '布达拉宫里', '540000', '540100', '540123', '0', '19999590987', '14167369', '13513513135', '20200903', '汉', '0', '12', 'S1', 'T1', '许大大', '331500202009032468', '', '1,1', '2017217001', '1599189392604');

-- --------------------------------------------------------

--
-- 表的结构 `student_placement`
--

CREATE TABLE `student_placement` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `class` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '班级',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `state` varchar(16) COLLATE utf8_bin NOT NULL DEFAULT '在校' COMMENT '班级情况',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `student_placement`
--

INSERT INTO `student_placement` (`id`, `student`, `class`, `semester`, `department`, `campus`, `school`, `state`, `created_user`, `addTime`) VALUES
(8, '2017217041', 'S0001_A_01_01_1901', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '在校', '2017217001', '1592805199680'),
(9, '2018218038', 'S0001_A_01_02_1901', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '在校', '2017217001', '1592807341630'),
(10, '2018218033', 'S0001_A_01_02_1901', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '在校', '2017217001', '1592807341630'),
(11, '2018218034', 'S0001_A_01_02_1901', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '在校', '2017217001', '1592807341630'),
(12, '2018218011', 'S0001_A_01_01_1901', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '在校', '2017217001', '1592807544695');

-- --------------------------------------------------------

--
-- 表的结构 `student_reward_type`
--

CREATE TABLE `student_reward_type` (
  `id` int NOT NULL COMMENT 'id序号',
  `reward_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '奖惩编码',
  `reward_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '奖惩名称',
  `type` varchar(16) COLLATE utf8_bin NOT NULL DEFAULT 'good' COMMENT '奖惩类型',
  `reward_score` tinyint NOT NULL COMMENT '奖惩分数',
  `school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `student_reward_type`
--

INSERT INTO `student_reward_type` (`id`, `reward_id`, `reward_name`, `type`, `reward_score`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'R1', '好人好事', '0', 1, 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(2, 'R2', '口吐芬芳', '1', -2, 'S0001', 'S0001_A', '2017217042', '1588579143455'),
(3, 'R3', '月全勤', '0', 5, 'S0001', 'S0001_A', '2017217042', '1588836743096'),
(4, 'R4', '志愿者', '0', 1, 'S0001', 'S0001_A', '2017217001', '1599633809601');

-- --------------------------------------------------------

--
-- 表的结构 `student_school_status`
--

CREATE TABLE `student_school_status` (
  `id` int NOT NULL COMMENT 'id序号',
  `status_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '状态id',
  `status_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '状态名称',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `student_school_status`
--

INSERT INTO `student_school_status` (`id`, `status_id`, `status_name`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'T1', '在读', 'S0001', 'S0001_A', '2017217042', '1588149597361'),
(2, 'T2', '毕业', 'S0001', 'S0001_A', '2017217042', '1587960415000');

-- --------------------------------------------------------

--
-- 表的结构 `stuset_attendance_option`
--

CREATE TABLE `stuset_attendance_option` (
  `id` int NOT NULL COMMENT 'id序号',
  `option_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '选项id',
  `option_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '选项名称',
  `model` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在模块',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '类型',
  `score` tinyint NOT NULL DEFAULT '0' COMMENT '分值',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `state` varchar(6) COLLATE utf8_bin NOT NULL COMMENT '状况',
  `status` varchar(6) COLLATE utf8_bin NOT NULL COMMENT '状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `stuset_attendance_option`
--

INSERT INTO `stuset_attendance_option` (`id`, `option_id`, `option_name`, `model`, `type`, `score`, `school`, `campus`, `state`, `status`, `created_user`, `addTime`) VALUES
(1, 'T1', '出勤', '课堂登记', 'attendance', 0, 'S0001', 'S0001_A', '1', '1', '2017217042', '1587608927000'),
(2, 'T2', '旷课', '课堂登记', 'attendance', -1, 'S0001', 'S0001_A', '1', '1', '2017217042', '1588579143455'),
(3, 'T3', '玩手机', '课堂登记', 'discipline', -1, 'S0001', 'S0001_A', '1', '1', '2017217042', '1587608927000'),
(4, 'T4', '病假', '课堂登记', 'attendance', 0, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591151445129'),
(5, 'T5', '出勤', '早段登记', 'attendance', 0, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591317570244'),
(6, 'T6', '旷操', '早段登记', 'attendance', -1, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591317581748'),
(7, 'T7', '未穿校服', '早段登记', 'discipline', -1, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591317595857'),
(8, 'T8', '出勤', '课间操登记', 'attendance', 0, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591318721917'),
(9, 'T9', '旷操', '课间操登记', 'attendance', -1, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591318733390'),
(10, 'T10', '公假', '课间操登记', 'attendance', 0, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591318745391'),
(11, 'T11', '事假', '课间操登记', 'attendance', 0, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591318752632'),
(12, 'T12', '病假', '课间操登记', 'attendance', 0, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591318760353'),
(13, 'T13', '讲话', '课间操登记', 'discipline', -1, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591318773189'),
(14, 'T14', '玩手机', '课间操登记', 'discipline', -1, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591318780668'),
(15, 'T15', '睡觉', '课堂登记', 'discipline', -1, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591756361252'),
(16, 'T16', '发热发烧', '课堂登记', 'discipline', -1, 'S0001', 'S0001_A', '1', '1', '2017217001', '1591974634705');

-- --------------------------------------------------------

--
-- 表的结构 `stuset_health_model`
--

CREATE TABLE `stuset_health_model` (
  `id` int NOT NULL COMMENT 'id序号',
  `health_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '卫生id',
  `health_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '卫生名称',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL,
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `stuset_health_model`
--

INSERT INTO `stuset_health_model` (`id`, `health_id`, `health_name`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_H1', '教室卫生登记', 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(2, 'S0001_A_H2', '黑板报登记', 'S0001', 'S0001_A', '2017217001', '1591160971325');

-- --------------------------------------------------------

--
-- 表的结构 `stuset_health_option`
--

CREATE TABLE `stuset_health_option` (
  `id` int NOT NULL COMMENT 'id序号',
  `option_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '项目id',
  `option_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '项目名称',
  `model` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在模块',
  `remark` varchar(100) COLLATE utf8_bin DEFAULT NULL COMMENT '备注',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `stuset_health_option`
--

INSERT INTO `stuset_health_option` (`id`, `option_id`, `option_name`, `model`, `remark`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_H1_O1', '讲台', 'S0001_A_H1', '', 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(2, 'S0001_A_H1_O2', '黑板,电视', 'S0001_A_H1', NULL, 'S0001', 'S0001_A', '2017217042', '1588579143455'),
(3, 'S0001_A_H2_O1', '色彩', 'S0001_A_H2', '', 'S0001', 'S0001_A', '2017217001', '1591415310076'),
(4, 'S0001_A_H2_O4', '内容', 'S0001_A_H2', '', 'S0001', 'S0001_A', '2017217001', '1591415315776'),
(5, 'S0001_A_H3_O1', '体温', 'S0001_A_H3', '', 'S0001', 'S0001_A', '2017217001', '1591973557701'),
(6, 'S0001_A_H3_O6', '不适', 'S0001_A_H3', '', 'S0001', 'S0001_A', '2017217001', '1591973578629');

-- --------------------------------------------------------

--
-- 表的结构 `stuset_health_option_list`
--

CREATE TABLE `stuset_health_option_list` (
  `id` int NOT NULL COMMENT 'id序号',
  `option_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在项目',
  `name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '名称',
  `score` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '分数',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `stuset_health_option_list`
--

INSERT INTO `stuset_health_option_list` (`id`, `option_id`, `name`, `score`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_H1_O1', '一尘不染', '10', 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(2, 'S0001_A_H1_O1', '摆放不齐', '8', 'S0001', 'S0001_A', '2017217001', '1591231419508'),
(3, 'S0001_A_H2_O1', '色彩鲜艳', '8', 'S0001', 'S0001_A', '2017217001', '1591415334651'),
(4, 'S0001_A_H2_O1', '色彩丰富', '6', 'S0001', 'S0001_A', '2017217001', '1591415360584'),
(5, 'S0001_A_H2_O1', '配色完美', '10', 'S0001', 'S0001_A', '2017217001', '1591415469352'),
(6, 'S0001_A_H2_O1', '色彩一般', '4', 'S0001', 'S0001_A', '2017217001', '1591415477133'),
(7, 'S0001_A_H2_O4', '内容丰富', '10', 'S0001', 'S0001_A', '2017217001', '1591415516872'),
(8, 'S0001_A_H2_O4', '主题明确', '8', 'S0001', 'S0001_A', '2017217001', '1591415526642'),
(9, 'S0001_A_H2_O4', '内容合理', '6', 'S0001', 'S0001_A', '2017217001', '1591415543176'),
(10, 'S0001_A_H2_O4', '内容一般', '4', 'S0001', 'S0001_A', '2017217001', '1591415550747'),
(11, 'S0001_A_H1_O2', '整洁无污', '10', 'S0001', 'S0001_A', '2017217001', '1591415738902'),
(12, 'S0001_A_H1_O2', '带有灰尘', '8', 'S0001', 'S0001_A', '2017217001', '1591415756012'),
(13, 'S0001_A_H1_O2', '带有污渍', '6', 'S0001', 'S0001_A', '2017217001', '1591415774979'),
(14, 'S0001_A_H1_O2', '无清理', '4', 'S0001', 'S0001_A', '2017217001', '1591415787280'),
(15, 'S0001_A_H3_O1', '体温正常', '10', 'S0001', 'S0001_A', '2017217001', '1591973600418'),
(16, 'S0001_A_H3_O1', '发热', '0', 'S0001', 'S0001_A', '2017217001', '1591973610456'),
(17, 'S0001_A_H3_O6', '无不适', '10', 'S0001', 'S0001_A', '2017217001', '1591973628428'),
(18, 'S0001_A_H3_O6', '干咳乏力', '8', 'S0001', 'S0001_A', '2017217001', '1591973695622'),
(19, 'S0001_A_H3_O6', '头晕恶心', '6', 'S0001', 'S0001_A', '2017217001', '1591973708736'),
(20, 'S0001_A_H3_O6', '发热昏迷', '4', 'S0001', 'S0001_A', '2017217001', '1591973725612');

-- --------------------------------------------------------

--
-- 表的结构 `stuset_imp_score`
--

CREATE TABLE `stuset_imp_score` (
  `id` int NOT NULL COMMENT 'id序号',
  `title` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '文件标题',
  `semester` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `stuset_imp_score`
--

INSERT INTO `stuset_imp_score` (`id`, `title`, `semester`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(6, '学生成绩导入模板.xlsx', '202101', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600161487348');

-- --------------------------------------------------------

--
-- 表的结构 `stuset_reward`
--

CREATE TABLE `stuset_reward` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '奖惩类型',
  `reward` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '奖惩项目',
  `score` tinyint NOT NULL COMMENT '奖惩分数',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学生班级',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='学生奖惩记录';

--
-- 转存表中的数据 `stuset_reward`
--

INSERT INTO `stuset_reward` (`id`, `student`, `type`, `reward`, `score`, `semester`, `class`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '2017217041', '0', 'R1', 1, '202101', 'S0001_A_01_01_1901', 'S0001_A_01', 'S0001_A', 'S0001', '2017217040', '1599708922842'),
(9, '2018218041', '1', 'R2', -2, '202101', 'S0001_A_01_01_1801', 'S0001_A_01', 'S0001_A', 'S0001', '2017217040', '1599658307000'),
(10, '2018218040', '0', 'R4', 1, '202101', 'S0001_A_01_01_1801', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599580800000'),
(11, '2018218040', '0', 'R1', 1, '202101', 'S0001_A_01_01_1801', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599719735483'),
(16, '2018218040', '0', 'R4', 1, '202101', 'S0001_A_01_01_1801', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599667200000');

-- --------------------------------------------------------

--
-- 表的结构 `stuset_student_score`
--

CREATE TABLE `stuset_student_score` (
  `id` int NOT NULL COMMENT 'id序号',
  `student` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学生',
  `course` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '科目',
  `score` varchar(16) COLLATE utf8_bin NOT NULL DEFAULT '0' COMMENT '分数',
  `rank` varchar(16) COLLATE utf8_bin NOT NULL DEFAULT '0' COMMENT '排名',
  `imp_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '导入文件id',
  `semester` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='学生成绩表';

--
-- 转存表中的数据 `stuset_student_score`
--

INSERT INTO `stuset_student_score` (`id`, `student`, `course`, `score`, `rank`, `imp_id`, `semester`, `class`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(8, '2018218040', 'S0001_A_01_01_C003', '76', '32', '6', '202101', 'S0001_A_01_01_1801', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600161486093'),
(9, '2018218041', 'S0001_A_01_01_C003', '70', '33', '6', '202101', 'S0001_A_01_01_1801', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600161486093');

-- --------------------------------------------------------

--
-- 表的结构 `system_authority`
--

CREATE TABLE `system_authority` (
  `id` tinyint NOT NULL COMMENT 'id序号',
  `authority_id` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '权限组id标识',
  `authority_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '权限组名称',
  `authority_range` text CHARACTER SET utf8 COLLATE utf8_bin COMMENT '所有权限',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `status` varchar(6) COLLATE utf8_bin NOT NULL DEFAULT '1' COMMENT '状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `system_authority`
--

INSERT INTO `system_authority` (`id`, `authority_id`, `authority_name`, `authority_range`, `school`, `campus`, `status`, `created_user`, `addTime`) VALUES
(1, 'D1', 'super_admin', '[{\"id\":\"1001\",\"child\":[\"10015\",\"10011\",\"10013\",\"10014\",\"10012\",\"10016\",\"10017\",\"10018\",\"10019\"]},{\"id\":\"1000\",\"child\":[\"10001\",\"10002\",\"10003\",\"10004\",\"10005\",\"10006\",\"10007\",\"10008\"]},{\"id\":\"1002\",\"child\":[\"10021\",\"10022\",\"10023\",\"10024\"]},{\"id\":\"1003\",\"child\":[\"10031\",\"10032\"]},{\"id\":\"1005\",\"child\":[\"10051\",\"10053\",\"10054\",\"10055\"]},{\"id\":\"1007\",\"child\":[\"10071\",\"10074\",\"10073\",\"10075\",\"10072\",\"10076\",\"10077\"]},{\"id\":\"1006\",\"child\":[\"10061\",\"10062\",\"10063\",\"10064\",\"10065\"]},{\"id\":\"1004\",\"child\":[\"10041\",\"10042\",\"10043\",\"10044\",\"10045\"]},{\"id\":\"1008\",\"child\":[\"10081\",\"10082\",\"10083\",\"10084\",\"10085\",\"10086\",\"10087\",\"10088\",\"10089\",\"100810\",\"100811\",\"100812\"]},{\"id\":\"1009\",\"child\":[\"10091\",\"10093\",\"10092\",\"10094\"]}]', 'S0001', 'S0001_A', '1', '2017217042', '1587608927000'),
(2, 'S1', '学生', '', 'S0001', 'S0001_A', '1', '2017217042', '1588579143455'),
(3, 'T3', '宿管', '[{\"id\":\"1000\",\"child\":[\"10001\",\"10002\",\"10003\",\"10004\"]},{\"id\":\"1002\",\"child\":[\"10021\",\"10022\",\"10023\",\"10024\"]}]', 'S0001', 'S0001_A', '1', '2017217042', '1589271638897'),
(4, 'T1', '教师', '[]', 'S0001', 'S0001_A', '1', '2017217042', '1589288027463'),
(5, 'T2', '教务', '[{\"id\":\"1001\",\"child\":[\"10015\",\"10011\",\"10013\",\"10014\",\"10012\",\"10016\",\"10017\",\"10018\"]},{\"id\":\"1000\",\"child\":[\"10001\",\"10002\",\"10003\",\"10004\"]},{\"id\":\"1002\",\"child\":[\"10021\",\"10022\",\"10023\",\"10024\"]}]', 'S0001', 'S0001_A', '1', '2017217042', '1589290950727'),
(6, 'T10', '超级教师', '[{\"id\":\"1001\",\"child\":[\"10015\",\"10011\",\"10013\",\"10014\",\"10012\",\"10016\",\"10017\",\"10018\",\"10019\"]},{\"id\":\"1000\",\"child\":[\"10001\",\"10002\",\"10003\",\"10004\",\"10005\",\"10006\",\"10007\",\"10008\"]},{\"id\":\"1002\",\"child\":[\"10021\",\"10022\",\"10023\",\"10024\"]},{\"id\":\"1003\",\"child\":[\"10031\",\"10032\"]},{\"id\":\"1005\",\"child\":[\"10051\",\"10053\",\"10054\",\"10055\"]},{\"id\":\"1007\",\"child\":[\"10071\",\"10074\",\"10073\",\"10075\",\"10072\",\"10076\",\"10077\"]},{\"id\":\"1006\",\"child\":[\"10061\",\"10062\",\"10063\",\"10064\",\"10065\"]},{\"id\":\"1004\",\"child\":[\"10041\",\"10042\",\"10043\",\"10044\",\"10045\"]},{\"id\":\"1008\",\"child\":[\"10081\",\"10082\",\"10083\",\"10084\",\"10085\",\"10086\",\"10087\",\"10088\",\"10089\",\"100810\",\"100811\",\"100812\"]},{\"id\":\"1009\",\"child\":[\"10091\",\"10093\",\"10092\",\"10094\"]}]', 'S0001', 'S0001_A', '1', '2017217042', '1590111945703');

-- --------------------------------------------------------

--
-- 表的结构 `system_log`
--

CREATE TABLE `system_log` (
  `id` int NOT NULL COMMENT 'id序号',
  `log_content` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '日志内容',
  `log_type` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '日志类型',
  `log_model` varchar(150) COLLATE utf8_bin NOT NULL COMMENT '所在功能',
  `log_ip` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '访问ip地址',
  `log_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '操作用户',
  `log_area` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '地址',
  `log_brower` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '浏览器',
  `addTime` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `system_log`
--

INSERT INTO `system_log` (`id`, `log_content`, `log_type`, `log_model`, `log_ip`, `log_user`, `log_area`, `log_brower`, `addTime`) VALUES
(1, '学生登录', '登录记录', '登录模块', '120.229.32.135', '2017217042', 'CHINA', 'chrome', '1588906096289'),
(2, '学生登录', '登录记录', '登录模块', '120.229.32.135', '2017217042', 'CHINA', 'chrome', '1588989200290'),
(3, '学生登录', '登录记录', '登录模块', '113.110.165.81', '2017217042', '广东省深圳市', 'chrome', '1589035125378'),
(4, '学生登录', '登录记录', '登录模块', '120.229.32.251', '2017217042', 'CHINA', 'chrome', '1589079824789'),
(5, '教师登录', '登录记录', '登录模块', '120.229.32.251', '2017217041', 'CHINA', 'chrome', '1589091347106'),
(6, '学生登录', '登录记录', '登录模块', '120.229.32.251', '2017217042', 'CHINA', 'chrome', '1589091412815'),
(7, '学生登录', '登录记录', '登录模块', '120.229.32.251', '2017217042', 'CHINA', 'chrome', '1589160374940'),
(8, '学生登录', '登录记录', '登录模块', '113.110.164.60', '2017217042', '广东省深圳市', 'chrome', '1589206113133'),
(9, '学生登录', '登录记录', '登录模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1589262280626'),
(10, '学生登录', '登录记录', '登录模块', '58.251.35.254', '2017217038', '广东省深圳市', 'chrome', '1589271779233'),
(11, '学生登录', '登录记录', '登录模块', '58.251.35.254', '2017217042', '广东省深圳市', 'chrome', '1589271815120'),
(12, '学生登录', '登录记录', '登录模块', '58.251.35.254', '2017217042', '广东省深圳市', 'chrome', '1589336392656'),
(13, '学生登录', '登录记录', '登录模块', '113.110.164.99', '2017217042', '广东省深圳市', 'chrome', '1589373380083'),
(14, '教师登录', '登录记录', '登录模块', '', '2017217041', '', 'chrome', '1589423381198'),
(15, '学生登录', '登录记录', '登录模块', '', '2017217041', '', 'chrome', '1589424300512'),
(16, '教师登录', '登录记录', '登录模块', '52.229.159.191', '2017217041', 'UNITED STATES', 'chrome', '1589447297249'),
(17, '学生登录', '登录记录', '登录模块', '52.229.159.191', '2017217041', 'UNITED STATES', 'chrome', '1589447933639'),
(18, '学生登录', '登录记录', '登录模块', '120.229.32.68', '2017217042', 'CHINA', 'chrome', '1589513782169'),
(19, '学生登录', '登录记录', '登录模块', '120.229.32.68', '2017217042', 'CHINA', 'chrome', '1589526718865'),
(20, '学生登录', '登录记录', '登录模块', '113.110.166.106', '2017217042', '广东省深圳市', 'chrome', '1589549931745'),
(21, '学生登录', '登录记录', '登录模块', '113.110.166.106', '2017217042', '广东省深圳市', 'chrome', '1589549975102'),
(22, '管理员登录', '登录记录', '登录模块', '113.110.166.106', '2017217042', '广东省深圳市', 'chrome', '1589550046011'),
(23, '编辑权限组 T1', '修改记录', '权限组模块', '113.110.166.106', '2017217042', '广东省深圳市', 'chrome', '1589552869389'),
(24, '管理员登录', '登录记录', '登录模块', '113.110.166.106', '2017217042', '广东省深圳市', 'chrome', '1589605698558'),
(25, '修改菜单 1010', '修改记录', '菜单模块', '113.110.166.106', '', '广东省深圳市', 'chrome', '1589606391899'),
(26, '修改菜单 1010', '修改记录', '菜单模块', '113.110.166.106', '', '广东省深圳市', 'chrome', '1589606396124'),
(27, '添加用户 2018218011', '添加记录', '用户模块', '113.110.167.113', '2017217042', '广东省深圳市', 'chrome', '1589621422367'),
(28, '修改用户 2018218011', '修改记录', '用户模块', '113.110.167.113', '2017217042', '广东省深圳市', 'chrome', '1589621527241'),
(29, '管理员登录', '登录记录', '登录模块', '113.110.167.113', '2017217042', '广东省深圳市', 'chrome', '1589637488962'),
(30, '编辑学期信息 192002', '修改记录', '学期模块', '113.110.167.113', '2017217042', '广东省深圳市', 'chrome', '1589637844879'),
(31, '设置当前学期 192002', '修改记录', '学期模块', '113.110.167.113', '2017217042', '广东省深圳市', 'chrome', '1589638376783'),
(39, '添加学期信息 123', '添加记录', '学期模块', '113.110.167.113', '2017217042', '广东省深圳市', 'chrome', '1589639782879'),
(40, '删除学期记录 [{\"id\":\"8\",\"semesterId\":\"123\",\"semester\":\"123\",\"administrative_start\":\"2020-05-04\",\"administrative_end\":\"2020-04-28\",\"teach_start\":\"2020-05-26\",\"teach_end\":\"2020-05-22\",\"addTime\":\"2020-05-16\",\"founder\":\"wanted\",\"state\":\"0\"}]', '删除记录', '学期模块', '113.110.167.113', '2017217042', '广东省深圳市', 'chrome', '1589639791356'),
(41, '管理员登录', '登录记录', '登录模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589802909875'),
(42, '管理员登录', '登录记录', '登录模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589864451572'),
(43, '修改宿管管理安排 S0001_A_A_001', '修改记录', '宿舍安排模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589865510805'),
(44, '管理员登录', '登录记录', '登录模块', '', '2017217042', '', 'chrome', '1589874252821'),
(45, '管理员登录', '登录记录', '登录模块', '112.97.61.231', '2017217042', '广东省深圳市', 'chrome', '1589896653980'),
(46, '管理员登录', '登录记录', '登录模块', '112.97.61.231', '2017217042', '广东省深圳市', 'chrome', '1589897516598'),
(47, '资产采购登记 1589935128874', '添加记录', '资产采购模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1589935128918'),
(48, '修改资产采购信息 1589935128874', '修改记录', '资产采购模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1589935775526'),
(49, '管理员登录', '登录记录', '登录模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1589940725563'),
(50, '资产领用登记数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589951720453'),
(51, '资产领用登记数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589951760192'),
(52, '资产领用登记数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589951782696'),
(53, '资产领用登记数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589951849906'),
(54, '资产领用修改信息 数量 2 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970459877'),
(55, '资产领用修改信息 数量 2 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970482557'),
(56, '资产领用修改信息 数量 2 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970508897'),
(57, '资产领用修改信息 数量 2 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970520005'),
(58, '资产领用修改信息 数量 2 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970682025'),
(59, '资产领用修改信息 数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970775458'),
(60, '资产领用修改信息 数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970799966'),
(61, '资产领用修改信息 数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970854355'),
(62, '资产领用修改信息 数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970873186'),
(63, '资产领用修改信息 数量 1 S0001_A_01 BAZX-ZSYGMSYDDX', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589970979956'),
(64, '资产领用修改信息 数量 2 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589971047361'),
(65, '资产领用修改信息 数量 1 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589971062265'),
(66, '资产领用修改信息 数量 2 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589971136605'),
(67, '资产领用修改信息 数量 1 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589971262573'),
(68, '资产领用修改信息 数量 2 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589971287740'),
(69, '资产领用修改信息 数量 1 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589971311162'),
(70, '资产领用修改信息 数量 2 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589971456980'),
(71, '资产领用修改信息 数量 1 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589972189647'),
(72, '资产领用修改信息 数量 2 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589972230612'),
(73, '资产领用修改信息 数量 1 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589972261339'),
(74, '资产领用修改信息 数量 2 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589972360884'),
(75, '资产领用修改信息 数量 1 S0001_A_01 BAZX-BGJJ-0001', '修改记录', '资产领用模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1589972370205'),
(76, '管理员登录', '登录记录', '登录模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590019782277'),
(77, '报废资产登记 数量：1 存储地址：undefined 资产：BAZX-ZSYGMSYDDX', '添加记录', '报废资产模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590023015042'),
(78, '报废资产登记 数量：1 存储地址：undefined 资产：BAZX-ZSYGMSYDDX', '添加记录', '报废资产模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590023186075'),
(79, '报废资产登记 数量：1 存储地址：undefined 资产：BAZX-ZSYGMSYDDX', '添加记录', '报废资产模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590023227892'),
(80, '报废资产修改 数量：2 存储地址：undefined 资产：BAZX-ZSYGMSYDDX', '修改记录', '报废资产模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590024103619'),
(81, '报废资产修改 数量：1 存储地址：undefined 资产：BAZX-ZSYGMSYDDX', '修改记录', '报废资产模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590024118319'),
(82, '添加菜单 10044', '添加记录', '菜单模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590024601944'),
(83, '添加菜单 10045', '添加记录', '菜单模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590024620035'),
(84, '编辑权限组 D1', '修改记录', '权限组模块', '113.98.241.55', '2017217042', '广东省深圳市', 'chrome', '1590024653222'),
(85, '添加资产类型:图书文档 资产类型id:AS_003', '添加记录', '资产类型模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590037083431'),
(86, '修改资产类型:图书 资产类型id:AS_003', '修改记录', '资产类型模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590037386471'),
(87, '修改资产类型:图书文档 资产类型id:AS_003', '修改记录', '资产类型模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590037393517'),
(88, '添加报废类型:丢失 报废类型id:AC_002', '添加记录', '报废类型模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590038222798'),
(89, '修改报废类型:丢失了 报废类型id:AC_002', '修改记录', '报废类型模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590038519583'),
(90, '修改报废类型:丢失 报废类型id:AC_002', '修改记录', '报废类型模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590038525244'),
(91, '资产采购登记 1590039063609', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039063632'),
(92, '资产采购登记 1590039088991', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039089019'),
(93, '资产采购登记 1590039253623', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039253656'),
(94, '资产采购登记 1590039467268', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039467296'),
(95, '资产采购登记 1590039477749', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039477772'),
(96, '资产采购登记 1590039589997', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039590041'),
(97, '删除资产记录', '删除记录', '资产模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039595024'),
(98, '资产采购登记 1590039644170', '添加记录', '资产采购模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590039644200'),
(99, '管理员登录', '登录记录', '登录模块', '61.144.170.174', '2017217042', '广东省深圳市', 'chrome', '1590063702657'),
(100, '管理员登录', '登录记录', '登录模块', '112.97.60.33', '2017217042', '广东省深圳市', 'chrome', '1590107724269'),
(101, '教师入职登记 2017217001', '添加记录', '教师入职模块', '112.97.60.33', '2017217042', '广东省深圳市', 'chrome', '1590111551807'),
(102, '添加权限组 T10', '添加记录', '权限组模块', '112.97.60.33', '2017217042', '广东省深圳市', 'chrome', '1590111945732'),
(103, '修改用户 2017217001', '修改记录', '用户模块', '112.97.60.33', '2017217042', '广东省深圳市', 'chrome', '1590112241212'),
(104, '教师登录', '登录记录', '登录模块', '112.97.60.33', '2017217042', '广东省深圳市', 'chrome', '1590112276326'),
(105, '教师资格证书登记', '添加记录', '我的证书模块', '112.97.60.33', '2017217001', '广东省深圳市', 'chrome', '1590114410781'),
(106, '修改用户 2017217001', '修改记录', '用户模块', '112.97.60.33', '2017217001', '广东省深圳市', 'chrome', '1590115116840'),
(107, '修改用户 2017217001', '修改记录', '用户模块', '112.97.60.33', '2017217001', '广东省深圳市', 'chrome', '1590115166489'),
(108, '修改用户 2017217001', '修改记录', '用户模块', '112.97.60.33', '2017217001', '广东省深圳市', 'chrome', '1590115286240'),
(109, '修改用户 2017217001', '修改记录', '用户模块', '112.97.60.33', '2017217001', '广东省深圳市', 'chrome', '1590115306480'),
(110, '修改用户 2017217001', '修改记录', '用户模块', '112.97.60.33', '2017217001', '广东省深圳市', 'chrome', '1590115459100'),
(111, '修改教师所在部门 教师: [\"2017217001\"]', '修改记录', '教师部门设置模块', '112.97.60.33', '2017217001', '广东省深圳市', 'chrome', '1590116166968'),
(112, '教师登录', '登录记录', '登录模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590155523823'),
(113, '教师登录', '登录记录', '登录模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590208253113'),
(114, '添加课程信息 S0001_A_01_01_C005', '添加记录', '课程模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590209243185'),
(115, '学生登录', '登录记录', '登录模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590212525918'),
(116, '教师登录', '登录记录', '登录模块', '113.110.166.89', '2017217041', '广东省深圳市', 'chrome', '1590212562879'),
(117, '学期开课设置', '修改记录', '学期开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590224304406'),
(118, '学期开课设置', '修改记录', '学期开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590224309757'),
(119, '学期开课设置', '修改记录', '学期开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590224452116'),
(120, '删除班级 undefined', '删除记录', '班级模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590233410536'),
(121, '删除作息信息 undefined', '删除记录', '作息模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590238254113'),
(122, '删除作息信息 undefined', '删除记录', '作息模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590238323203'),
(123, '删除作息信息 undefined', '删除记录', '作息模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590238549381'),
(124, '学期开课设置', '修改记录', '学期开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590240678914'),
(125, '学期开课设置', '修改记录', '学期开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590241401319'),
(126, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244288342'),
(127, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244303308'),
(128, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244315412'),
(129, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244324384'),
(130, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244380093'),
(131, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244413340'),
(132, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244417334'),
(133, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244422357'),
(134, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244426158'),
(135, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244432933'),
(136, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244499339'),
(137, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244511387'),
(138, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244639179'),
(139, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244706078'),
(140, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244752700'),
(141, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590244756277'),
(142, '管理员登录', '登录记录', '登录模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590285355293'),
(143, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590286975088'),
(144, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590286979520'),
(145, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287674260'),
(146, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287677787'),
(147, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287682409'),
(148, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287709151'),
(149, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287725000'),
(150, '添加课程信息 S0001_A_01_01_C006', '添加记录', '课程模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287746830'),
(151, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287759807'),
(152, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590287768028'),
(153, '教师排课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '教师排课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590302954327'),
(154, '教师排课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '教师排课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590302970214'),
(155, '添加菜单 10018', '添加记录', '菜单模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590306271003'),
(156, '编辑权限组 D1', '修改记录', '权限组模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590306296318'),
(157, '编辑权限组 T2', '修改记录', '权限组模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590306310899'),
(158, '编辑权限组 T10', '修改记录', '权限组模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590306314598'),
(159, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308839772'),
(160, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308843087'),
(161, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308861093'),
(162, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308879553'),
(163, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308895411'),
(164, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308917119'),
(165, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308919866'),
(166, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590308925302'),
(167, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309394061'),
(168, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309395948'),
(169, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309397679'),
(170, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309456860'),
(171, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309477879'),
(172, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309481640'),
(173, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309771122'),
(174, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309781471'),
(175, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309783898'),
(176, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309808746'),
(177, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309846126'),
(178, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309852250'),
(179, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309936693'),
(180, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590309938756'),
(181, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590310009159'),
(182, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590310500155'),
(183, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590310506116'),
(184, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590310771158'),
(185, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590310822374'),
(186, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590310825625'),
(187, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590311044210'),
(188, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590311057160'),
(189, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590313151863'),
(190, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590313155453'),
(191, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590313176825'),
(192, '教师登录', '登录记录', '登录模块', '113.110.166.89', '2017217042', '广东省深圳市', 'chrome', '1590313255285'),
(193, '教师排课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '教师排课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590320240544'),
(194, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590320268703'),
(195, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590320271452'),
(196, '教师排课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '教师排课模块', '113.110.166.89', '2017217001', '广东省深圳市', 'chrome', '1590320287514'),
(197, '教师登录', '登录记录', '登录模块', '112.97.59.84', '2017217001', '广东省深圳市', 'chrome', '1590368796872'),
(198, '教师排课删除 学期:192002 班级: S0001_A_01_01_1901', '删除记录', '教师排课模块', '112.97.59.84', '2017217001', '广东省深圳市', 'chrome', '1590369284131'),
(199, '教师排课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '教师排课模块', '112.97.59.84', '2017217001', '广东省深圳市', 'chrome', '1590369313096'),
(200, '教师排课删除 学期:192002 班级: S0001_A_01_01_1901', '删除记录', '教师排课模块', '112.97.59.84', '2017217001', '广东省深圳市', 'chrome', '1590369318244'),
(201, '教师排课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '教师排课模块', '112.97.59.84', '2017217001', '广东省深圳市', 'chrome', '1590369337043'),
(202, '教师排课删除 学期:192002 班级: S0001_A_01_01_1901', '删除记录', '教师排课模块', '112.97.59.84', '2017217001', '广东省深圳市', 'chrome', '1590369339821'),
(203, '教师排课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '教师排课模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590393439783'),
(204, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590412507734'),
(205, '教师登录', '登录记录', '登录模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590455713561'),
(206, '添加宿管楼 S0001_A_D', '添加记录', '宿舍楼模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478368099'),
(207, '修改宿舍记录 S0001_A_A_001', '修改记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478415346'),
(208, '修改宿舍记录 S0001_A_A_002', '修改记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478422662'),
(209, '添加宿舍 S0001_A_C_001', '添加记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478432791'),
(210, '添加宿舍 S0001_A_C_001', '添加记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478438929'),
(211, '添加宿舍 S0001_A_C_001', '添加记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478445995'),
(212, '添加宿舍 S0001_A_D_001', '添加记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478452739'),
(213, '添加宿舍 S0001_A_C_001', '添加记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478493076'),
(214, '添加宿舍 S0001_A_C_002', '添加记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478499020'),
(215, '添加宿舍 S0001_A_D_001', '添加记录', '宿舍模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590478505398'),
(216, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590498949142'),
(217, '修改学生档案 学生：5', '修改记录', '学生库模块', '112.97.59.157', '2017217001', '广东省深圳市', 'chrome', '1590502769450'),
(218, '添加学生档案 学生：2018218031', '添加记录', '学生库模块', '112.97.59.157', '2017217001', '广东省深圳市', 'chrome', '1590502981520'),
(219, '修改学生档案 学生：6', '修改记录', '学生库模块', '112.97.59.157', '2017217001', '广东省深圳市', 'chrome', '1590503060678'),
(220, '修改学期宿舍安排 学期：192002 学生：2018218031 宿舍S0001_A_C_001', '修改记录', '学期宿舍模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590537813505'),
(221, '修改学期宿舍安排 学期：192002 学生：2018218011 宿舍S0001_A_C_001', '修改记录', '学期宿舍安排模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590538457168'),
(222, '添加学期宿舍安排 学期：192002 学生：2018218031 宿舍S0001_A_D_001', '添加记录', '学期宿舍安排模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590538556017'),
(223, '删除学期宿舍安排信息 undefined', '删除记录', '学期宿舍安排模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590539546150'),
(224, '教师登录', '登录记录', '登录模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590544985782'),
(225, '添加课务调整信息 undefined', '添加记录', '课务调整模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590556271344'),
(226, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590622730278'),
(227, '添加课务调整信息 undefined', '添加记录', '课务调整模块', '113.98.241.55', '2017217001', '广东省深圳市', 'chrome', '1590626294095'),
(228, '删除调课信息 undefined', '删除记录', '课务调整模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590636362589'),
(229, '删除调课信息 undefined', '删除记录', '课务调整模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590639099557'),
(230, '添加课务调整信息 undefined', '添加记录', '课务调整模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590639159567'),
(231, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590667320669'),
(232, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590711913057'),
(233, '添加公开课信息 undefined', '添加记录', '公开课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590713585880'),
(234, '添加公开课信息 undefined', '添加记录', '公开课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590713683755'),
(235, '添加公开课信息 undefined', '添加记录', '公开课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590713763648'),
(236, '添加公开课信息 undefined', '添加记录', '公开课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590714320858'),
(237, '添加公开课信息 undefined', '添加记录', '公开课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590714458997'),
(238, '修改教师所在部门 教师: [\"2017217042\",\"2017217038\",\"2018181088\",\"2017217001\"]', '修改记录', '教师部门设置模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590731888524'),
(239, '教师登录', '登录记录', '登录模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590764311656'),
(240, '修改教师所在部门 教师: [\"2017217038\"]', '修改记录', '教师部门设置模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590807486616'),
(241, '修改教师所在部门 教师: [\"2017217038\"]', '修改记录', '教师部门设置模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590807489670'),
(242, '教师登录', '登录记录', '登录模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590809635192'),
(243, '填写公开课信息 undefined', '添加记录', '公开课填写模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590823859284'),
(244, '填写公开课信息 undefined', '添加记录', '公开课填写模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590823934242'),
(245, '填写公开课信息 undefined', '添加记录', '公开课填写模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590824737143'),
(246, '填写公开课信息 undefined', '修改记录', '公开课填写模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590824766731'),
(247, '填写公开课信息 undefined', '修改记录', '公开课填写模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590824786438'),
(248, '填写公开课信息 undefined', '修改记录', '公开课填写模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590824802566'),
(249, '填写公开课信息 undefined', '修改记录', '公开课填写模块', '113.110.166.149', '2017217001', '广东省深圳市', 'chrome', '1590825116758'),
(250, '审核公开课信息 1', '修改记录', '公开课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590830880372'),
(251, '审核公开课信息 1', '修改记录', '公开课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590830892879'),
(252, '审核公开课信息 1', '修改记录', '公开课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590830952068'),
(253, '添加菜单 100813', '添加记录', '菜单模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590831570800'),
(254, '编辑权限组 T10', '修改记录', '权限组模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590831588728'),
(255, '编辑权限组 D1', '修改记录', '权限组模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590831593258'),
(256, '添加菜单 10014_1', '添加记录', '菜单模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590836976219'),
(257, '添加菜单 10014_2', '添加记录', '菜单模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590837010049'),
(258, '添加菜单 10014_3', '添加记录', '菜单模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590837041672'),
(259, '添加菜单 10014_3_1', '添加记录', '菜单模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590837128738'),
(260, '添加菜单 10014_3_2', '添加记录', '菜单模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590837163415'),
(261, '教师登录', '登录记录', '登录模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590891265634'),
(262, '添加项目 S0001_A_O003', '添加记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590898033888'),
(263, '修改项目 S0001_A_O001', '修改记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590901999305'),
(264, '修改项目 S0001_A_O001', '修改记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590902031860'),
(265, '添加选项 S0001_A_O002', '添加记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590903087254'),
(266, '修改选项 3', '修改记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590903605293'),
(267, '修改选项 3', '修改记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590903609086'),
(268, '添加选项 S0001_A_O002', '添加记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590903626765'),
(269, '教师登录', '登录记录', '登录模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590934898034'),
(270, '添加选项 S0001_A_O002', '添加记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590934941320'),
(271, '修改选项 4', '修改记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590934947052'),
(272, '修改选项 3', '修改记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590934952309'),
(273, '添加选项 S0001_A_O002', '添加记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590934963157'),
(274, '修改选项 4', '修改记录', '巡堂查课模块', '113.110.166.61', '2017217001', '广东省深圳市', 'chrome', '1590934967121'),
(275, '添加选项 S0001_A_O003', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590971615701'),
(276, '添加选项 S0001_A_O003', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590971622138'),
(277, '添加选项 S0001_A_O003', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590971629291'),
(278, '添加选项 S0001_A_O003', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590971636854'),
(279, '巡堂课程登记 班级：S0001_A_01_02_1901 节次：ZX1 时间：1590940800000', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590977270885'),
(280, '巡堂课程登记 班级：S0001_A_01_01_1901 节次：ZX1 时间：1590940800000', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590977276566'),
(281, '巡堂课程登记 班级：S0001_A_01_01_1901 节次：ZX1 时间：1590940800000', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590977302012'),
(282, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590980235404'),
(283, '巡堂课程登记 班级：S0001_A_01_02_1901 节次：ZX1 时间：1590940800000', '添加记录', '巡堂查课模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1590992482455'),
(284, '编辑权限组 D1', '修改记录', '权限组模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591009193661'),
(285, '编辑权限组 T10', '修改记录', '权限组模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591009196520'),
(286, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591054175720'),
(287, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591098401200'),
(288, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591142211059'),
(289, '添加考勤选项 T4', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151445166'),
(290, '禁用考勤选项 T2', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151853696'),
(291, '启用考勤选项 T2', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151885916'),
(292, '启用考勤选项 T1', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151886545'),
(293, '禁用考勤选项 T1', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151887258'),
(294, '禁用考勤选项 T2', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151887895'),
(295, '启用考勤选项 T2', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151889146'),
(296, '启用考勤选项 T1', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591151889895'),
(297, '修改考勤选项 T3', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591152361703'),
(298, '修改考勤选项 T3', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591152364534'),
(299, '禁用考勤选项 T4', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591152492022'),
(300, '启用考勤选项 T4', '修改记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591152492554'),
(301, '添加卫生考勤模块 S0001_A_H2', '添加记录', '卫生考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591160971354'),
(302, '修改卫生模块选项 S0001_A_H2', '修改记录', '卫生模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591163225238'),
(303, '修改卫生模块选项 S0001_A_H2', '修改记录', '卫生模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591163232726'),
(304, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591187676033'),
(305, '添加考勤选项 S0001_A_H1_O1', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591189922817'),
(306, '添加考勤选项 S0001_A_H1_O1', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591189929748'),
(307, '添加考勤选项 S0001_A_H1_O1', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591189935982'),
(308, '添加卫生选项 S0001_A_H1_O1', '添加记录', '卫生选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591231419607'),
(309, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591231427524'),
(310, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591273263592'),
(311, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591273434039'),
(312, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591273450348'),
(313, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591273522709'),
(314, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591273537244'),
(315, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591273565848'),
(316, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591273969660'),
(317, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274000375'),
(318, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274089784'),
(319, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274114589'),
(320, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274186010'),
(321, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274221767'),
(322, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274235449'),
(323, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274253411'),
(324, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274289931'),
(325, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月4日 课程undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591274420769'),
(326, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591316775700'),
(327, '添加考勤选项 T5', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591317570277'),
(328, '添加考勤选项 T6', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591317581779'),
(329, '添加考勤选项 T7', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591317595885'),
(330, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318198865'),
(331, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318237761'),
(332, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318295303'),
(333, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318300688'),
(334, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318303369'),
(335, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318373205'),
(336, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318404015'),
(337, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318414083'),
(338, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318439580'),
(339, '添加考勤选项 T8', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318721948'),
(340, '添加考勤选项 T9', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318733410'),
(341, '添加考勤选项 T10', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318745413'),
(342, '添加考勤选项 T11', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318752659'),
(343, '添加考勤选项 T12', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318760420'),
(344, '添加考勤选项 T13', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318773210'),
(345, '添加考勤选项 T14', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591318780695'),
(346, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591319984210'),
(347, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日 节次ZX1', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591326341405'),
(348, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月5日 节次ZX2', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591326349875'),
(349, '教师登录', '登录记录', '登录模块', '112.97.61.243', '2017217001', '广东省深圳市', 'chrome', '1591363256391'),
(350, '教师登录', '登录记录', '登录模块', '', '2017217001', '', 'chrome', '1591414129610'),
(351, '添加考勤选项 S0001_A_H2_O1', '添加记录', '考勤选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415310106'),
(352, '添加考勤选项 S0001_A_H2_O4', '添加记录', '考勤选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415315803'),
(353, '添加卫生选项 S0001_A_H2_O1', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415334676'),
(354, '添加卫生选项 S0001_A_H2_O1', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415360623'),
(355, '修改卫生选项 3', '修改记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415456728'),
(356, '添加卫生选项 S0001_A_H2_O1', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415469423'),
(357, '添加卫生选项 S0001_A_H2_O1', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415477174'),
(358, '添加卫生选项 S0001_A_H2_O4', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415516904'),
(359, '添加卫生选项 S0001_A_H2_O4', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415526674'),
(360, '添加卫生选项 S0001_A_H2_O4', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415543199'),
(361, '添加卫生选项 S0001_A_H2_O4', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415550779'),
(362, '添加卫生选项 S0001_A_H1_O2', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415738933'),
(363, '添加卫生选项 S0001_A_H1_O2', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415756044'),
(364, '添加卫生选项 S0001_A_H1_O2', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415775048'),
(365, '添加卫生选项 S0001_A_H1_O2', '添加记录', '卫生选项模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591415787303'),
(366, '课室卫生登记 班级：S0001_A_01_01_1901 时间：1591372800000', '添加记录', '课室卫生登记模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591418794314'),
(367, '课室卫生登记 班级：S0001_A_01_02_1901 时间：1591372800000', '添加记录', '课室卫生登记模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591420461029'),
(368, '课室卫生登记 班级：S0001_A_01_01_1901 时间：1591372800000', '添加记录', '课室卫生登记模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591420510786'),
(369, '课室卫生登记 班级：S0001_A_01_02_1901 时间：1591372800000', '添加记录', '课室卫生登记模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591420535053'),
(370, '黑板报卫生登记 班级：S0001_A_01_01_1901 时间：1591372800000', '添加记录', '黑板报卫生登记模块', '112.97.57.187', '2017217001', '广东省深圳市', 'chrome', '1591424331408'),
(371, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月6日 节次ZX1', '添加记录', '课堂考勤模块', '112.97.57.23', '2017217001', '广东省深圳市', 'chrome', '1591436168747'),
(372, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月6日', '添加记录', '早段考勤模块', '112.97.57.23', '2017217001', '广东省深圳市', 'chrome', '1591436173938'),
(373, '课间操考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月6日', '添加记录', '课间操考勤模块', '112.97.57.23', '2017217001', '广东省深圳市', 'chrome', '1591436180872'),
(374, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591581642147'),
(375, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月8日 节次ZX1', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591617313750'),
(376, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月8日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591617318629'),
(377, '课间操考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月8日', '添加记录', '课间操考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591617323988'),
(378, '课堂考勤登记 班级：S0001_A_01_02_1901 时间：2020年6月8日 节次ZX2', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591617338740'),
(379, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591627359776'),
(380, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月9日 节次ZX2', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591668346707'),
(381, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月9日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591668355072'),
(382, '课间操考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月9日', '添加记录', '课间操考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591668361753'),
(383, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591672051255'),
(384, '教师登录', '登录记录', '登录模块', '', '2017217001', '', 'chrome', '1591747441740'),
(385, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月10日 节次ZX1', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591749499434'),
(386, '课堂考勤登记 班级：S0001_A_01_02_1901 时间：2020年6月10日 节次ZX1', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591749516733'),
(387, '添加考勤选项 T15', '添加记录', '考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591756361322'),
(388, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月10日 节次ZX2', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591756413529'),
(389, '添加学生档案 学生：2018218011', '添加记录', '学生库模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591757425861'),
(390, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591791916246'),
(391, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591835480343'),
(392, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月11日 节次ZX1', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591836232293'),
(393, '早段考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月11日', '添加记录', '早段考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591836237383'),
(394, '课间操考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月11日', '添加记录', '课间操考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591836245325'),
(395, '课堂考勤登记 班级：S0001_A_01_02_1901 时间：2020年6月11日 节次ZX1', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591836256419'),
(396, '修改菜单 10073_1_5', '修改记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591838914512'),
(397, '修改学生档案 学生：7', '修改记录', '学生库模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591851919633'),
(398, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月11日 节次ZX1', '添加记录', '课堂考勤补登模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591852249427'),
(399, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月11日 节次ZX1', '添加记录', '课堂考勤补登模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591855220933'),
(400, '添加学生档案 学生：2017218025', '添加记录', '学生库模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591860367830'),
(401, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591860476565'),
(402, '学生登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591860578309'),
(403, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217041', '广东省深圳市', 'chrome', '1591874086279'),
(404, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591874859191'),
(405, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月11日 节次ZX1', '添加记录', '课堂考勤补登模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591878138352'),
(406, '课堂考勤登记 班级：S0001_A_01_01_1901 时间：2020年6月11日 节次ZX4', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591880642144'),
(407, '删除课堂登记记录 undefined', '删除记录', '班级模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591880654593'),
(408, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591918819634'),
(409, '课室卫生登记 班级：S0001_A_01_01_1901 时间：1591891200000', '添加记录', '课室卫生登记模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591931634889'),
(410, '课室卫生登记 班级：S0001_A_01_01_1901 时间：1591891200000', '添加记录', '课室卫生登记模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591932411790'),
(411, '添加学生档案 学生：2018218038', '添加记录', '学生库模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1591933407790'),
(412, '学生登录', '登录记录', '登录模块', '61.144.170.174', '2017217041', '广东省深圳市', 'chrome', '1591935995719'),
(413, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217041', '广东省深圳市', 'chrome', '1591942820645'),
(414, '学生登录', '登录记录', '登录模块', '112.97.49.4', '2017217001', '广东省深圳市', 'chrome', '1591962089758'),
(415, '学生登录', '登录记录', '登录模块', '112.97.49.4', '2017217041', '广东省深圳市', 'chrome', '1591962232832'),
(416, '管理员登录', '登录记录', '登录模块', '112.97.49.4', '2018218038', '广东省深圳市', 'chrome', '1591962604167'),
(417, '学生登录', '登录记录', '登录模块', '112.97.49.4', '2017217042', '广东省深圳市', 'chrome', '1591962758510'),
(418, '添加菜单 10002_2_3', '添加记录', '菜单模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591972811639'),
(419, '添加卫生考勤模块 S0001_A_H3', '添加记录', '卫生考勤模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591972872390'),
(420, '添加考勤选项 S0001_A_H3_O1', '添加记录', '考勤选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973557796'),
(421, '添加考勤选项 S0001_A_H3_O6', '添加记录', '考勤选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973578717'),
(422, '添加卫生选项 S0001_A_H3_O1', '添加记录', '卫生选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973600498'),
(423, '添加卫生选项 S0001_A_H3_O1', '添加记录', '卫生选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973610539'),
(424, '添加卫生选项 S0001_A_H3_O6', '添加记录', '卫生选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973628503'),
(425, '添加卫生选项 S0001_A_H3_O6', '添加记录', '卫生选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973695677'),
(426, '添加卫生选项 S0001_A_H3_O6', '添加记录', '卫生选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973708823'),
(427, '添加卫生选项 S0001_A_H3_O6', '添加记录', '卫生选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591973725658'),
(428, '添加考勤选项 T16', '添加记录', '考勤选项模块', '112.97.57.78', '2017217001', '广东省深圳市', 'chrome', '1591974634795'),
(429, '教师登录', '登录记录', '登录模块', '112.97.61.65', '2017217001', '广东省深圳市', 'chrome', '1592108298103'),
(430, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592116981428'),
(431, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117001391'),
(432, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117096075');
INSERT INTO `system_log` (`id`, `log_content`, `log_type`, `log_model`, `log_ip`, `log_user`, `log_area`, `log_brower`, `addTime`) VALUES
(433, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117110100'),
(434, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117190412'),
(435, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117337692'),
(436, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117361838'),
(437, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117635543'),
(438, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117673607'),
(439, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117772232'),
(440, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117795969'),
(441, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117845097'),
(442, '导入课程信息', '添加记录', '课程模块', '112.97.61.175', '2017217001', '广东省深圳市', 'chrome', '1592117877142'),
(443, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592199857606'),
(444, '学生登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592200215933'),
(445, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592200410261'),
(446, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230305589'),
(447, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230331991'),
(448, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230363655'),
(449, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230385777'),
(450, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230460761'),
(451, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230470999'),
(452, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230508589'),
(453, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592230553357'),
(454, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592231298061'),
(455, '导入课程信息', '添加记录', '课程模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592231355114'),
(456, '教师登录', '登录记录', '登录模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592282933014'),
(457, '修改学生档案 学生：13', '修改记录', '学生库模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592290970404'),
(458, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592292078142'),
(459, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592292089020'),
(460, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592292287154'),
(461, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592292470283'),
(462, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592292544429'),
(463, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592292614981'),
(464, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592293025670'),
(465, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592293043907'),
(466, '导入课程信息', '添加记录', '课程模块', '112.97.52.36', '2017217001', '广东省深圳市', 'chrome', '1592293130505'),
(467, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592354677677'),
(468, '添加菜单 10005', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592377389995'),
(469, '添加菜单 10005_1', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592377483540'),
(470, '添加菜单 10005_2', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592377546407'),
(471, '添加菜单 10005_3', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592377591612'),
(472, '添加菜单 10005_4', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592377656110'),
(473, '添加菜单 10005_5', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592377685660'),
(474, '添加菜单 10005_6', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592377721797'),
(475, '编辑权限组 D1', '修改记录', '权限组模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592378553379'),
(476, '编辑权限组 T10', '修改记录', '权限组模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592378562854'),
(477, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592398911582'),
(478, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592443815881'),
(479, '班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '添加记录', '校区模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592485171880'),
(480, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592524036914'),
(481, '修改班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592526427262'),
(482, '修改班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592526444189'),
(483, '修改班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592526466325'),
(484, '修改班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592526524459'),
(485, '修改班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592526765725'),
(486, '修改班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592526962222'),
(487, '班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_02_1901', '添加记录', '大周填报-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592527347747'),
(488, '班主任填报 第18周； 教师：2017217001； 班级：S0001_A_01_01_1901', '添加记录', '大周填报-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592529210511'),
(489, '修改教师所在部门 教师: [\"2017217038\",\"2018181088\"]', '修改记录', '教师部门设置模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592551558268'),
(490, '班主任填报 第18周； 教师：undefined； 班级：undefined', '添加记录', '大周填报-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592552196142'),
(491, '班主任填报 第18周； 教师：undefined； 班级：undefined', '添加记录', '大周填报-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592552440720'),
(492, '班主任填报提交 2', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592552450085'),
(493, '修改班主任填报 第18周； 教师：undefined； 班级：undefined', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592552937312'),
(494, '修改班主任填报 第18周； 教师：undefined； 班级：undefined', '修改记录', '大周模块-班主任填报模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592552945665'),
(495, '教师登录', '登录记录', '登录模块', '112.97.63.180', '2017217001', '广东省深圳市', 'chrome', '1592569257148'),
(496, '宿舍填报提交 1', '修改记录', '大周模块-宿舍填报模块', '112.97.63.180', '2017217001', '广东省深圳市', 'chrome', '1592569362497'),
(497, '宿舍填报提交 2', '修改记录', '大周模块-宿舍填报模块', '112.97.63.180', '2017217001', '广东省深圳市', 'chrome', '1592571410946'),
(498, '班主任填报提交 2', '修改记录', '大周模块-班主任填报模块', '112.97.63.180', '2017217001', '广东省深圳市', 'chrome', '1592571504479'),
(499, '教师登录', '登录记录', '登录模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592621778626'),
(500, '班主任填报系部审核 id:2', '修改记录', '大周模块-宿舍填报模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592621939657'),
(501, '修改宿管楼记录 S0001_A_D', '修改记录', '宿舍楼模块', '112.97.59.65', '2017217001', '广东省深圳市', 'chrome', '1592624210548'),
(502, '修改宿管楼记录 S0001_A_D', '修改记录', '宿舍楼模块', '112.97.59.65', '2017217001', '广东省深圳市', 'chrome', '1592624216892'),
(503, '修改宿管楼记录 S0001_A_D', '修改记录', '宿舍楼模块', '112.97.59.65', '2017217001', '广东省深圳市', 'chrome', '1592624253322'),
(504, '修改宿管管理安排 S0001_A_C_001', '修改记录', '宿舍安排模块', '112.97.59.65', '2017217001', '广东省深圳市', 'chrome', '1592624874246'),
(505, '修改宿管管理安排 S0001_A_C_002', '修改记录', '宿舍安排模块', '112.97.59.65', '2017217001', '广东省深圳市', 'chrome', '1592624882709'),
(506, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592632618252'),
(507, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592632729591'),
(508, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592632827345'),
(509, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633014823'),
(510, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633300962'),
(511, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633319950'),
(512, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633327272'),
(513, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633381305'),
(514, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633568226'),
(515, '系部审核填报 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-系部审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633580432'),
(516, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592633626980'),
(517, '领导审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-领导审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592635734011'),
(518, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-领导审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592635740048'),
(519, '政教处审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-政教处审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592635756508'),
(520, '领导审核 部门：S0001_A_01 周次：18 类型：headteacher', '修改记录', '大周模块-领导审核模块', '112.97.59.31', '2017217001', '广东省深圳市', 'chrome', '1592635762709'),
(521, '添加宿管楼 S0001_A_E', '添加记录', '宿舍楼模块', '112.97.63.175', '2017217001', '广东省深圳市', 'chrome', '1592653161479'),
(522, '添加宿舍 S0001_A_D_002', '添加记录', '宿舍模块', '112.97.63.175', '2017217001', '广东省深圳市', 'chrome', '1592653362236'),
(523, '导入课程信息', '添加记录', '课程模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592662939063'),
(524, '导入课程信息', '添加记录', '课程模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592663139946'),
(525, '导入课程信息', '添加记录', '课程模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592663209779'),
(526, '导入宿舍信息', '添加记录', '宿舍模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592663334332'),
(527, '教师登录', '登录记录', '登录模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592666975242'),
(528, '导入学期宿管安排信息 操作人：2017217001', '添加记录', '宿管安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592710532003'),
(529, '教师登录', '登录记录', '登录模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592710953509'),
(530, '导入学期宿管安排信息 操作人：2017217001', '添加记录', '宿管安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592711702652'),
(531, '添加学期信息 202101', '添加记录', '学期模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592711790227'),
(532, '导入学期宿管安排信息 操作人：2017217001', '添加记录', '宿管安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592711878253'),
(533, '导入学期宿管安排信息 操作人：2017217001', '添加记录', '宿管安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592711990908'),
(534, '删除学期宿管安排信息 undefined', '删除记录', '宿管安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592712158310'),
(535, '导入学期学生宿舍安排信息 操作人：2017217001', '添加记录', '学生宿舍安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592718443292'),
(536, '导入学期学生宿舍安排信息 操作人：2017217001', '添加记录', '学生宿舍安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592718452853'),
(537, '导入学期学生宿舍安排信息 操作人：2017217001', '添加记录', '学生宿舍安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592718468064'),
(538, '导入学期学生宿舍安排信息 操作人：2017217001', '添加记录', '学生宿舍安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592718644336'),
(539, '导入学期学生宿舍安排信息 操作人：2017217001', '添加记录', '学生宿舍安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592719544803'),
(540, '导入学期学生宿舍安排信息 操作人：2017217001', '添加记录', '学生宿舍安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592719590825'),
(541, '导入学期学生宿舍安排信息 操作人：2017217001', '添加记录', '学生宿舍安排模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592719822088'),
(542, '修改菜单 10071', '修改记录', '菜单模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1592721017978'),
(543, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592784958672'),
(544, '添加学期分班安排 学期：192002 学生：2018218034 班级S0001_A_01_02_1901', '添加记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592791292608'),
(545, '删除学期分班信息信息 undefined', '删除记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592791818569'),
(546, '删除学期分班信息信息 undefined', '删除记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592791836266'),
(547, '删除学期分班信息信息 undefined', '删除记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592791984378'),
(548, '添加学期分班安排 学期：192002 学生：2018218034 班级S0001_A_01_02_1901', '添加记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592791993645'),
(549, '修改学期分班安排 学期：192002 学生：2018218034 班级S0001_A_01_02_1901', '修改记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592793326234'),
(550, '修改学期分班安排 学期：192002 学生：2018218034 班级S0001_A_01_02_1901', '修改记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592793343397'),
(551, '修改学期分班安排 学期：192002 学生：2018218041 班级S0001_A_01_02_1901', '修改记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592793368678'),
(552, '修改学期分班安排 学期：192002 学生：2018217041 班级S0001_A_01_02_1901', '修改记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592793377344'),
(553, '修改学期分班安排 学期：192002 学生：2018218034 班级S0001_A_01_02_1901', '修改记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592793399799'),
(554, '修改学期分班安排 学期：192002 学生：2018218034 班级S0001_A_01_02_1901', '修改记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592793406367'),
(555, '导入学期学生分班安排信息 操作人：2017217001', '添加记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592805775963'),
(556, '导入学期学生分班安排信息 操作人：2017217001', '添加记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592806372018'),
(557, '导入学期学生分班安排信息 操作人：2017217001', '添加记录', '学期分班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592807545524'),
(558, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592878552764'),
(559, '添加菜单 10019', '添加记录', '菜单模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592879087312'),
(560, '编辑权限组 D1', '修改记录', '权限组模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592879102732'),
(561, '编辑权限组 T10', '修改记录', '权限组模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592879106754'),
(562, '设置班主任信息 班级：2017217042 教师：S0001_A_01_01_1901 学期：192002 部门：S0001_A_01', '添加记录', '班主任设置模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592887251461'),
(563, '设置班主任信息 班级：2017217042 教师：S0001_A_01_02_1901 学期：192002 部门：S0001_A_01', '添加记录', '班主任设置模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592887327309'),
(564, '设置班主任信息 班级：2017217001 教师：S0001_A_01_01_1901 学期：192002 部门：S0001_A_01', '添加记录', '班主任设置模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592887394648'),
(565, '设置班主任信息 班级：2017217001 教师：S0001_A_01_01_1901 学期：192002 部门：S0001_A_01', '添加记录', '班主任设置模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592887431300'),
(566, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592893209748'),
(567, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592893215554'),
(568, '学期开班设置 学期: 192002', '修改记录', '学期开班模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592893221644'),
(569, '教师登录', '登录记录', '登录模块', '', '2017217001', '', 'chrome', '1592911977566'),
(570, '作业布置信息 学科：S0001_A_01_01_C002 班级：S0001_A_01_01_1901 日期：1592841600000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592913074063'),
(571, '作业布置信息 学科：S0001_A_01_01_C002 班级：S0001_A_01_01_1901 日期：1592841600000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592913295284'),
(572, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592956415419'),
(573, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592959798178'),
(574, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592959803546'),
(575, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592959868118'),
(576, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960167388'),
(577, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960187812'),
(578, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960196163'),
(579, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960291903'),
(580, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960312761'),
(581, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960331424'),
(582, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960430644'),
(583, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960479902'),
(584, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960494330'),
(585, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960541616'),
(586, '作业登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1592960567950'),
(587, '作业补充登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '112.97.56.7', '2017217001', '广东省深圳市', 'chrome', '1592964467801'),
(588, '作业补充登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '112.97.56.7', '2017217001', '广东省深圳市', 'chrome', '1592964471678'),
(589, '作业补充登记信息 作业：1 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '112.97.56.7', '2017217001', '广东省深圳市', 'chrome', '1592964480496'),
(590, '作业布置信息 学科：S0001_A_01_01_C002 班级：S0001_A_01_01_1901 日期：1592928000000', '添加记录', '作业模块', '112.97.63.204', '2017217001', '广东省深圳市', 'chrome', '1592978152349'),
(591, '教师登录', '登录记录', '登录模块', '120.229.33.62', '2017217001', 'CHINA', 'chrome', '1593052840012'),
(592, '教师登录', '登录记录', '登录模块', '120.229.33.53', '2017217001', 'CHINA', 'chrome', '1593132564112'),
(593, '教师登录', '登录记录', '登录模块', '', '2017217001', '', 'chrome', '1593220926349'),
(594, '作业布置信息编辑 学科：S0001_A_01_01_C002 班级：S0001_A_01_01_1901', '修改记录', '作业模块', '112.97.60.80', '2017217001', '广东省深圳市', 'chrome', '1593235139372'),
(595, '作业布置信息编辑 学科：S0001_A_01_01_C002 班级：S0001_A_01_01_1901', '修改记录', '作业模块', '112.97.60.80', '2017217001', '广东省深圳市', 'chrome', '1593235168730'),
(596, '删除作业 undefined', '删除记录', '作业模块', '112.97.60.80', '2017217001', '广东省深圳市', 'chrome', '1593235284107'),
(597, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593306069312'),
(598, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593349489968'),
(599, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593394219333'),
(600, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593394659791'),
(601, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593438642610'),
(602, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593482117310'),
(603, '添加宿舍考勤选项 T2', '添加记录', '宿舍考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593517986119'),
(604, '修改宿舍考勤选项 T2', '修改记录', '宿舍考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593518234313'),
(605, '添加宿舍考勤选项 T3', '添加记录', '宿舍考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593518304260'),
(606, '添加宿舍考勤选项 T4', '添加记录', '宿舍考勤选项模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593518316888'),
(607, '教师登录', '登录记录', '登录模块', '112.97.54.237', '2017217001', '广东省深圳市', 'chrome', '1593525687682'),
(608, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593571929274'),
(609, '课堂考勤登记 班级：undefined 时间：2020年7月1日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593582873306'),
(610, '课堂考勤登记 班级：undefined 时间：2020年7月1日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593582959011'),
(611, '课堂考勤登记 班级：undefined 时间：2020年7月1日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593582967736'),
(612, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605004040'),
(613, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605004729'),
(614, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605123292'),
(615, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605139352'),
(616, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605161155'),
(617, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605335403'),
(618, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605346321'),
(619, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605359456'),
(620, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605370828'),
(621, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605435189'),
(622, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605490246'),
(623, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605507007'),
(624, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605658034'),
(625, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605678984'),
(626, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605696426'),
(627, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593605781133'),
(628, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593606198930'),
(629, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593606286221'),
(630, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593606293066'),
(631, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593606302636'),
(632, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593606311760'),
(633, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593607654405'),
(634, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593608079164'),
(635, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593608079597'),
(636, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593608105464'),
(637, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593608178857'),
(638, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593608187647'),
(639, '教师登录', '登录记录', '登录模块', '112.97.51.158', '2017217001', '广东省深圳市', 'chrome', '1593615147175'),
(640, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593668225634'),
(641, '课堂考勤登记 班级：undefined 时间：2020年7月2日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593669540611'),
(642, '课堂考勤登记 班级：undefined 时间：2020年7月2日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593669545660'),
(643, '课堂考勤登记 班级：undefined 时间：2020年7月2日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593669552111'),
(644, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593673670411'),
(645, '课堂考勤登记 班级：undefined 时间：NaN年NaN月NaN日 节次undefined', '添加记录', '课堂考勤模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593673704891'),
(646, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593736708793'),
(647, '教师登录', '登录记录', '登录模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593786916941'),
(648, '教师登录', '登录记录', '登录模块', '112.97.50.174', '2017217001', '广东省深圳市', 'chrome', '1593831125993'),
(649, '课堂考勤登记 班级：undefined 时间：2020年7月4日 节次undefined', '添加记录', '课堂考勤模块', '112.97.50.174', '2017217001', '广东省深圳市', 'chrome', '1593833026134'),
(650, '教师登录', '登录记录', '登录模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593927600248'),
(651, '添加菜单 10006', '添加记录', '菜单模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593928207988'),
(652, '编辑权限组 D1', '修改记录', '权限组模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593928219792'),
(653, '编辑权限组 T10', '修改记录', '权限组模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593928224216'),
(654, '添加菜单 10006_1', '添加记录', '菜单模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593928591843'),
(655, '添加菜单 10006_2', '添加记录', '菜单模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593928661515'),
(656, '修改菜单 10006_1', '修改记录', '菜单模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593930080138'),
(657, '修改菜单 10006_2', '修改记录', '菜单模块', '113.90.238.44', '2017217001', '广东省深圳市', 'chrome', '1593930098758'),
(658, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1593995540035'),
(659, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1594039296238'),
(660, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1594082636720'),
(661, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1594165844847'),
(662, '教师登录', '登录记录', '登录模块', '61.144.170.174', '2017217001', '广东省深圳市', 'chrome', '1594277791411'),
(663, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594446284804'),
(664, '教师登录', '登录记录', '登录模块', '112.97.63.22', '2017217001', '广东省深圳市', 'chrome', '1594521674771'),
(665, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594568394152'),
(666, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594613310679'),
(667, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594967546381'),
(668, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594974193327'),
(669, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"维修\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594975025706}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975025741'),
(670, '修改支出类别信息 {\"id\":\"1\",\"type_id\":\"S0001_A_0001\",\"type_name\":\"采购啊手动阀\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217042\",\"addTime\":\"1587608927000\"}', '修改记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975409285'),
(671, '修改支出类别信息 {\"id\":\"1\",\"type_id\":\"S0001_A_0001\",\"type_name\":\"采购\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217042\",\"addTime\":\"1587608927000\"}', '修改记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975413138'),
(672, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"考察\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594975541733}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975541765'),
(673, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"教学仪器\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594975572514}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975572558'),
(674, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"阿斯顿发生\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594975766087}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975766118'),
(675, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"啊手动阀\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594975927359}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975927384'),
(676, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"asdf\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594975933618}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594975933640'),
(677, '删除支出类型信息 undefined', '删除记录', '支出类型模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594976383337'),
(678, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"考察\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594976409936}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594976409969'),
(679, '添加支出类别信息 {\"type_id\":\"S0001_A\",\"type_name\":\"教学仪器\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594976415308}', '添加记录', '支出类别模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594976415331'),
(680, '添加包含选项信息 {\"option_id\":\"S0001_A\",\"option_name\":\"含采购\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594985111780}', '添加记录', '包含选项模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594985111877'),
(681, '删除包含选项信息 undefined', '删除记录', '包含选项模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594985139379'),
(682, '添加包含选项信息 {\"option_id\":\"S0001_A\",\"option_name\":\"含接待\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1594985186976}', '添加记录', '包含选项模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594985187094'),
(683, '修改包含选项信息 {\"id\":\"2\",\"option_id\":\"S0001_A_O0002\",\"option_name\":\"含接待啊手动阀\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":\"1594985186976\"}', '修改记录', '包含选项模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594985223588'),
(684, '修改包含选项信息 {\"id\":\"2\",\"option_id\":\"S0001_A_O0002\",\"option_name\":\"含接待\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":\"1594985186976\"}', '修改记录', '包含选项模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1594985238471'),
(685, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595039379599'),
(686, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595048461965'),
(687, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595048471144'),
(688, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595048648837'),
(689, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595048672992'),
(690, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595049349222'),
(691, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595049376467'),
(692, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595049479987'),
(693, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595049483397'),
(694, '修改教师oa权限 教师: [\"2017217042\"]', '修改记录', 'oa权限设置模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595049488061'),
(695, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595085847427'),
(696, '添加组织架构信息 {\"organization_id\":\"\",\"organization_name\":\"信息部\",\"department\":\"S0001_A_01\",\"sponsor\":\"\",\"department_responsible\":\"\",\"course_responsible\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595120449203}', '添加记录', '组织架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595120449237'),
(697, '添加组织架构信息 {\"organization_id\":\"\",\"organization_name\":\"财经部\",\"department\":\"S0001_A_02\",\"sponsor\":\"\",\"department_responsible\":\"\",\"course_responsible\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595120469950}', '添加记录', '组织架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595120469982'),
(698, '添加组织架构信息 {\"organization_id\":\"\",\"organization_name\":\"商贸部\",\"department\":\"S0001_A_03\",\"sponsor\":\"\",\"department_responsible\":\"\",\"course_responsible\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595121648687}', '添加记录', '组织架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595121648717'),
(699, '添加组织架构信息 {\"organization_id\":\"\",\"organization_name\":\"艺术部\",\"department\":\"S0001_A_04\",\"sponsor\":\"\",\"department_responsible\":\"\",\"course_responsible\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595121659356}', '添加记录', '组织架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595121659399'),
(700, '添加组织架构信息 {\"organization_id\":\"\",\"organization_name\":\"啊手动阀\",\"department\":\"S0001_A_01\",\"sponsor\":\"\",\"department_responsible\":\"\",\"course_responsible\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595121686040}', '添加记录', '组织架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595121686060'),
(701, '修改组织架构信息 id:S0001_A_G0004', '添加记录', '修改架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595122346127'),
(702, '修改组织架构信息 id:S0001_A_G0004', '添加记录', '修改架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595122361977'),
(703, '修改组织架构信息 id:S0001_A_G0004', '添加记录', '修改架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595122369037'),
(704, '修改组织架构信息 id:S0001_A_G0004', '添加记录', '修改架构模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595122375642'),
(705, '设置发起人\"1\"', '修改记录', '组织架构模块', '112.97.56.219', '2017217001', '广东省深圳市', 'chrome', '1595126441396'),
(706, '设置部门负责人\"1\"', '修改记录', '组织架构模块', '112.97.56.219', '2017217001', '广东省深圳市', 'chrome', '1595126510739'),
(707, '设置课程负责人\"1\"', '修改记录', '组织架构模块', '112.97.56.219', '2017217001', '广东省深圳市', 'chrome', '1595126530579'),
(708, '删除组织架构信息 undefined', '删除记录', '组织架构模块', '112.97.56.219', '2017217001', '广东省深圳市', 'chrome', '1595126673021'),
(709, '教师登录', '登录记录', '登录模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595131282983'),
(710, '添加审批流程信息 {\"approval_id\":\"\",\"approval_name\":\"部门负责人意见\",\"approval_type\":\"分部设置\",\"approvers\":\"\",\"campus\":\"\",\"school\":\"\",\"created_user\":\"\",\"addTime\":1595135292558}', '添加记录', '审批流程模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595135292606'),
(711, '添加审批流程信息 {\"approval_id\":\"\",\"approval_name\":\"部门负责人意见\",\"approval_type\":\"分部设置\",\"approvers\":\"\",\"campus\":\"\",\"school\":\"\",\"created_user\":\"\",\"addTime\":1595135304876}', '添加记录', '审批流程模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595135304911'),
(712, '添加审批流程信息 {\"approval_id\":\"\",\"approval_name\":\"部门负责人意见\",\"approval_type\":\"分部设置\",\"approvers\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595135374283}', '添加记录', '审批流程模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595135374316'),
(713, '修改审批流程信息 {\"id\":\"1\",\"approval_id\":\"S0001_A_A0001\",\"approval_name\":\"部门负责人意见asdf \",\"approval_type\":\"分部设置\",\"approvers\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":\"1595135374283\"}', '修改记录', '审批流程模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595136318939'),
(714, '修改审批流程信息 {\"id\":\"1\",\"approval_id\":\"S0001_A_A0001\",\"approval_name\":\"部门负责人意见\",\"approval_type\":\"分部设置\",\"approvers\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":\"1595135374283\"}', '修改记录', '审批流程模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595136322483'),
(715, '添加审批流程信息 {\"approval_id\":\"\",\"approval_name\":\"分管财务副部长意见\",\"approval_type\":\"统一设置\",\"approvers\":\"\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595137799924}', '添加记录', '审批流程模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595137799952'),
(716, '设置审批人员信息undefined', '修改记录', '审批流程模块', '112.97.60.233', '2017217001', '广东省深圳市', 'chrome', '1595140421285'),
(717, '添加审批表单信息 {\"form_id\":\"\",\"form_name\":\"支装饮用水\",\"title\":\"深圳市宝安职业技术学校支装饮用水申请表\",\"alias\":\"饮用水\",\"unit\":\"箱\",\"authority\":\"权限组\",\"icon\":\"coffee\",\"content\":\"请填写用水原因，默认单位为24支/箱。\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595170870326}', '添加记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595170870356'),
(718, '添加审批表单信息 {\"form_id\":\"\",\"form_name\":\"支装饮用水\",\"title\":\"深圳市宝安职业技术学校支装饮用水申请表\",\"alias\":\"饮用水\",\"unit\":\"箱\",\"authority\":\"权限组\",\"icon\":\"coffee\",\"content\":\"请填写用水原因，默认单位为24支/箱。\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595170908739}', '添加记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595170908773'),
(719, '添加审批表单信息 {\"form_id\":\"\",\"form_name\":\"支装饮用水\",\"title\":\"深圳市宝安职业技术学校支装饮用水申请表\",\"alias\":\"饮用水\",\"unit\":\"箱\",\"authority\":\"权限组\",\"icon\":\"coffee\",\"content\":\"请填写用水原因，默认单位为24支/箱。\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595171035068}', '添加记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595171035177'),
(720, '添加审批表单信息 {\"form_id\":\"\",\"form_name\":\"支装饮用水\",\"title\":\"深圳市宝安职业技术学校支装饮用水申请表\",\"alias\":\"饮用水\",\"unit\":\"箱\",\"authority\":\"权限组\",\"icon\":\"coffee\",\"content\":\"请填写用水原因，默认单位为24支/箱。\",\"campus\":\"S0001_A\",\"school\":\"S0001\",\"created_user\":\"2017217001\",\"addTime\":1595171100361}', '添加记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595171100403'),
(721, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595215184813'),
(722, '修改审批表单信息 表单\"S0001_A_F0001\"', '修改记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595219043577'),
(723, '修改审批表单信息 表单\"S0001_A_F0001\"', '修改记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595219048111'),
(724, '设置审批流程信息undefined', '修改记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595221328463'),
(725, '修改审批表单状态 表单1', '修改记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595222756896'),
(726, '修改审批表单状态 表单1', '修改记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595222757673'),
(727, '修改审批表单状态 表单1', '修改记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595222769057'),
(728, '修改审批表单状态 表单1', '修改记录', '审批表单模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595222769758'),
(729, '教师登录', '登录记录', '登录模块', '119.136.113.191', '2017217001', '广东省深圳市', 'chrome', '1595258396952'),
(730, '设置审批流程信息undefined', '修改记录', '审批表单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595301700346'),
(731, '教师登录', '登录记录', '登录模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595301703691'),
(732, '设置审批流程信息undefined', '修改记录', '审批表单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595301710241'),
(733, '设置审批流程信息undefined', '修改记录', '审批表单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595301724355'),
(734, '设置审批流程信息\"S0001_A_F0001\"', '修改记录', '审批流程模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595303765280'),
(735, '设置审批流程信息\"S0001_A_F0001\"', '修改记录', '审批流程模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595303769401'),
(736, '设置审批流程信息\"S0001_A_F0001\"', '修改记录', '审批流程模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595303784716'),
(737, '添加菜单 10072_4', '添加记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595340395470'),
(738, '学生登录', '登录记录', '登录模块', '113.110.167.174', '2017217041', '广东省深圳市', 'chrome', '1595388105204'),
(739, '教师登录', '登录记录', '登录模块', '113.110.167.174', '2017217041', '广东省深圳市', 'chrome', '1595388950398'),
(740, '教师登录', '登录记录', '登录模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595471170186'),
(741, '修改菜单 10076', '修改记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595471471718'),
(742, '编辑权限组 D1', '修改记录', '权限组模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595471506189'),
(743, '编辑权限组 T10', '修改记录', '权限组模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595471509550'),
(744, '修改菜单 10072', '修改记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595471541996'),
(745, '添加菜单 10076_1', '添加记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595472195795'),
(746, '添加菜单 10076_2', '添加记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595472219856'),
(747, '添加证书类型信息 全国计算机一级证书（MS Office）', '添加记录', '专业证书模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595475826823'),
(748, '添加证书类型信息 全国计算机一级证书（WPS Office）', '添加记录', '专业证书模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595475867870'),
(749, '修改证书类型信息 2', '修改记录', '专业证书模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595476269763'),
(750, '修改证书类型信息 2', '修改记录', '专业证书模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595476273299'),
(751, '添加菜单 10007', '添加记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595481609414'),
(752, '编辑权限组 D1', '修改记录', '权限组模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595481618104'),
(753, '编辑权限组 T10', '修改记录', '权限组模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595481621102'),
(754, '添加菜单 10007_1', '添加记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595483081028'),
(755, '添加菜单 10007_2', '添加记录', '菜单模块', '113.110.167.174', '2017217001', '广东省深圳市', 'chrome', '1595483113539'),
(756, '教师登录', '登录记录', '登录模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1597235564938'),
(757, '学生登录', '登录记录', '登录模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1597235884790'),
(758, '教师登录', '登录记录', '登录模块', '113.110.166.59', '2017217001', '广东省深圳市', 'chrome', '1597235922254'),
(759, '教师登录', '登录记录', '登录模块', '113.110.166.59', '2017217040', '广东省深圳市', 'chrome', '1597235961820'),
(760, '教师登录', '登录记录', '登录模块', '113.88.116.167', '2017217001', '广东省深圳市', 'chrome', '1598361175366'),
(761, '教师登录', '登录记录', '登录模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599118802880'),
(762, '设置当前学期 202101', '修改记录', '学期模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119072863'),
(763, '学期开课设置 学期: 202101', '修改记录', '学期开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119096103'),
(764, '学期开班设置 学期: 202101', '修改记录', '学期开班模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119108700'),
(765, '班级开课设置 学期:202101 班级: S0001_A_01_01_1801', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119118835'),
(766, '班级开课设置 学期:202101 班级: S0001_A_01_01_1902', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119128507'),
(767, '班级开课设置 学期:202101 班级: S0001_A_01_01_1801', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119220345'),
(768, '班级开课设置 学期:202101 班级: S0001_A_01_01_1801', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119346197'),
(769, '班级开课设置 学期:202101 班级: S0001_A_01_01_1902', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599119359810'),
(770, '教师登录', '登录记录', '登录模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599187569033'),
(771, '班级开课设置 学期:202101 班级: S0001_A_01_01_1801', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599187597109'),
(772, '班级开课设置 学期:202101 班级: S0001_A_01_01_1801', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599187886601'),
(773, '设置当前学期 192002', '修改记录', '学期模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188004974'),
(774, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188013959'),
(775, '班级开课设置 学期:192002 班级: S0001_A_01_01_1902', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188024279'),
(776, '学期开课设置 学期: 192002', '修改记录', '学期开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188056511'),
(777, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188067072'),
(778, '班级开课设置 学期:192002 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188144445'),
(779, '设置当前学期 202101', '修改记录', '学期模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188250756'),
(780, '班级开课设置 学期:202101 班级: S0001_A_01_01_1801', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188290781'),
(781, '班级开课设置 学期:202101 班级: S0001_A_01_01_1901', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188305217'),
(782, '班级开课设置 学期:202101 班级: S0001_A_01_01_1902', '修改记录', '班级开课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188309408'),
(783, '教师排课设置 学期:202101 班级: S0001_A_01_01_1801', '修改记录', '教师排课模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599188753688'),
(784, '添加学生档案 学生：2018218040', '添加记录', '学生库模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599189044315'),
(785, '添加学生档案 学生：2018218041', '添加记录', '学生库模块', '113.90.237.120', '2017217001', '广东省深圳市', 'chrome', '1599189392699'),
(786, '教师登录', '登录记录', '登录模块', '113.118.47.125', '2017217001', '广东省深圳市', 'chrome', '1599316438160'),
(787, '设置班主任信息 班级：2017217001 教师：S0001_A_01_01_1801 学期：202101 部门：S0001_A_01', '添加记录', '班主任设置模块', '113.118.47.125', '2017217001', '广东省深圳市', 'chrome', '1599316712119'),
(788, '设置班主任信息 班级：2017217042 教师：S0001_A_01_01_1901 学期：202101 部门：S0001_A_01', '添加记录', '班主任设置模块', '113.118.47.125', '2017217001', '广东省深圳市', 'chrome', '1599316716530'),
(789, '管理员登录', '登录记录', '登录模块', '113.118.47.125', '2017217001', '广东省深圳市', 'chrome', '1599316935872'),
(790, '编辑学期信息 202101', '修改记录', '学期模块', '113.118.47.125', '2017217001', '广东省深圳市', 'chrome', '1599316959901'),
(791, '编辑学期信息 202101', '修改记录', '学期模块', '113.118.47.125', '2017217001', '广东省深圳市', 'chrome', '1599316965545'),
(792, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599446528779'),
(793, '管理员登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599449771724'),
(794, '管理员登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599449780434'),
(795, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217042', '广东省深圳市', 'chrome', '1599450118804'),
(796, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1599450644460'),
(797, '课间操考勤登记 班级：S0001_A_01_01_1801 时间：2020年9月7日', '添加记录', '课间操考勤模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599459158125'),
(798, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599460529676'),
(799, '教师登录', '登录记录', '登录模块', '', '2017217001', '', 'chrome', '1599548265757'),
(800, '设置当前学期 192002', '修改记录', '学期模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548333321'),
(801, '设置当前学期 202101', '修改记录', '学期模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548334272'),
(802, '修改年级信息 2019', '修改记录', '年级模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548343946'),
(803, '修改年级信息 2019', '修改记录', '年级模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548348288'),
(804, '课堂考勤登记 班级：S0001_A_01_01_1801 时间：2020年9月8日 节次ZX2', '添加记录', '课堂考勤模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548497922');
INSERT INTO `system_log` (`id`, `log_content`, `log_type`, `log_model`, `log_ip`, `log_user`, `log_area`, `log_brower`, `addTime`) VALUES
(805, '早段考勤登记 班级：S0001_A_01_01_1801 时间：2020年9月8日', '添加记录', '早段考勤模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548502523'),
(806, '课间操考勤登记 班级：S0001_A_01_01_1801 时间：2020年9月8日', '添加记录', '课间操考勤模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548517246'),
(807, '黑板报卫生登记 班级：S0001_A_01_02_1901 时间：1599494400000', '添加记录', '黑板报卫生登记模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599548546456'),
(808, '课室卫生登记 班级：S0001_A_01_01_1801 时间：1599494400000', '添加记录', '课室卫生登记模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599549171671'),
(809, '课室卫生登记 班级：S0001_A_01_01_1901 时间：1599494400000', '添加记录', '课室卫生登记模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599549182703'),
(810, '黑板报卫生登记 班级：S0001_A_01_01_1801 时间：1599494400000', '添加记录', '黑板报卫生登记模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599549188562'),
(811, '学生登录', '登录记录', '登录模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599550926906'),
(812, '学生登录', '登录记录', '登录模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599550994536'),
(813, '教师登录', '登录记录', '登录模块', '112.97.54.154', '2017217041', '广东省深圳市', 'chrome', '1599551483125'),
(814, '管理员登录', '登录记录', '登录模块', '112.97.54.154', '2017217001', '广东省深圳市', 'chrome', '1599552123554'),
(815, '学生登录', '登录记录', '登录模块', '112.97.54.154', '2017217042', '广东省深圳市', 'chrome', '1599552687682'),
(816, '教师登录', '登录记录', '登录模块', '112.97.54.154', '2017217041', '广东省深圳市', 'chrome', '1599552724051'),
(817, '添加菜单 10008', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599570000721'),
(818, '添加菜单 10008_1', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599570087626'),
(819, '添加菜单 10008_2', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599570658587'),
(820, '添加菜单 10008_3', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599573303164'),
(821, '添加菜单 10008_4', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599573340166'),
(822, '编辑权限组 T10', '修改记录', '权限组模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599573349292'),
(823, '编辑权限组 D1', '修改记录', '权限组模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599573358523'),
(824, '教师登录', '登录记录', '登录模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599622553632'),
(825, '添加菜单 10077', '添加记录', '菜单模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599623204143'),
(826, '添加菜单 10077_1', '添加记录', '菜单模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599623283911'),
(827, '添加菜单 10077_2', '添加记录', '菜单模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599623333188'),
(828, '编辑权限组 D1', '修改记录', '权限组模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599623345088'),
(829, '编辑权限组 T10', '修改记录', '权限组模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599623349813'),
(830, '添加菜单 10008_5', '添加记录', '菜单模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599661876411'),
(831, '教师登录', '登录记录', '登录模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599708394782'),
(832, '添加奖惩信息 学期：202101 学生：2018218041 选项R4', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599715620224'),
(833, '添加奖惩信息 学期：202101 学生：2018218041 选项R4', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599715743298'),
(834, '添加奖惩信息 学期：202101 学生：2018218041 选项R4', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599715803170'),
(835, '添加奖惩信息 学期：202101 学生：2018218041 选项R4', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599715872160'),
(836, '添加奖惩信息 学期：202101 学生：2018218041 选项R2', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599715889250'),
(837, '添加奖惩信息 学期：202101 学生：2018218041 选项R4', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599716050369'),
(838, '修改奖惩信息 学期：undefined 学生：许小某 选项R4', '修改记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599717916157'),
(839, '修改奖惩信息 学期：undefined 学生：2018218041 选项R2', '修改记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599718309262'),
(840, '修改奖惩信息 学期：undefined 学生：2018218040 选项R4', '修改记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599718326871'),
(841, '添加奖惩信息 学期：202101 学生：2018218040 选项R1', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599719742041'),
(842, '添加奖惩信息 学期：202101 学生：2018218041 选项R2', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599721301268'),
(843, '添加奖惩信息 学期：202101 学生：2018218040 选项R2', '添加记录', '奖惩管理模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599721553652'),
(844, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726023989'),
(845, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726050966'),
(846, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726071608'),
(847, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726109059'),
(848, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726159076'),
(849, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726349958'),
(850, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726606998'),
(851, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726633351'),
(852, '导入课程信息', '添加记录', '课程模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599726725874'),
(853, '学期开班设置 学期: 202101', '修改记录', '学期开班模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599735809644'),
(854, '学期开班设置 学期: 202101', '修改记录', '学期开班模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599735828822'),
(855, '学期开班设置 学期: 202101', '修改记录', '学期开班模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599735836288'),
(856, '作业布置信息 学科：S0001_A_01_01_C003 班级：S0001_A_01_01_1801 日期：1599667200000', '添加记录', '作业模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599736111189'),
(857, '教师登录', '登录记录', '登录模块', '113.88.117.149', '2017217001', '广东省深圳市', 'chrome', '1599752334759'),
(858, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599795606198'),
(859, '政教处督查填写 学期：202101 日期：1599803663077', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599803663077'),
(860, '政教处督查填写 学期：202101 日期：1599803716255', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599803716255'),
(861, '政教处督查填写 学期：202101 日期：1599803913726', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599803913727'),
(862, '政教处督查填写 学期：202101 日期：1599803977872', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599803977872'),
(863, '政教处督查填写 学期：202101 日期：1599803986779', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599803986779'),
(864, '政教处督查填写 学期：202101 日期：1599804091953', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599804091953'),
(865, '政教处督查填写 学期：202101 日期：1599804469940', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599804469941'),
(866, '政教处督查填写 学期：202101 日期：1599804504600', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599804504600'),
(867, '政教处督查填写 学期：202101 日期：1599804504975', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599804504975'),
(868, '政教处督查填写 学期：202101 日期：1599804537875', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599804537875'),
(869, '政教处督查填写 学期：202101 日期：1599804818965', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599804818965'),
(870, '政教处督查填写 学期：202101 日期：1599804984143', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599804984143'),
(871, '政教处督查填写 学期：202101 日期：1599805007721', '修改记录', '政教处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599805007721'),
(872, '教务处督查填写 学期：202101 日期：1599813434760', '添加记录', '教务处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599813434760'),
(873, '教务处督查填写 学期：202101 日期：1599813776127', '修改记录', '教务处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599813776128'),
(874, '教务处督查填写 学期：202101 日期：1599814468435', '修改记录', '教务处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599814468436'),
(875, '修改菜单 10008_3', '修改记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599815757305'),
(876, '添加菜单 10008_3_1', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599815783419'),
(877, '添加菜单 10008_3_2', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599815837977'),
(878, '添加实习场所信息 学期：undefined 部门：S0001_A_01 场所添加实习场所信息', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599830039206'),
(879, '添加实习场所信息 学期：undefined 部门：S0001_A_02 场所机电一体化（东三楼）', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831073511'),
(880, '添加实习场所信息 学期：undefined 部门：S0001_A_02 场所机电一体化（东三楼）', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831078579'),
(881, '添加实习场所信息 学期：undefined 部门：S0001_A_04 场所机电一体化（东三楼）', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831126983'),
(882, '添加实习场所信息 学期：undefined 部门：S0001_A_04 场所机电一体化（东三楼）', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831161847'),
(883, '添加实习场所信息 学期：undefined 部门：S0001_A_02 场所机电一体化（东三楼）', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831176275'),
(884, '添加实习场所信息 学期：undefined 部门：S0001_A_01 场所机电一体化（东三楼）', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831299499'),
(885, '添加实习场所信息 学期：undefined 部门：S0001_A_03 场所计算机实训基地(办公楼二楼)', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831429146'),
(886, '添加实习场所信息 学期：undefined 部门：S0001_A_04 场所舞蹈室、琴房（办公楼一楼）', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831453787'),
(887, '添加实习场所信息 学期：undefined 部门：S0001_A_01 场所123123', '添加记录', '实习场所管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599831460955'),
(888, '实习处督查填写 学期：202101 日期：1599837268649', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837268649'),
(889, '实习处督查填写 学期：202101 日期：1599837489739', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837489739'),
(890, '实习处督查填写 学期：202101 日期：1599837622418', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837622418'),
(891, '实习处督查填写 学期：202101 日期：1599837655365', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837655365'),
(892, '实习处督查填写 学期：202101 日期：1599837682204', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837682204'),
(893, '实习处督查填写 学期：202101 日期：1599837813089', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837813089'),
(894, '实习处督查填写 学期：202101 日期：1599837833291', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837833291'),
(895, '实习处督查填写 学期：202101 日期：1599837879272', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837879272'),
(896, '实习处督查填写 学期：202101 日期：1599837896550', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599837896550'),
(897, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880576403'),
(898, '实习处督查填写 学期：202101 日期：1599880645401', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880645401'),
(899, '实习处督查填写 学期：202101 日期：1599880669597', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880669597'),
(900, '实习处督查填写 学期：202101 日期：1599880700111', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880700112'),
(901, '实习处督查填写 学期：202101 日期：1599880784418', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880784418'),
(902, '实习处督查填写 学期：202101 日期：1599880849328', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880849328'),
(903, '实习处督查填写 学期：202101 日期：1599880873382', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880873383'),
(904, '实习处督查填写 学期：202101 日期：1599880899776', '添加记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599880899776'),
(905, '实习处督查修改 学期：202101 日期：1599882034106', '修改记录', '实习处督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599882034106'),
(906, '修改菜单 10008_4', '修改记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599889597581'),
(907, '添加菜单 10008_4_1', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599889681328'),
(908, '添加菜单 10008_4_2', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599889696917'),
(909, '修改菜单 10008_4_1', '修改记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599889861950'),
(910, '修改菜单 10008_4_2', '修改记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599889876285'),
(911, '添加大赛专业信息 学期：undefined 部门：S0001_A_01 专业：通用机电设备安装与维护', '添加记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894111477'),
(912, '修改大赛专业信息 学期：undefined 部门：S0001_A_02 专业：通用机电设备安装与维护', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894411248'),
(913, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：通用机电设备安装与维护', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894416247'),
(914, '添加大赛专业信息 学期：undefined 部门：S0001_A_01 专业：电气安装与维修', '添加记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894459412'),
(915, '添加大赛专业信息 学期：undefined 部门：S0001_A_01 专业：机电一体化', '添加记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894473754'),
(916, '添加大赛专业信息 学期：undefined 部门：S0001_A_01 专业：工业机器人', '添加记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894490722'),
(917, '添加大赛专业信息 学期：undefined 部门：S0001_A_02 专业：会计手工', '添加记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894507221'),
(918, '添加大赛专业信息 学期：undefined 部门：S0001_A_02 专业：会计电算化', '添加记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894524853'),
(919, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：动画制作', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894558410'),
(920, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：网络搭建', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894568930'),
(921, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：工业产品设计', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894582515'),
(922, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：3D打印', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599894591842'),
(923, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：动画制作', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599899923943'),
(924, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：动画制作', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599899958125'),
(925, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：网络搭建', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599899967605'),
(926, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：工业产品设计', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599899973392'),
(927, '修改大赛专业信息 学期：undefined 部门：S0001_A_01 专业：3D打印', '修改记录', '大赛专业管理模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599899979651'),
(928, '大赛办督查填写 学期：202101 日期：1599900075231', '添加记录', '大赛办督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599900075232'),
(929, '大赛办督查填写 学期：202101 日期：1599900136765', '添加记录', '大赛办督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599900136765'),
(930, '大赛办督查修改 学期：202101 日期：1599900940315', '修改记录', '大赛办督查', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599900940316'),
(931, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599966539233'),
(932, '作业布置信息 学科：undefined 班级：undefined 日期：1599926400000', '添加记录', '作业模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599967113267'),
(933, '添加事务信息：今天中午我要吃三头牛 日期：1599926400000', '添加记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599969267714'),
(934, '添加事务信息：今天中午我要吃三头牛 日期：1599926400000', '添加记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599969299715'),
(935, '添加事务信息：add 日期：1599926400000', '添加记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599969370696'),
(936, '添加事务信息：明天收班费 日期：1600012800000', '添加记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599970057182'),
(937, '添加事务信息：下午去一趟校长办公室 日期：1599926400000', '添加记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599970141363'),
(938, '修改事务信息：今天中午我要吃三头牛 日期：1599926400000', '修改记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599971015192'),
(939, '修改事务信息：今天中午我要吃三头牛 日期：1599926400000', '修改记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599971056461'),
(940, '修改事务信息：今天中午我要吃三头牛 日期：1599926400000', '修改记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599971088569'),
(941, '修改考勤选项 T2', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975774129'),
(942, '修改考勤选项 T3', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975778837'),
(943, '修改考勤选项 T6', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975859178'),
(944, '修改考勤选项 T7', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975865891'),
(945, '修改考勤选项 T9', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975871194'),
(946, '修改考勤选项 T13', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975879099'),
(947, '修改考勤选项 T14', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975883382'),
(948, '修改考勤选项 T15', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975887778'),
(949, '修改考勤选项 T16', '修改记录', '考勤选项模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599975891943'),
(950, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1599976830233'),
(951, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1600005015500'),
(952, '添加事务信息：备课 日期：1600012800000', '添加记录', '事务模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600007626788'),
(953, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600054604019'),
(954, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600055624569'),
(955, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600055661580'),
(956, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600055737015'),
(957, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1600056183658'),
(958, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600058893746'),
(959, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1600059182791'),
(960, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600059256534'),
(961, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1600059289443'),
(962, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600059672208'),
(963, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1600062469834'),
(964, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600065029792'),
(965, '添加菜单 10072_4', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600065130457'),
(966, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600069166780'),
(967, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1600072027759'),
(968, '选择审批流程undefined', '修改记录', '审批表单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600091517675'),
(969, '设置审批流程信息\"S0001_A_F0001\"', '修改记录', '审批流程模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600091523395'),
(970, '学生登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600092327567'),
(971, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217041', '广东省深圳市', 'chrome', '1600094398878'),
(972, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600139284169'),
(973, '导入课程信息', '添加记录', '课程模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600150751407'),
(974, '导入课程信息', '添加记录', '课程模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600151154619'),
(975, '导入课程信息', '添加记录', '课程模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600153609125'),
(976, '导入课程信息', '添加记录', '课程模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600155573364'),
(977, '导入课程信息', '添加记录', '课程模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600156592030'),
(978, '导入课程信息', '添加记录', '课程模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600156633397'),
(979, '删除学生成绩信息导入记录', '删除记录', '成绩导入模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600161473201'),
(980, '导入学生成绩信息', '添加记录', '成绩导入模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600161487412'),
(981, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600218060259'),
(982, '添加菜单 10031_1', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600218480680'),
(983, '添加菜单 10031_2', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600218503820'),
(984, '添加菜单 10063_1', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600225777443'),
(985, '添加菜单 10063_2', '添加记录', '菜单模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600225802001'),
(986, '导入学生成绩信息', '添加记录', '成绩导入模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600244684822'),
(987, '导入学生成绩信息', '添加记录', '成绩导入模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600244695109'),
(988, '导入学生成绩信息', '添加记录', '成绩导入模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600244741149'),
(989, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600312052568'),
(990, '教师登录', '登录记录', '登录模块', '', '2017217001', '', 'firefox', '1600321926369'),
(991, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600356636938'),
(992, '教师登录', '登录记录', '登录模块', '113.110.164.95', '2017217001', '广东省深圳市', 'chrome', '1600435918377'),
(993, '教师登录', '登录记录', '登录模块', '113.118.46.93', '2017217001', '广东省深圳市', 'chrome', '1600479410811'),
(994, '教师登录', '登录记录', '登录模块', '113.118.46.93', '2017217001', '广东省深圳市', 'chrome', '1600563921325'),
(995, '教师登录', '登录记录', '登录模块', '119.136.112.128', '2017217001', '广东省深圳市', 'chrome', '1600662925039'),
(996, '删除学生成绩信息导入记录', '删除记录', '成绩导入模块', '119.136.112.128', '2017217001', '广东省深圳市', 'chrome', '1600666194405'),
(997, '删除学生成绩信息导入记录', '删除记录', '成绩导入模块', '119.136.112.128', '2017217001', '广东省深圳市', 'chrome', '1600670045151'),
(998, '删除通知记录', '删除记录', '通知模块', '119.136.112.128', '2017217001', '广东省深圳市', 'chrome', '1600670145672'),
(999, '教师登录', '登录记录', '登录模块', '113.110.164.11', '2017217001', '广东省深圳市', 'chrome', '1600737787685'),
(1000, '学生登录', '登录记录', '登录模块', '113.110.164.11', '2017217001', '广东省深圳市', 'chrome', '1600739977421'),
(1001, '教师登录', '登录记录', '登录模块', '113.110.164.11', '2017217041', '广东省深圳市', 'chrome', '1600776482290'),
(1002, '作业布置信息 学科：S0001_A_01_01_C002 班级：S0001_A_01_01_1901 日期：1600704000000', '添加记录', '作业模块', '113.110.164.11', '2017217001', '广东省深圳市', 'chrome', '1600776682130'),
(1003, '学生登录', '登录记录', '登录模块', '113.110.164.11', '2017217001', '广东省深圳市', 'chrome', '1600776700728'),
(1004, '教师登录', '登录记录', '登录模块', '113.110.164.11', '2017217041', '广东省深圳市', 'chrome', '1600783458399'),
(1005, '教师登录', '登录记录', '登录模块', '113.110.164.11', '2017217001', '广东省深圳市', 'chrome', '1600829015255'),
(1006, '学生登录', '登录记录', '登录模块', '113.110.164.11', '2017217001', '广东省深圳市', 'chrome', '1600836436475'),
(1007, '学生登录', '登录记录', '登录模块', '113.110.164.11', '2017217001', '广东省深圳市', 'chrome', '1600836455770'),
(1008, '管理员登录', '登录记录', '登录模块', '112.96.69.161', '2017217042', '广东省广州市', 'chrome', '1615863620158');

-- --------------------------------------------------------

--
-- 表的结构 `system_nav`
--

CREATE TABLE `system_nav` (
  `id` int NOT NULL COMMENT '行号',
  `nav_id` varchar(16) NOT NULL COMMENT '菜单编号',
  `nav_name` varchar(26) NOT NULL COMMENT '菜单名称',
  `nav_up_id` varchar(50) NOT NULL COMMENT '上级菜单id',
  `nav_lever` int NOT NULL COMMENT '菜单级别',
  `nav_group` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '导航组别',
  `nav_url` varchar(80) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '菜单文件名',
  `nav_state` int NOT NULL COMMENT '状态',
  `nav_time` date NOT NULL COMMENT '日期',
  `nav_memo` varchar(16) NOT NULL COMMENT '备注',
  `icon` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '图标'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `system_nav`
--

INSERT INTO `system_nav` (`id`, `nav_id`, `nav_name`, `nav_up_id`, `nav_lever`, `nav_group`, `nav_url`, `nav_state`, `nav_time`, `nav_memo`, `icon`) VALUES
(1, '1009', '系统设置', '0', 1, '010', '', 1, '2019-11-07', '1', ''),
(2, '10091', '菜单管理', '1009', 2, '', '/management/system/menu', 1, '2019-11-07', '1', 'more'),
(3, '10093', '权限设置', '1009', 2, '', '/management/system/authority', 1, '2020-12-29', '1', 's-tools'),
(4, '1006', '教师管理', '0', 1, '007', '', 1, '2020-01-02', '1', ''),
(5, '10061', '入职登记', '1006', 2, '', '/management/teaset/onboarding', 1, '2020-01-02', '1', 's-promotion'),
(6, '10092', '用户管理', '1009', 2, '', '/management/system/user', 1, '2020-01-08', '1', 'user'),
(7, '10062', '教师档案', '1006', 2, '', '/management/teaset/teacherinfo', 1, '2020-01-29', '1', 's-finance'),
(8, '1008', '基础设置', '0', 1, '009', '', 1, '2020-01-29', '1', ''),
(9, '10081', '学期管理', '1008', 2, '', '/management/base/semester', 1, '2020-01-29', '1', 'c-scale-to-original'),
(10, '10082', '年级管理', '1008', 2, '', '/management/base/grade', 1, '2020-01-29', '1', 's-flag'),
(11, '10083', '专业管理', '1008', 2, '', '/management/base/skill', 1, '2020-01-29', '1', 's-platform'),
(12, '10084', '课程管理', '1008', 2, '', '/management/base/course', 1, '2020-01-29', '1', 'info'),
(13, '10085', '教学楼管理', '1008', 2, '', '/management/base/build', 1, '2020-01-29', '1', 'collection-tag'),
(14, '10086', '教室管理', '1008', 2, '', '/management/base/classroom', 1, '2020-01-29', '1', 'suitcase'),
(15, '10087', '班级管理', '1008', 2, '', '/management/base/class', 1, '2020-01-29', '1', 'collection'),
(16, '10063', '绩效填报', '1006', 2, '', '/management/teaset/performance_report', 1, '2020-01-29', '1', 'edit'),
(17, '1001', '教学工作', '0', 1, '001', '', 1, '2020-01-29', '1', ''),
(18, '10015', '听课评课', '1001', 2, '', '/management/teach/evaluation', 1, '2020-01-29', '1', 'star-on'),
(19, '10011', '班级排课', '1001', 2, '', '/management/teach/class_schedule', 1, '2020-01-29', '1', 's-claim'),
(20, '10013', '请假代课', '1001', 2, '', '/management/teach/leave', 1, '2020-01-29', '1', 's-release'),
(21, '10014', '巡课查课', '1001', 2, '', '/management/teach/patrol', 1, '2020-01-29', '1', 's-opportunity'),
(22, '1007', '学生管理', '0', 1, '006', '', 1, '2020-01-29', '1', ''),
(23, '10071', '学期分班', '1007', 2, '', '/management/stuset/placement', 1, '2020-01-29', '1', 'monitor'),
(25, '1002', '宿舍管理', '0', 1, '003', '', 1, '2020-01-29', '1', ''),
(26, '10021', '宿舍安排', '1002', 2, '', '/management/dormitory/dormAgm', 1, '2020-01-29', '1', 's-home'),
(27, '10022', '宿舍巡查', '1002', 2, '', '/management/dormitory/patrol', 1, '2020-01-29', '1', 's-shop'),
(28, '1003', '财务管理', '0', 1, '004', '', 1, '2020-01-29', '1', ''),
(29, '10031', '工资发放', '1003', 2, '', '/management/finance/wage', 1, '2020-01-29', '1', 's-goods'),
(30, '10032', '收支明细', '1003', 2, '', '/management/finance/revenue', 1, '2020-01-29', '1', 'document-remove'),
(31, '1004', '校产管理', '0', 1, '008', '', 1, '2020-01-29', '1', ''),
(32, '10041', '采购盘点', '1004', 2, '', '/management/property/purchase', 1, '2020-01-29', '1', 'shopping-cart-full'),
(33, '10042', '领用借用', '1004', 2, '', '/management/property/borrow', 1, '2020-01-29', '1', 'box'),
(34, '10043', '校产报废', '1004', 2, '', '/management/property/scrapped', 1, '2020-01-29', '1', 'files'),
(35, '1005', '办公OA', '0', 1, '005', '', 1, '2020-01-29', '1', ''),
(36, '10051', '表单设置', '1005', 2, '', '/management/office/form', 1, '2020-01-29', '1', 'date'),
(37, '10053', '流程设置', '1005', 2, '', '/management/office/process', 1, '2020-01-29', '1', 's-marketing'),
(38, '10054', 'OA审批', '1005', 2, '', '/management/office/oa_approval', 1, '2020-01-29', '1', 'discount'),
(39, '10055', 'OA发起', '1005', 2, '', '/management/office/oa_initiated', 1, '2020-01-29', '1', 's-custom'),
(40, '10074', '成绩填报', '1007', 2, '', '/management/stuset/score_report', 1, '2020-01-30', '1', 'document-add'),
(41, '10088', '学校设置', '1008', 2, '', '/management/base/school', 1, '2020-01-30', '1', 'house'),
(42, '10089', '系部设置', '1008', 2, '', '/management/base/department', 1, '2020-01-30', '1', 'news'),
(44, '10073', '考勤管理', '1007', 2, '', '/management/stuset/attendance', 1, '2020-02-01', '1', 'coordinate'),
(46, '10075', '成绩汇总', '1007', 2, '', '/management/stuset/score_summary', 1, '2020-02-15', '1', 'tickets'),
(45, '10012', '教师排课', '1001', 2, '', '/management/teach/teacher_schedule', 1, '2020-02-07', '1', 'user-solid'),
(47, '10064', '绩效汇总', '1006', 2, '', '/management/teaset/performance_summary', 1, '2020-02-17', '1', 'document-copy'),
(48, '10072', '学生档案', '1007', 2, '', '/management/stuset/stuinfo', 1, '2020-02-20', '1', 's-order'),
(49, '10023', '宿舍楼管理', '1002', 2, '', '/management/dormitory/build', 1, '2020-03-04', '1', 's-open'),
(50, '10024', '宿舍管理', '1002', 2, '', '/management/dormitory/dormMgm', 1, '2020-03-04', '1', 'school'),
(51, '10016', '学期开课', '1001', 2, '', '/management/teach/semesterCourse', 1, '2020-04-09', '1', 's-grid'),
(52, '10017', '班级开课', '1001', 2, '', '/management/teach/classCourse', 1, '2020-04-09', '1', 'menu'),
(53, '1000', '校务管理', '0', 1, '002', '', 1, '2020-04-13', '1', ''),
(54, '10001', '课程管理', '1000', 2, '', '/management/commonly/classtable', 1, '2020-04-13', '1', 'date'),
(55, '10002', '每日考勤', '1000', 2, '', '/management/commonly/attendance', 1, '2020-04-13', '1', 'document-checked'),
(56, '10003', '作业管理', '1000', 2, '', '/management/commonly/homework', 1, '2020-04-13', '1', 'edit'),
(57, '10004', '宿舍登记', '1000', 2, '', '/management/commonly/dormroom', 1, '2020-04-13', '1', 'house'),
(58, '10013_1', '课务调整', '10013', 3, '', '', 1, '2020-04-13', '1', ''),
(59, '10013_1_1', '调课查询', '10013_1', 4, '', '/management/teach/leave/altersel', 1, '2020-04-13', '1', ''),
(60, '10013_1_2', '在线调课', '10013_1', 4, '', '/management/teach/leave/alterclass', 1, '2020-04-13', '1', ''),
(61, '10001_1', '课表查询', '10001', 3, '', '', 1, '2020-04-13', '1', ''),
(62, '10001_1_1', '总课表', '10001_1', 4, '', '/management/commonly/classtable/moreclass', 1, '2020-04-13', '1', ''),
(63, '10001_1_2', '班级课表', '10001_1', 4, '', '/management/commonly/classtable/classroomclass', 1, '2020-04-13', '1', ''),
(64, '10001_1_3', '教师课表', '10001_1', 4, '', '/management/commonly/classtable/teacherclass', 1, '2020-04-13', '1', ''),
(65, '10001_1_4', '课室课表', '10001_1', 4, '', '/management/commonly/classtable/buildclass', 1, '2020-04-13', '1', ''),
(66, '10001_1_5', '作息时间', '10001_1', 4, '', '/management/commonly/classtable/workrest', 1, '2020-04-13', '1', ''),
(67, '10003_1', '作业管理', '10003', 3, '', '', 1, '2020-04-14', '1', ''),
(68, '10003_1_1', '布置作业', '10003_1', 4, '', '/management/commonly/homework/layout', 1, '2020-04-14', '1', ''),
(69, '10003_1_2', '作业登记', '10003_1', 4, '', '/management/commonly/homework/register', 1, '2020-04-14', '1', ''),
(70, '10003_1_3', '查询作业', '10003_1', 4, '', '/management/commonly/homework/selhw', 1, '2020-04-14', '1', ''),
(71, '10003_1_4', '作业补登', '10003_1', 4, '', '/management/commonly/homework/add_register', 1, '2020-04-14', '1', ''),
(72, '10003_2', '作业查询', '10003', 3, '', '', 1, '2020-04-14', '1', ''),
(73, '10003_2_1', '布置查询', '10003_2', 4, '', '/management/commonly/homework/sel_layout', 1, '2020-04-14', '1', ''),
(74, '10003_2_2', '上缴查询', '10003_2', 4, '', '/management/commonly/homework/sel_submit', 1, '2020-04-14', '1', ''),
(75, '10003_2_3', '未缴查询', '10003_2', 4, '', '/management/commonly/homework/sel_nosubmit', 1, '2020-04-14', '1', ''),
(76, '10003_2_4', '学生查询', '10003_2', 4, '', '/management/commonly/homework/sel_stuhw', 1, '2020-04-14', '1', ''),
(77, '10003_2_5', '教师查询', '10003_2', 4, '', '/management/commonly/homework/sel_teahw', 1, '2020-04-14', '1', ''),
(78, '10022_1', '宿舍查询', '10022', 3, '', '', 1, '2020-04-14', '1', ''),
(79, '10022_1_1', '宿舍概况', '10022_1', 4, '', '/management/dormitory/patrol/happening', 1, '2020-04-14', '1', ''),
(80, '10022_1_2', '宿舍查询', '10022_1', 4, '', '/management/dormitory/patrol/sel_dormroom', 1, '2020-04-14', '1', ''),
(81, '10022_1_3', '记录修改', '10022_1', 4, '', '/management/dormitory/patrol/alter_recording', 1, '2020-04-14', '1', ''),
(82, '10004_1', '宿舍登记', '10004', 3, '', '/management/commonly/dormroom/recording', 1, '2020-04-14', '1', ''),
(83, '10022_2', '宿舍补登', '10022', 3, '', '/management/dormitory/patrol/add_recording', 1, '2020-04-14', '1', ''),
(84, '10073_1', '考勤查询', '10073', 3, '', '', 1, '2020-04-15', '1', ''),
(85, '10073_1_1', '总览', '10073_1', 4, '', '/management/stuset/attendance/overview', 1, '2020-04-15', '1', ''),
(86, '10073_1_2', '课堂概况', '10073_1', 4, '', '/management/stuset/attendance/today', 1, '2020-04-15', '1', ''),
(87, '10073_1_4', '考勤报表', '10073_1', 4, '', '/management/stuset/attendance/report', 1, '2020-04-15', '1', ''),
(88, '10073_1_5', '课间操概况', '10073_1', 4, '', '/management/stuset/attendance/sel_work', 1, '2020-04-15', '1', ''),
(89, '10073_1_6', '全勤查询', '10073_1', 4, '', '/management/stuset/attendance/full_attendance', 1, '2020-04-15', '1', ''),
(90, '10002_1', '考勤登记', '10002', 3, '', '', 1, '2020-04-15', '1', ''),
(91, '10002_1_1', '课堂登记', '10002_1', 4, '', '/management/commonly/attendance/register', 1, '2020-04-15', '1', ''),
(92, '10002_1_2', '早段登记', '10002_1', 4, '', '/management/commonly/attendance/early_register', 1, '2020-04-15', '1', ''),
(93, '10073_2_1', '补充填报', '10073_2', 4, '', '/management/stuset/attendance/add_register', 1, '2020-04-15', '1', ''),
(94, '10073_2_2', '记录修改', '10073_2', 4, '', '/management/stuset/attendance/alter', 1, '2020-04-15', '1', ''),
(95, '10015_1', '公开课', '10015', 3, '', '', 1, '2020-04-15', '1', ''),
(96, '10015_1_1', '公开课查询', '10015_1', 4, '', '/management/teach/evaluation/sel_evaluation', 1, '2020-04-15', '1', ''),
(97, '10015_1_2', '添加公开课', '10015_1', 4, '', '/management/teach/evaluation/add_evaluation', 1, '2020-04-15', '1', ''),
(98, '10015_1_3', '填写情况', '10015_1', 4, '', '/management/teach/evaluation/report_evaluation', 1, '2020-04-15', '1', ''),
(99, '10015_1_4', '听课评价', '10015_1', 4, '', '/management/teach/evaluation/attend_class', 1, '2020-04-15', '1', ''),
(100, '10021_1', '宿管管理安排', '10021', 3, '', '/management/dormitory/dormAgm/housemaster_arrangement', 1, '2020-04-16', '1', ''),
(101, '10021_2', '学生宿舍安排', '10021', 3, '', '/management/dormitory/dormAgm/stu_arrangement', 1, '2020-04-16', '1', ''),
(102, '10022_3', '违纪分类', '10022', 3, '', '/management/dormitory/patrol/breach_discipline', 1, '2020-04-16', '1', ''),
(103, '10073_2', '课程考勤管理', '10073', 3, '', '', 1, '2020-04-17', '1', ''),
(104, '10074_1', '成绩导入', '10074', 3, '', '/management/stuset/score_report/report', 1, '2020-04-17', '1', ''),
(105, '10074_2', '导入查询', '10074', 3, '', '/management/stuset/score_report/sel_report', 1, '2020-04-17', '1', ''),
(106, '10075_1', '成绩查询', '10075', 3, '', '/management/stuset/score_summary/sel_score', 1, '2020-04-17', '1', ''),
(107, '10075_2', '学生查询', '10075', 3, '', '/management/stuset/score_summary/sel_student', 1, '2020-04-17', '1', ''),
(111, '10053_2', '设置包含选项', '10053', 3, '', '/management/office/process/contain_option', 1, '2020-04-18', '1', ''),
(110, '10053_1', '设置支出类别', '10053', 3, '', '/management/office/process/expenditure_type', 1, '2020-04-18', '1', ''),
(112, '10053_3', '设置组织架构', '10053', 3, '', '/management/office/process/organization', 1, '2020-04-18', '1', ''),
(113, '10053_4', '设置审批流程', '10053', 3, '', '/management/office/process/approval_process', 1, '2020-04-18', '1', ''),
(114, '10054_1', '我的事务', '10054', 3, '', '/management/office/oa_approval/my_work', 1, '2020-04-18', '1', ''),
(115, '10054_2', '我的发起', '10054', 3, '', '/management/office/oa_approval/my_initiate', 1, '2020-04-18', '1', ''),
(116, '10054_3', '我的审批', '10054', 3, '', '/management/office/oa_approval/my_approval', 1, '2020-04-18', '1', ''),
(117, '10054_4', '附件管理', '10054', 3, '', '/management/office/oa_approval/annex', 1, '2020-04-18', '1', ''),
(118, '10054_5', '工作监控', '10054', 3, '', '/management/office/oa_approval/monitoring', 1, '2020-04-18', '1', ''),
(119, '100810', '作息安排', '1008', 2, '', '/management/base/schedule', 1, '2020-04-22', '1', 'table-lamp'),
(120, '100811', '课程类型', '1008', 2, '', '/management/base/course_credit', 1, '2020-04-23', '1', 'reading'),
(169, '10005_3', '系部审核', '10005', 3, '', '/management/commonly/week_school/department_check', 1, '2020-06-17', '1', ''),
(165, '10002_2_3', '学生健康', '10002_2', 4, '', '/management/commonly/attendance/stu_health', 0, '2020-06-12', '1', ''),
(166, '10005', '大周返校', '1000', 2, '', '/management/commonly/week_school', 1, '2020-06-17', '1', 'school'),
(167, '10005_1', '班主任提报', '10005', 3, '', '/management/commonly/week_school/head_teacher', 1, '2020-06-17', '1', ''),
(168, '10005_2', '宿管提报', '10005', 3, '', '/management/commonly/week_school/dormitory', 1, '2020-06-17', '1', ''),
(128, '100812', '校区管理', '1008', 2, '', '/management/base/campus', 1, '2020-04-27', '1', 'school'),
(129, '10002_1_3', '课间操管理', '10002_1', 4, '', '/management/commonly/attendance/between_register', 1, '2020-05-02', '1', ''),
(130, '10002_2', '卫生检测', '10002', 3, '', '', 1, '2020-05-02', '1', ''),
(131, '10073_4', '选项设置', '10073', 3, '', '', 1, '2020-05-02', '1', ''),
(132, '10002_2_1', '教室卫生登记', '10002_2', 4, '', '/management/commonly/attendance/classroom_health', 1, '2020-05-02', '1', ''),
(133, '10002_2_2', '黑板报登记', '10002_2', 4, '', '/management/commonly/attendance/black_board', 1, '2020-05-02', '1', ''),
(134, '10073_4_1', '考勤选项', '10073_4', 4, '', '/management/stuset/attendance/attendance_option', 1, '2020-05-02', '1', ''),
(135, '10073_4_2', '卫生模块', '10073_4', 4, '', '/management/stuset/attendance/health_model', 0, '2020-05-02', '1', ''),
(136, '10073_1_3', '早段概况', '10073_1', 4, '', '/management/stuset/attendance/class_today', 1, '2020-05-02', '1', ''),
(137, '10073_3', '教室卫生管理', '10073', 3, '', '', 1, '2020-05-02', '1', ''),
(140, '10073_4_3', '卫生评分选项', '10073_4', 4, '', '/management/stuset/attendance/health_option', 1, '2020-05-03', '1', ''),
(139, '10073_3_1', '记录修改', '10073_3', 4, '', '/management/stuset/attendance/alter_class', 1, '2020-05-02', '1', ''),
(141, '10072_1', '学生库', '10072', 3, '', '/management/stuset/stuinfo/stu_library', 1, '2020-05-06', '1', ''),
(142, '10072_2', '学生奖惩', '10072', 3, '', '/management/stuset/stuinfo/stu_reward', 1, '2020-05-06', '1', ''),
(143, '10072_3', '学籍状态', '10072', 3, '', '/management/stuset/stuinfo/stu_status', 1, '2020-05-06', '1', ''),
(144, '10094', '系统日志', '1009', 2, '', '/management/system/system_log', 1, '2020-05-07', '1', 's-order'),
(145, '10062_1', '教师库', '10062', 3, '', '/management/teaset/teacherinfo/teacher_library', 1, '2020-05-08', '1', ''),
(146, '10062_2', '学历档案', '10062', 3, '', '/management/teaset/teacherinfo/teacher_education', 1, '2020-05-08', '1', ''),
(147, '10062_3', '教师资格证书', '10062', 3, '', '/management/teaset/teacherinfo/teacher_qualifications', 1, '2020-05-08', '1', ''),
(148, '10062_4', '安排部门', '10062', 3, '', '/management/teaset/teacherinfo/arrangement_department', 1, '2020-05-08', '1', ''),
(149, '10065', '我的档案', '1006', 2, '', '/management/teaset/mine', 1, '2020-05-10', '1', 'price-tag'),
(150, '10065_1', '我的学历', '10065', 3, '', '', 1, '2020-05-10', '1', ''),
(151, '10065_1_1', '查询', '10065_1', 4, '', '/management/teaset/mine/sel_education', 1, '2020-05-10', '1', ''),
(152, '10065_1_2', '登记', '10065_1', 4, '', '/management/teaset/mine/add_education', 1, '2020-05-10', '1', ''),
(153, '10065_2', '教师资格证', '10065', 3, '', '', 1, '2020-05-10', '1', ''),
(154, '10065_2_1', '查询', '10065_2', 4, '', '/management/teaset/mine/sel_qualification', 1, '2020-05-10', '1', ''),
(155, '10065_2_2', '登记', '10065_2', 4, '', '/management/teaset/mine/add_qualification', 1, '2020-05-10', '1', ''),
(156, '10044', '资产类别', '1004', 2, '', '/management/property/asset_type', 1, '2020-05-21', '1', 'price-tag'),
(157, '10045', '报废类型', '1004', 2, '', '/management/property/scrapped_type', 1, '2020-05-21', '1', 's-release'),
(158, '10018', '学期开班', '1001', 2, '', '/management/teach/semesterClass', 1, '2020-05-24', '1', 's-shop'),
(160, '10014_1', '巡堂登记', '10014', 3, '', '/management/teach/patrol/register_patrol', 1, '2020-05-30', '1', ''),
(161, '10014_2', '记录查询', '10014', 3, '', '/management/teach/patrol/sel_patrol', 1, '2020-05-30', '1', ''),
(162, '10014_3', '设置维护', '10014', 3, '', '', 1, '2020-05-30', '1', ''),
(170, '10005_4', '政教处审核', '10005', 3, '', '/management/commonly/week_school/office_check', 1, '2020-06-17', '1', ''),
(164, '10014_3_1', '选项设置', '10014_3', 4, '', '/management/teach/patrol/option_set', 1, '2020-05-30', '1', ''),
(171, '10005_5', '领导审核', '10005', 3, '', '/management/commonly/week_school/leader_check', 1, '2020-06-17', '1', ''),
(172, '10005_6', '大周提报公示', '10005', 3, '', '/management/commonly/week_school/sel_report', 1, '2020-06-17', '1', ''),
(173, '10019', '班主任设置', '1001', 2, '', '/management/teach/head_teacher', 1, '2020-06-23', '1', 'user'),
(174, '10006', '通知管理', '1000', 2, '', '/management/commonly/message', 1, '2020-07-05', '1', 'chat-dot-round'),
(175, '10006_1', '发送通知', '10006', 3, '', '/management/commonly/message/send_message', 1, '2020-07-05', '1', ''),
(176, '10006_2', '通知查询', '10006', 3, '', '/management/commonly/message/sel_message', 1, '2020-07-05', '1', ''),
(177, '10076', '专业证书', '1007', 2, '', '/management/stuset/certificate', 1, '2020-07-21', '1', 'reading'),
(178, '10076_1', '学生证书', '10076', 3, '', '/management/stuset/certificate/stu_certificate', 1, '2020-07-23', '1', ''),
(179, '10076_2', '证书类别', '10076', 3, '', '/management/stuset/certificate/certificate_type', 1, '2020-07-23', '1', ''),
(180, '10007', '事务管理', '1000', 2, '', '/management/commonly/affairs', 1, '2020-07-23', '1', 'finished'),
(181, '10007_1', '添加事务', '10007', 3, '', '/management/commonly/affairs/reg_affair', 1, '2020-07-23', '1', ''),
(182, '10007_2', '事务查询', '10007', 3, '', '/management/commonly/affairs/sel_affair', 1, '2020-07-23', '1', ''),
(183, '10008', '二级督查', '1000', 2, '', '/management/commonly/second_inspection', 1, '2020-09-08', '1', 's-help'),
(184, '10008_1', '政教处督查', '10008', 3, '', '/management/commonly/second_inspection/political', 1, '2020-09-08', '1', ''),
(185, '10008_2', '教务处督查', '10008', 3, '', '/management/commonly/second_inspection/education', 1, '2020-09-08', '1', ''),
(186, '10008_3', '实习处督查', '10008', 3, '', '', 1, '2020-09-08', '1', ''),
(192, '10008_3_1', '督查概况', '10008_3', 4, '', '/management/commonly/second_inspection/practice', 1, '2020-09-11', '1', ''),
(187, '10008_4', '大赛办督查', '10008', 3, '', '', 1, '2020-09-08', '1', ''),
(194, '10008_4_2', '专业管理', '10008_4', 4, '', '/management/commonly/second_inspection/skill', 1, '2020-09-12', '1', ''),
(188, '10077', '奖惩管理', '1007', 2, '', '/management/stuset/rewards', 1, '2020-09-09', '1', 'help'),
(189, '10077_1', '奖惩管理', '10077', 3, '', '/management/stuset/rewards/list', 1, '2020-09-09', '1', ''),
(190, '10077_2', '积分查询', '10077', 3, '', '/management/stuset/rewards/score', 1, '2020-09-09', '1', ''),
(191, '10008_5', '督查记录', '10008', 3, '', '/management/commonly/second_inspection/record', 0, '2020-09-09', '1', ''),
(193, '10008_3_2', '实习地点', '10008_3', 4, '', '/management/commonly/second_inspection/practice_place', 1, '2020-09-11', '1', ''),
(195, '10008_4_1', '督查概况', '10008_4', 4, '', '/management/commonly/second_inspection/contest', 1, '2020-09-12', '1', ''),
(196, '10072_4', '职业素养分', '10072', 3, '', '/management/stuset/stuinfo/stu_score', 1, '2020-09-14', '1', ''),
(197, '10031_1', '工资录入', '10031', 3, '', '/management/finance/wage/input', 1, '2020-09-16', '1', ''),
(198, '10031_2', '导入查询', '10031', 3, '', '/management/finance/wage/sel_input', 1, '2020-09-16', '1', ''),
(199, '10063_1', '绩效导入', '10063', 3, '', '/management/teaset/performance_report/input', 1, '2020-09-16', '1', ''),
(200, '10063_2', '导入查询', '10063', 3, '', '/management/teaset/performance_report/sel_input', 1, '2020-09-16', '1', '');

-- --------------------------------------------------------

--
-- 表的结构 `tb_login`
--

CREATE TABLE `tb_login` (
  `id` int NOT NULL COMMENT 'id',
  `user_id` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '账号（学号）',
  `user_name` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '用户姓名',
  `password` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'e10adc3949ba59abbe56e057f20f883e' COMMENT '密码',
  `user_phone` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '电话',
  `user_group` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '组别',
  `user_school` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '祖国的花朵',
  `user_campus` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `user_wxid` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '微信id',
  `user_ddid` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '钉钉id',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建者',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='用户登录';

--
-- 转存表中的数据 `tb_login`
--

INSERT INTO `tb_login` (`id`, `user_id`, `user_name`, `password`, `user_phone`, `user_group`, `user_school`, `user_campus`, `user_wxid`, `user_ddid`, `created_user`, `addTime`) VALUES
(1, '2017217042', 'wanted', 'c44a471bd78cc6c2fea32b9fe028d30a', '15625226090', 'D1', 'S0001', 'S0001_A', '123456789', '987654321', '2017217042', '1588149597361'),
(2, '2017217041', '李某某', 'c44a471bd78cc6c2fea32b9fe028d30a', '13501234567', 'S1', 'S0001', 'S0001_A', 'wx1234', 'dd1234', '2017217042', '1587960415000'),
(3, '2017217040', '张某某', 'e10adc3949ba59abbe56e057f20f883e', '18912345678', 'T2', 'S0001', 'S0001_A', 'wx1234', 'dd1234', '2017217042', '1587960415000'),
(7, '2017217038', '程某', 'e10adc3949ba59abbe56e057f20f883e', '18999990909', 'T3', 'S0001', 'S0001_A', '', '', '2017217042', '1589271675529'),
(8, '2018181088', '熊某', 'e10adc3949ba59abbe56e057f20f883e', '13888889999', 'T3', 'S0001', 'S0001_A', '', '', '2017217042', '1589619410560'),
(16, '2017217001', '周周', 'c44a471bd78cc6c2fea32b9fe028d30a', '15677889900', 'T10', 'S0001', 'S0001_A', '', '', '2017217042', '1590111551771'),
(17, '2018218038', '潘小某', 'e10adc3949ba59abbe56e057f20f883e', '18900001111', 'S1', 'S0001', 'S0001_A', '', '', '2017217001', '1591933407705'),
(18, '2018218033', '梁某某', 'e10adc3949ba59abbe56e057f20f883e', '13577582588', 'S1', 'S0001', 'S0001_A', '', '', '2017217001', '1592231354000'),
(19, '2018218034', '张某某', 'e10adc3949ba59abbe56e057f20f883e', '13551183400', 'S1', 'S0001', 'S0001_A', '', '', '2017217001', '1592231355000'),
(20, '1233211234567', 'MoonLight', 'e10adc3949ba59abbe56e057f20f883e', '13717028458', 'T1', 'S0001', 'S0001_A', '', '', '2017217001', '1592293130000'),
(21, '2018218040', '叶某某', 'e10adc3949ba59abbe56e057f20f883e', '13512341355', 'S1', 'S0001', 'S0001_A', '', '', '2017217001', '1599189044280'),
(22, '2018218041', '许小某', 'e10adc3949ba59abbe56e057f20f883e', '19999590987', 'S1', 'S0001', 'S0001_A', '', '', '2017217001', '1599189392604');

-- --------------------------------------------------------

--
-- 表的结构 `tb_message`
--

CREATE TABLE `tb_message` (
  `id` int NOT NULL COMMENT 'id序号',
  `message_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '消息id',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '消息类型',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `tb_message`
--

INSERT INTO `tb_message` (`id`, `message_id`, `type`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '1', 'homework', 'S0001_A', 'S0001', '2017217042', '1592913295244'),
(3, '3', 'homework', 'S0001_A', 'S0001', '2017217001', '1599736111071'),
(4, '1', 'message', 'S0001_A', 'S0001', '2017217001', '1600617071479'),
(6, '3', 'message', 'S0001_A', 'S0001', '2017217001', '1600675229711'),
(7, '5', 'homework', 'S0001_A', 'S0001', '2017217001', '1600776682086');

-- --------------------------------------------------------

--
-- 表的结构 `tb_message_read`
--

CREATE TABLE `tb_message_read` (
  `id` int NOT NULL COMMENT 'id序号',
  `message` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '消息',
  `user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '用户',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `tb_message_read`
--

INSERT INTO `tb_message_read` (`id`, `message`, `user`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '3', '2017217001', 'S0001_A', 'S0001', '2017217001', '1600739781734'),
(2, '3', '2017217041', 'S0001_A', 'S0001', '2017217041', '1600776253410'),
(3, '1', '2017217041', 'S0001_A', 'S0001', '2017217041', '1600776285021'),
(4, '5', '2017217041', 'S0001_A', 'S0001', '2017217041', '1600782053789');

-- --------------------------------------------------------

--
-- 表的结构 `tb_mylabel`
--

CREATE TABLE `tb_mylabel` (
  `id` tinyint NOT NULL COMMENT 'id序号',
  `labelId` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '标签id',
  `labelName` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '标签名字',
  `state` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `tb_mylabel`
--

INSERT INTO `tb_mylabel` (`id`, `labelId`, `labelName`, `state`) VALUES
(1, '1001', '成熟', '1'),
(2, '1002', '冷静', '1'),
(3, '1003', '美丽', '1'),
(4, '1004', '聪慧', '1'),
(5, '1005', '健壮', '1'),
(6, '1006', '帅气', '1'),
(7, '1007', '热心', '1'),
(8, '1008', '大方', '1'),
(9, '1009', '乐观', '1'),
(10, '1010', '自信', '1');

-- --------------------------------------------------------

--
-- 表的结构 `tb_userhead`
--

CREATE TABLE `tb_userhead` (
  `id` int NOT NULL COMMENT 'id序号',
  `user` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '用户',
  `user_head` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '用户头像',
  `campus` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `addTime` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `tb_userhead`
--

INSERT INTO `tb_userhead` (`id`, `user`, `user_head`, `campus`, `school`, `addTime`) VALUES
(3, '2017217001', 'smartSchool-S0001_A-2017217001.jpg', 'S0001_A', 'S0001', '1600835672000'),
(8, '2017217041', 'smartSchool-S0001_A-2017217041.jpg', 'S0001_A', 'S0001', '1600836595000');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_department`
--

CREATE TABLE `teacher_department` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher_name` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '教师id',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `department` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '所在部门'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teacher_department`
--

INSERT INTO `teacher_department` (`id`, `teacher_name`, `school`, `campus`, `department`) VALUES
(1, '2017217042', 'S0001', 'S0001_A', '1'),
(2, '2017217040', 'S0001', 'S0001_A', '1');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_education`
--

CREATE TABLE `teacher_education` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '教师名称',
  `graduated_school` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '毕业学校',
  `profession` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '专业',
  `education` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学位',
  `school_system` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学制',
  `witness` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '证明人',
  `certificate_img` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '证书',
  `certificate_id` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '证书编号',
  `graduated_time` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '毕业时间',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teacher_education`
--

INSERT INTO `teacher_education` (`id`, `teacher_name`, `graduated_school`, `profession`, `education`, `school_system`, `witness`, `certificate_img`, `certificate_id`, `graduated_time`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, '2017217042', '美国麻省理工学院', '计算机工程学', '博士', '全日制', '拉斐尔·莱夫', '', '123456', '2020-07-01', 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(2, '2017217001', '清华大学', '计算机科学与技术', '博士', '全日制', '陈吉宁', '', '5201314', '2020-05-22', 'S0001', 'S0001_A', '2017217001', '1590114032195');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_info`
--

CREATE TABLE `teacher_info` (
  `id` int NOT NULL COMMENT 'id序号',
  `userid` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '教师id',
  `username` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '教师名称',
  `sex` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '教师性别',
  `nation` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '民族',
  `teacher_phone` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '教师电话',
  `teacher_sfz` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '教师身份证',
  `teacher_job` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '教师职责',
  `school` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '所在学校',
  `campus` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '所在校区',
  `department` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT '0' COMMENT '所在部门',
  `teacher_born` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '出生年月日',
  `china_member` varchar(6) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '社会面貌',
  `house_register_provinces` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '户籍所在（省）',
  `house_register_city` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '户籍所在（市）',
  `house_register_area` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '户籍所在（区）',
  `house_register_type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '户籍类型',
  `address_province` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '住址（省）',
  `address_city` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '住址（市）',
  `address_area` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '住址（区）',
  `address_detailed` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '住址（详细）',
  `msgSet` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '1,1,1' COMMENT '消息设置',
  `type` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '1' COMMENT '状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teacher_info`
--

INSERT INTO `teacher_info` (`id`, `userid`, `username`, `sex`, `nation`, `teacher_phone`, `teacher_sfz`, `teacher_job`, `school`, `campus`, `department`, `teacher_born`, `china_member`, `house_register_provinces`, `house_register_city`, `house_register_area`, `house_register_type`, `address_province`, `address_city`, `address_area`, `address_detailed`, `msgSet`, `type`, `created_user`, `addTime`) VALUES
(1, '2017217042', 'wanted', '男', '汉', '15612345678', '441500123456780000', 'D1', 'S0001', 'S0001_A', 'S0001_A_01', '20020828', '党员', '440000', '440300', '440306', '', '440000', '440300', '440306', '新安街道大花园5栋32楼', '1,1,1', '1', '2017217042', '1587608927000'),
(2, '2017217040', '张某某', '女', '汉', '18912345678', '441500123412341234', 'T1', 'S0001', 'S0001_A', 'S0001_A_02', '19980911', '', '440000', '440300', '440306', '', '440000', '440300', '440306', '新安街道大花园5栋32楼', '1,1,1', '1', '2017217042', '1588579143455'),
(3, '2017217038', '程某', '', '', '', '', 'T3', 'S0001', 'S0001_A', 'S0001_A_01', '', NULL, '', '', '', '', '', '', '', '', '1,1,1', '1', '2017217042', '1587608927000'),
(11, '2018181088', '熊某', '', '', '', '', 'T3', 'S0001', 'S0001_A', 'S0001_A_01', '', '', '', '', '', '', '', '', '', '', '1,1,1', '1', '2017217042', '1589619410560'),
(14, '2017217001', '周周', '男', '汉', '15677889900', '441588123456781234', 'T10', 'S0001', 'S0001_A', 'S0001_A_01', '20020828', '党员', '110000', '110100', '110101', '城市', '110000', '110100', '110101', '清华大学旁的小卖部旁边的天桥底下的第二个床铺', '1,1,1', '1', '2017217042', '1590111551771'),
(18, '1233211234567', 'MoonLight', '男', '汉', '13717028458', '441500202002202200', 'T1', 'S0001', 'S0001_A', '0', '', '党员', '440000', '440300', '440306', '城市', '440000', '440300', '440306', '不详', '1,1,1', '1', '2017217001', '1592293024588');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_performance`
--

CREATE TABLE `teacher_performance` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '教师',
  `performance` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '事务',
  `num` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '0' COMMENT '次数',
  `imp_id` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '导入文件id',
  `semester` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='学生成绩表';

--
-- 转存表中的数据 `teacher_performance`
--

INSERT INTO `teacher_performance` (`id`, `teacher`, `performance`, `num`, `imp_id`, `semester`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '2017217001', '升旗', '4', '1', '202101', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600244740149'),
(2, '2017217001', '比赛', '1', '1', '202101', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600244740149');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_performance_imp`
--

CREATE TABLE `teacher_performance_imp` (
  `id` int NOT NULL COMMENT 'id序号',
  `title` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '文件标题',
  `semester` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `department` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `campus` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `school` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `created_user` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teacher_performance_imp`
--

INSERT INTO `teacher_performance_imp` (`id`, `title`, `semester`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, '教师绩效导入模板.xlsx', '202101', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1600244741053');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_qualification`
--

CREATE TABLE `teacher_qualification` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '教师id',
  `qualification_name` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '证书名称',
  `qualification_id` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '证书编号',
  `qualification_profession` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '任教科目',
  `qualification_type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '资格证种类',
  `qualification_mechanism` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '认证机构',
  `qualification_time` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '发布时间',
  `qualification_img` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '资格证书图片',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teacher_qualification`
--

INSERT INTO `teacher_qualification` (`id`, `teacher_name`, `qualification_name`, `qualification_id`, `qualification_profession`, `qualification_type`, `qualification_mechanism`, `qualification_time`, `qualification_img`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, '2017217042', '大学教育教师资格证', '12345678900', '计算机工程学', '成人/大学教育教师资格', '国家教育委员会', '2020-07-01', '', 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(2, '2017217001', '大学教育教师资格证', '5201314', '计算机科学与技术', '成人/大学教育教师资格', '国家教育委员会', '2020-05-22', '', 'S0001', 'S0001_A', '2017217001', '1590114410754');

-- --------------------------------------------------------

--
-- 表的结构 `teach_alter_class`
--

CREATE TABLE `teach_alter_class` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '代课教师',
  `class` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '代课班级',
  `course` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '代理课程',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '代课时间',
  `session` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '代课节次',
  `build` varchar(100) COLLATE utf8_bin NOT NULL COMMENT '代课所在教学楼',
  `room` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '代课所在课室',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '代课类型',
  `remark` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '备注',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学期',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_alter_class`
--

INSERT INTO `teach_alter_class` (`id`, `teacher`, `class`, `course`, `date`, `session`, `build`, `room`, `type`, `remark`, `school`, `campus`, `department`, `semester`, `created_user`, `addTime`) VALUES
(1, '2018181088', 'S0001_A_01_01_1901', 'S0001_A_01_01_C002', '1590595200000', 'ZX2', 'S0001_A_01_B01', 'S0001_A_01_B01_002', '事假', '', 'S0001', 'S0001_A', 'S0001_A_01', '192002', '2017217001', '1590556271303'),
(3, '2017217042', 'S0001_A_01_01_1901', 'S0001_A_01_01_C006', '1590681600000', 'ZX7', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '公假', '需要考证', 'S0001', 'S0001_A', 'S0001_A_01', '192002', '2017217001', '1590639159532');

-- --------------------------------------------------------

--
-- 表的结构 `teach_class_course`
--

CREATE TABLE `teach_class_course` (
  `id` int NOT NULL COMMENT 'id序号',
  `course` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '课程',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `skill` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '专业',
  `class` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `status` varchar(6) COLLATE utf8_bin NOT NULL COMMENT '状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_class_course`
--

INSERT INTO `teach_class_course` (`id`, `course`, `semester`, `school`, `campus`, `skill`, `class`, `status`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01_01_C002', '192002', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1587608927000'),
(2, 'S0001_A_01_01_C003', '192002', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1590244288000'),
(3, 'S0001_A_01_01_C005', '192002', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1590244288000'),
(4, 'S0001_A_01_01_C004', '192002', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1590287724000'),
(5, 'S0001_A_01_01_C006', '192002', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1590287768000'),
(6, 'S0001_A_01_01_C007', '192002', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1599119118000'),
(7, 'S0001_A_01_01_C008', '192002', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1599119118000'),
(8, 'S0001_A_01_01_C002', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1801', '1', '2017217001', '1599188290000'),
(9, 'S0001_A_01_01_C003', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1801', '1', '2017217001', '1599188290000'),
(10, 'S0001_A_01_01_C004', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1801', '1', '2017217001', '1599188290000'),
(11, 'S0001_A_01_01_C005', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1801', '1', '2017217001', '1599188290000'),
(12, 'S0001_A_01_01_C006', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1801', '1', '2017217001', '1599188290000'),
(13, 'S0001_A_01_01_C007', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1801', '1', '2017217001', '1599188290000'),
(14, 'S0001_A_01_01_C008', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1801', '1', '2017217001', '1599188290000'),
(15, 'S0001_A_01_01_C002', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1599188305000'),
(16, 'S0001_A_01_01_C003', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1599188305000'),
(17, 'S0001_A_01_01_C004', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '1', '2017217001', '1599188305000'),
(18, 'S0001_A_01_01_C005', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '0', '2017217001', '1599188305000'),
(19, 'S0001_A_01_01_C006', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '0', '2017217001', '1599188305000'),
(20, 'S0001_A_01_01_C007', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '0', '2017217001', '1599188305000'),
(21, 'S0001_A_01_01_C008', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1901', '0', '2017217001', '1599188305000'),
(22, 'S0001_A_01_01_C002', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1902', '1', '2017217001', '1599188309000'),
(23, 'S0001_A_01_01_C003', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1902', '1', '2017217001', '1599188309000'),
(24, 'S0001_A_01_01_C004', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1902', '1', '2017217001', '1599188309000'),
(25, 'S0001_A_01_01_C005', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1902', '0', '2017217001', '1599188309000'),
(26, 'S0001_A_01_01_C006', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1902', '0', '2017217001', '1599188309000'),
(27, 'S0001_A_01_01_C007', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1902', '0', '2017217001', '1599188309000'),
(28, 'S0001_A_01_01_C008', '202101', 'S0001', 'S0001_A', 'S0001_A_01_01', 'S0001_A_01_01_1902', '0', '2017217001', '1599188309000');

-- --------------------------------------------------------

--
-- 表的结构 `teach_class_schedule`
--

CREATE TABLE `teach_class_schedule` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `session` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '节次',
  `mon_course` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周一课程',
  `mon_build` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周一课程教学楼',
  `mon_room` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周一课程教室',
  `tue_course` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周二课程',
  `tue_build` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周二课程教学楼',
  `tue_room` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周二课程教室',
  `wed_course` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周三课程',
  `wed_build` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周三课程教学楼',
  `wed_room` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周三课程教室',
  `thu_course` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周四课程',
  `thu_build` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周四课程教学楼',
  `thu_room` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周四课程教室',
  `fri_course` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周五课程',
  `fri_build` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周五课程教学楼',
  `fri_room` varchar(36) COLLATE utf8_bin NOT NULL COMMENT '周五课程教室',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_class_schedule`
--

INSERT INTO `teach_class_schedule` (`id`, `class`, `semester`, `session`, `mon_course`, `mon_build`, `mon_room`, `tue_course`, `tue_build`, `tue_room`, `wed_course`, `wed_build`, `wed_room`, `thu_course`, `thu_build`, `thu_room`, `fri_course`, `fri_build`, `fri_room`, `school`, `campus`, `department`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01_01_1901', '192002', 'ZX1', '1', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '4', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '1', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '4', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '1', 'S0001_A_01_B01', 'S0001_A_01_B01_001', 'S0001', 'S0001_A', 'S0001_A_01', '2017217042', '1587608927000'),
(2, 'S0001_A_01_01_1901', '192002', 'ZX2', '', '', '', '8', 'S0001_A_02_B01', 'S0001_A_02_B01_001', '', '', '', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(3, 'S0001_A_01_01_1901', '192002', 'ZX4', '', '', '', '', '', '', '', '', '', '1', 'S0001_A_01_B01', 'S0001_A_01_B01_002', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(4, 'S0001_A_01_01_1901', '192002', 'ZX5', '4', 'S0001_A_01_B01', 'S0001_A_01_B01_003', '', '', '', '8', 'S0001_A_01_B01', 'S0001_A_01_B01_002', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(5, 'S0001_A_01_01_1901', '192002', 'ZX7', '', '', '', '', '', '', '', '', '', '', '', '', '4', 'S0001_A_02_B01', 'S0001_A_02_B01_001', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(6, 'S0001_A_01_01_1901', '192002', 'ZX8', '', '', '', '1', 'S0001_A_01_B01', 'S0001_A_01_B01_003', '', '', '', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(7, 'S0001_A_01_01_1901', '192002', 'ZX9', '', '', '', '', '', '', '4', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(8, 'S0001_A_01_01_1901', '192002', 'ZX10', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(9, 'S0001_A_01_01_1901', '192002', 'ZX11', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1590393596000'),
(10, 'S0001_A_01_01_1801', '202101', 'ZX1', '9', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '', '', '', '', '', '', '12', 'S0001_A_01_B01', 'S0001_A_01_B01_001', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(11, 'S0001_A_01_01_1801', '202101', 'ZX2', '', '', '', '10', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '11', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(12, 'S0001_A_01_01_1801', '202101', 'ZX4', '', '', '', '', '', '', '11', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(13, 'S0001_A_01_01_1801', '202101', 'ZX5', '', '', '', '10', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '12', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(14, 'S0001_A_01_01_1801', '202101', 'ZX7', '9', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '', '', '', '', '', '', '9', 'S0001_A_01_B01', 'S0001_A_01_B01_001', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(15, 'S0001_A_01_01_1801', '202101', 'ZX8', '', '', '', '12', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '10', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(16, 'S0001_A_01_01_1801', '202101', 'ZX9', '', '', '', '', '', '', '11', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(17, 'S0001_A_01_01_1801', '202101', 'ZX10', '', '', '', '12', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '11', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000'),
(18, 'S0001_A_01_01_1801', '202101', 'ZX11', '9', 'S0001_A_01_B01', 'S0001_A_01_B01_001', '', '', '', '', '', '', '', '', '', '10', 'S0001_A_01_B01', 'S0001_A_01_B01_001', 'S0001', 'S0001_A', 'S0001_A_01', '2017217001', '1599188862000');

-- --------------------------------------------------------

--
-- 表的结构 `teach_evaluation`
--

CREATE TABLE `teach_evaluation` (
  `id` int NOT NULL COMMENT 'id序号',
  `title` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '标题',
  `teacher` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '教室',
  `organizer` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '组织者',
  `informant` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '填报人',
  `type` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '类型',
  `lever` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '级别',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '时间',
  `session` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '节次',
  `class` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `course` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '课程',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `status` varchar(6) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '0' COMMENT '审核状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_evaluation`
--

INSERT INTO `teach_evaluation` (`id`, `title`, `teacher`, `organizer`, `informant`, `type`, `lever`, `date`, `session`, `class`, `course`, `school`, `campus`, `department`, `semester`, `status`, `created_user`, `addTime`) VALUES
(1, '如何在祖安生活', '2017217001', '2017217001', '2017217001', '校内', '国家级', '1587608927000', 'ZX1', 'S0001_A_01_01_1901', 'S0001_A_01_01_C002', 'S0001', 'S0001_A', 'S0001_A_01', '192002', '1', '2017217042', '1587608927000'),
(3, 'Can you speak English?', '2017217042', '2017217042', '', '校内', '国家级', '1590973612443', 'ZX1', 'S0001_A_01_02_1901', 'S0001_A_01_01_C004', 'S0001', 'S0001_A', 'S0001_A_01', '192002', '0', '2017217001', '1590714458963');

-- --------------------------------------------------------

--
-- 表的结构 `teach_evaluation_report`
--

CREATE TABLE `teach_evaluation_report` (
  `id` int NOT NULL COMMENT 'id序号',
  `evaluation` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '公开课',
  `teacher` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '听课教师',
  `content` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '课程内容',
  `highlight` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '亮点',
  `img` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '图片',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_evaluation_report`
--

INSERT INTO `teach_evaluation_report` (`id`, `evaluation`, `teacher`, `content`, `highlight`, `img`, `school`, `campus`) VALUES
(1, '1', '[\"2017217001\",\"2017217042\"]', '没啥感想', '也没啥感想', NULL, 'S0001', 'S0001_A');

-- --------------------------------------------------------

--
-- 表的结构 `teach_head_teacher`
--

CREATE TABLE `teach_head_teacher` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `teacher` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班主任',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_head_teacher`
--

INSERT INTO `teach_head_teacher` (`id`, `class`, `teacher`, `semester`, `department`, `campus`, `school`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01_01_1901', '2017217001', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1592887251423'),
(2, 'S0001_A_01_02_1901', '2017217042', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1592887327279'),
(3, 'S0001_A_01_01_1801', '2017217001', '202101', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599316712099'),
(4, 'S0001_A_01_01_1901', '2017217042', '202101', 'S0001_A_01', 'S0001_A', 'S0001', '2017217001', '1599316716504');

-- --------------------------------------------------------

--
-- 表的结构 `teach_patrol`
--

CREATE TABLE `teach_patrol` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `session` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '节次',
  `score` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '分数',
  `content` text COLLATE utf8_bin NOT NULL COMMENT '巡课情况',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `date` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '时间',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_patrol`
--

INSERT INTO `teach_patrol` (`id`, `class`, `session`, `score`, `content`, `semester`, `department`, `campus`, `school`, `date`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01_01_1901', 'ZX1', '30', '[{\"option_id\":\"S0001_A_O003\",\"score\":\"10\"},{\"option_id\":\"S0001_A_O002\",\"score\":\"10\"},{\"option_id\":\"S0001_A_O001\",\"score\":\"10\"}]', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '1590940800000', '2017217001', '1590977301974'),
(2, 'S0001_A_01_02_1901', 'ZX1', '16', '[{\"option_id\":\"S0001_A_O003\",\"score\":\"8\"},{\"option_id\":\"S0001_A_O002\",\"score\":\"8\"},{\"option_id\":\"S0001_A_O001\",\"score\":\"0\"}]', '192002', 'S0001_A_01', 'S0001_A', 'S0001', '1590940800000', '2017217001', '1590992482398');

-- --------------------------------------------------------

--
-- 表的结构 `teach_patrol_option`
--

CREATE TABLE `teach_patrol_option` (
  `id` int NOT NULL COMMENT 'id序号',
  `option_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '选项id',
  `option_name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '选项名称',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_patrol_option`
--

INSERT INTO `teach_patrol_option` (`id`, `option_id`, `option_name`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_O001', '课表相符', 'S0001', 'S0001_A', '2017217042', '1590902031727'),
(2, 'S0001_A_O002', '教师到位', 'S0001', 'S0001_A', '2017217042', '1590714458963'),
(3, 'S0001_A_O003', '课堂纪律', 'S0001', 'S0001_A', '2017217001', '1590898033770');

-- --------------------------------------------------------

--
-- 表的结构 `teach_patrol_option_list`
--

CREATE TABLE `teach_patrol_option_list` (
  `id` int NOT NULL COMMENT 'id序号',
  `option_id` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '选项项目',
  `name` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所对选项',
  `score` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '分数',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '所在校区',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_patrol_option_list`
--

INSERT INTO `teach_patrol_option_list` (`id`, `option_id`, `name`, `score`, `school`, `campus`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_O001', '是', '10', 'S0001', 'S0001_A', '2017217042', '1587608927000'),
(2, 'S0001_A_O001', '否', '0', 'S0001', 'S0001_A', '2017217042', '1590714458963'),
(3, 'S0001_A_O002', '准时到位', '10', 'S0001', 'S0001_A', '2017217001', '1590903087193'),
(4, 'S0001_A_O002', '未到位', '4', 'S0001', 'S0001_A', '2017217001', '1590903626639'),
(5, 'S0001_A_O002', '迟到2分钟内', '8', 'S0001', 'S0001_A', '2017217001', '1590934941227'),
(6, 'S0001_A_O002', '迟到5分钟内', '6', 'S0001', 'S0001_A', '2017217001', '1590934963028'),
(7, 'S0001_A_O003', '很好', '10', 'S0001', 'S0001_A', '2017217001', '1590971615655'),
(8, 'S0001_A_O003', '较好', '8', 'S0001', 'S0001_A', '2017217001', '1590971622092'),
(9, 'S0001_A_O003', '一般', '6', 'S0001', 'S0001_A', '2017217001', '1590971629258'),
(10, 'S0001_A_O003', '待改进', '4', 'S0001', 'S0001_A', '2017217001', '1590971636791');

-- --------------------------------------------------------

--
-- 表的结构 `teach_semester_class`
--

CREATE TABLE `teach_semester_class` (
  `id` int NOT NULL COMMENT 'id序号',
  `class` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `status` varchar(6) COLLATE utf8_bin NOT NULL COMMENT '状态',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_semester_class`
--

INSERT INTO `teach_semester_class` (`id`, `class`, `semester`, `school`, `campus`, `department`, `status`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01_01_1901', '192002', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217042', '1587608927000'),
(8, 'S0001_A_01_02_1901', '192002', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217042', '1590309456000'),
(10, 'S0001_A_01_01_1801', '192002', 'S0001', 'S0001_A', 'S0001_A_01', '0', '2017217001', '1592893209000'),
(11, 'S0001_A_01_02_1902', '192002', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217001', '1592893209000'),
(12, 'S0001_A_01_01_1902', '192002', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217001', '1592893209000'),
(13, 'S0001_A_01_01_1801', '202101', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217001', '1599119108000'),
(14, 'S0001_A_01_02_1902', '202101', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217001', '1599119108000'),
(15, 'S0001_A_01_01_1902', '202101', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217001', '1599119108000'),
(16, 'S0001_A_01_02_1901', '202101', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217001', '1599119108000'),
(17, 'S0001_A_01_01_1901', '202101', 'S0001', 'S0001_A', 'S0001_A_01', '1', '2017217001', '1599119108000');

-- --------------------------------------------------------

--
-- 表的结构 `teach_semester_course`
--

CREATE TABLE `teach_semester_course` (
  `id` int NOT NULL COMMENT 'id序号',
  `course` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '课程',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(30) COLLATE utf8_bin NOT NULL COMMENT '所在部门',
  `skill` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '专业',
  `status` varchar(6) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '0' COMMENT '是否开启',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_semester_course`
--

INSERT INTO `teach_semester_course` (`id`, `course`, `semester`, `school`, `campus`, `department`, `skill`, `status`, `created_user`, `addTime`) VALUES
(1, 'S0001_A_01_01_C002', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217042', '1587608927000'),
(2, 'S0001_A_01_01_C003', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1590223981000'),
(3, 'S0001_A_01_01_C004', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217042', '1590223981000'),
(4, 'S0001_A_01_01_C005', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1590223981000'),
(5, 'S0001_A_01_01_C006', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217042', '1590287759000'),
(6, 'S0001_A_01_01_C002', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599119096000'),
(7, 'S0001_A_01_01_C003', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599119096000'),
(8, 'S0001_A_01_01_C004', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599119096000'),
(9, 'S0001_A_01_01_C005', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599119096000'),
(10, 'S0001_A_01_01_C006', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599119096000'),
(11, 'S0001_A_01_01_C007', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599119096000'),
(12, 'S0001_A_01_01_C008', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599119096000'),
(13, 'S0001_A_01_01_C007', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599188056000'),
(14, 'S0001_A_01_01_C008', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01', '1', '2017217001', '1599188056000');

-- --------------------------------------------------------

--
-- 表的结构 `teach_teacher_schedule`
--

CREATE TABLE `teach_teacher_schedule` (
  `id` int NOT NULL COMMENT 'id序号',
  `teacher` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '教师',
  `course` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '课程',
  `semester` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学期',
  `school` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '学校',
  `campus` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '校区',
  `department` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '部门',
  `class` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '班级',
  `class_time` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '每周课时',
  `credit` varchar(16) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '学期学分',
  `created_user` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建人',
  `addTime` varchar(16) COLLATE utf8_bin NOT NULL COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `teach_teacher_schedule`
--

INSERT INTO `teach_teacher_schedule` (`id`, `teacher`, `course`, `semester`, `school`, `campus`, `department`, `class`, `class_time`, `credit`, `created_user`, `addTime`) VALUES
(1, '2017217001', 'S0001_A_01_01_C005', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1901', '2', '2', '2017217042', '1587608927000'),
(4, '2017217042', 'S0001_A_01_01_C002', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1901', '2', '2', '2017217042', '1590302970000'),
(8, '2017217001', 'S0001_A_01_01_C006', '192002', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1901', '2', '2', '2017217001', '1590393439000'),
(9, '2017217001', 'S0001_A_01_01_C003', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1801', '2', '2', '2017217001', '1599188753000'),
(10, '2017217042', 'S0001_A_01_01_C002', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1801', '2', '2', '2017217001', '1599188753000'),
(11, '2017217001', 'S0001_A_01_01_C004', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1801', '2', '2', '2017217001', '1599188753000'),
(12, '2017217042', 'S0001_A_01_01_C005', '202101', 'S0001', 'S0001_A', 'S0001_A_01', 'S0001_A_01_01_1801', '2', '2', '2017217001', '1599188753000');

--
-- 转储表的索引
--

--
-- 表的索引 `base_build`
--
ALTER TABLE `base_build`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_campus`
--
ALTER TABLE `base_campus`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_class`
--
ALTER TABLE `base_class`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_course`
--
ALTER TABLE `base_course`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_course_type`
--
ALTER TABLE `base_course_type`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_department`
--
ALTER TABLE `base_department`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_grade`
--
ALTER TABLE `base_grade`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_profession`
--
ALTER TABLE `base_profession`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_room`
--
ALTER TABLE `base_room`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_schedule`
--
ALTER TABLE `base_schedule`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_school`
--
ALTER TABLE `base_school`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `base_semester`
--
ALTER TABLE `base_semester`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `china_areas`
--
ALTER TABLE `china_areas`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `china_cities`
--
ALTER TABLE `china_cities`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `china_provinces`
--
ALTER TABLE `china_provinces`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_affairs`
--
ALTER TABLE `commonly_affairs`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_attendance_between`
--
ALTER TABLE `commonly_attendance_between`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_attendance_course`
--
ALTER TABLE `commonly_attendance_course`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_attendance_early`
--
ALTER TABLE `commonly_attendance_early`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_health_blackboard`
--
ALTER TABLE `commonly_health_blackboard`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_health_classroom`
--
ALTER TABLE `commonly_health_classroom`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_health_stuhealth`
--
ALTER TABLE `commonly_health_stuhealth`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_homework`
--
ALTER TABLE `commonly_homework`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_homework_register`
--
ALTER TABLE `commonly_homework_register`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_message`
--
ALTER TABLE `commonly_message`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_message_annex`
--
ALTER TABLE `commonly_message_annex`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_second_contest`
--
ALTER TABLE `commonly_second_contest`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_second_education`
--
ALTER TABLE `commonly_second_education`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_second_political`
--
ALTER TABLE `commonly_second_political`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_second_practice`
--
ALTER TABLE `commonly_second_practice`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_second_practice_place`
--
ALTER TABLE `commonly_second_practice_place`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_second_skill`
--
ALTER TABLE `commonly_second_skill`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_week_dormitory`
--
ALTER TABLE `commonly_week_dormitory`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `commonly_week_head_teacher`
--
ALTER TABLE `commonly_week_head_teacher`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dormitory_attendance`
--
ALTER TABLE `dormitory_attendance`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dormitory_attendance_option`
--
ALTER TABLE `dormitory_attendance_option`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dormitory_build`
--
ALTER TABLE `dormitory_build`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dormitory_dormroom`
--
ALTER TABLE `dormitory_dormroom`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dormitory_housemaster`
--
ALTER TABLE `dormitory_housemaster`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dormitory_stu_arrangement`
--
ALTER TABLE `dormitory_stu_arrangement`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `finance_revenue`
--
ALTER TABLE `finance_revenue`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `finance_upload`
--
ALTER TABLE `finance_upload`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `oa_allow`
--
ALTER TABLE `oa_allow`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `oa_approval_process`
--
ALTER TABLE `oa_approval_process`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `oa_contain_option`
--
ALTER TABLE `oa_contain_option`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `oa_expenditure_type`
--
ALTER TABLE `oa_expenditure_type`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `oa_form`
--
ALTER TABLE `oa_form`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `oa_form_process`
--
ALTER TABLE `oa_form_process`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `oa_organization`
--
ALTER TABLE `oa_organization`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `property_asset`
--
ALTER TABLE `property_asset`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `property_asset_type`
--
ALTER TABLE `property_asset_type`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `property_borrow`
--
ALTER TABLE `property_borrow`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `property_scrapped`
--
ALTER TABLE `property_scrapped`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `property_scrapped_type`
--
ALTER TABLE `property_scrapped_type`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `student_certificate`
--
ALTER TABLE `student_certificate`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `student_certificate_type`
--
ALTER TABLE `student_certificate_type`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `student_info`
--
ALTER TABLE `student_info`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `student_placement`
--
ALTER TABLE `student_placement`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `student_reward_type`
--
ALTER TABLE `student_reward_type`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `student_school_status`
--
ALTER TABLE `student_school_status`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `stuset_attendance_option`
--
ALTER TABLE `stuset_attendance_option`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `stuset_health_model`
--
ALTER TABLE `stuset_health_model`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `stuset_health_option`
--
ALTER TABLE `stuset_health_option`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `stuset_health_option_list`
--
ALTER TABLE `stuset_health_option_list`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `stuset_imp_score`
--
ALTER TABLE `stuset_imp_score`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `stuset_reward`
--
ALTER TABLE `stuset_reward`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `stuset_student_score`
--
ALTER TABLE `stuset_student_score`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `system_authority`
--
ALTER TABLE `system_authority`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `system_log`
--
ALTER TABLE `system_log`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `system_nav`
--
ALTER TABLE `system_nav`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `tb_login`
--
ALTER TABLE `tb_login`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `tb_message`
--
ALTER TABLE `tb_message`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `tb_message_read`
--
ALTER TABLE `tb_message_read`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `tb_mylabel`
--
ALTER TABLE `tb_mylabel`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `tb_userhead`
--
ALTER TABLE `tb_userhead`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teacher_department`
--
ALTER TABLE `teacher_department`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teacher_education`
--
ALTER TABLE `teacher_education`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teacher_info`
--
ALTER TABLE `teacher_info`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teacher_performance`
--
ALTER TABLE `teacher_performance`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teacher_performance_imp`
--
ALTER TABLE `teacher_performance_imp`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teacher_qualification`
--
ALTER TABLE `teacher_qualification`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_alter_class`
--
ALTER TABLE `teach_alter_class`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_class_course`
--
ALTER TABLE `teach_class_course`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_class_schedule`
--
ALTER TABLE `teach_class_schedule`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_evaluation`
--
ALTER TABLE `teach_evaluation`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_evaluation_report`
--
ALTER TABLE `teach_evaluation_report`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_head_teacher`
--
ALTER TABLE `teach_head_teacher`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_patrol`
--
ALTER TABLE `teach_patrol`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_patrol_option`
--
ALTER TABLE `teach_patrol_option`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_patrol_option_list`
--
ALTER TABLE `teach_patrol_option_list`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_semester_class`
--
ALTER TABLE `teach_semester_class`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_semester_course`
--
ALTER TABLE `teach_semester_course`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teach_teacher_schedule`
--
ALTER TABLE `teach_teacher_schedule`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `base_build`
--
ALTER TABLE `base_build`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT '序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `base_campus`
--
ALTER TABLE `base_campus`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `base_class`
--
ALTER TABLE `base_class`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=14;

--
-- 使用表AUTO_INCREMENT `base_course`
--
ALTER TABLE `base_course`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `base_course_type`
--
ALTER TABLE `base_course_type`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `base_department`
--
ALTER TABLE `base_department`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `base_grade`
--
ALTER TABLE `base_grade`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `base_profession`
--
ALTER TABLE `base_profession`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `base_room`
--
ALTER TABLE `base_room`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=17;

--
-- 使用表AUTO_INCREMENT `base_schedule`
--
ALTER TABLE `base_schedule`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=27;

--
-- 使用表AUTO_INCREMENT `base_school`
--
ALTER TABLE `base_school`
  MODIFY `id` tinyint NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `base_semester`
--
ALTER TABLE `base_semester`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `china_areas`
--
ALTER TABLE `china_areas`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3145;

--
-- 使用表AUTO_INCREMENT `china_cities`
--
ALTER TABLE `china_cities`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=346;

--
-- 使用表AUTO_INCREMENT `china_provinces`
--
ALTER TABLE `china_provinces`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- 使用表AUTO_INCREMENT `commonly_affairs`
--
ALTER TABLE `commonly_affairs`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `commonly_attendance_between`
--
ALTER TABLE `commonly_attendance_between`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=15;

--
-- 使用表AUTO_INCREMENT `commonly_attendance_course`
--
ALTER TABLE `commonly_attendance_course`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=27;

--
-- 使用表AUTO_INCREMENT `commonly_attendance_early`
--
ALTER TABLE `commonly_attendance_early`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=13;

--
-- 使用表AUTO_INCREMENT `commonly_health_blackboard`
--
ALTER TABLE `commonly_health_blackboard`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `commonly_health_classroom`
--
ALTER TABLE `commonly_health_classroom`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=9;

--
-- 使用表AUTO_INCREMENT `commonly_health_stuhealth`
--
ALTER TABLE `commonly_health_stuhealth`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号';

--
-- 使用表AUTO_INCREMENT `commonly_homework`
--
ALTER TABLE `commonly_homework`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `commonly_homework_register`
--
ALTER TABLE `commonly_homework_register`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `commonly_message`
--
ALTER TABLE `commonly_message`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `commonly_message_annex`
--
ALTER TABLE `commonly_message_annex`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `commonly_second_contest`
--
ALTER TABLE `commonly_second_contest`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `commonly_second_education`
--
ALTER TABLE `commonly_second_education`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `commonly_second_political`
--
ALTER TABLE `commonly_second_political`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `commonly_second_practice`
--
ALTER TABLE `commonly_second_practice`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `commonly_second_practice_place`
--
ALTER TABLE `commonly_second_practice_place`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `commonly_second_skill`
--
ALTER TABLE `commonly_second_skill`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `commonly_week_dormitory`
--
ALTER TABLE `commonly_week_dormitory`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `commonly_week_head_teacher`
--
ALTER TABLE `commonly_week_head_teacher`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `dormitory_attendance`
--
ALTER TABLE `dormitory_attendance`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=25;

--
-- 使用表AUTO_INCREMENT `dormitory_attendance_option`
--
ALTER TABLE `dormitory_attendance_option`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `dormitory_build`
--
ALTER TABLE `dormitory_build`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `dormitory_dormroom`
--
ALTER TABLE `dormitory_dormroom`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=9;

--
-- 使用表AUTO_INCREMENT `dormitory_housemaster`
--
ALTER TABLE `dormitory_housemaster`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `dormitory_stu_arrangement`
--
ALTER TABLE `dormitory_stu_arrangement`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `finance_revenue`
--
ALTER TABLE `finance_revenue`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号';

--
-- 使用表AUTO_INCREMENT `finance_upload`
--
ALTER TABLE `finance_upload`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `oa_allow`
--
ALTER TABLE `oa_allow`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `oa_approval_process`
--
ALTER TABLE `oa_approval_process`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `oa_contain_option`
--
ALTER TABLE `oa_contain_option`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `oa_expenditure_type`
--
ALTER TABLE `oa_expenditure_type`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `oa_form`
--
ALTER TABLE `oa_form`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `oa_form_process`
--
ALTER TABLE `oa_form_process`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `oa_organization`
--
ALTER TABLE `oa_organization`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `property_asset`
--
ALTER TABLE `property_asset`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `property_asset_type`
--
ALTER TABLE `property_asset_type`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `property_borrow`
--
ALTER TABLE `property_borrow`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `property_scrapped`
--
ALTER TABLE `property_scrapped`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `property_scrapped_type`
--
ALTER TABLE `property_scrapped_type`
  MODIFY `id` tinyint NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `student_certificate`
--
ALTER TABLE `student_certificate`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号';

--
-- 使用表AUTO_INCREMENT `student_certificate_type`
--
ALTER TABLE `student_certificate_type`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `student_info`
--
ALTER TABLE `student_info`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=16;

--
-- 使用表AUTO_INCREMENT `student_placement`
--
ALTER TABLE `student_placement`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=13;

--
-- 使用表AUTO_INCREMENT `student_reward_type`
--
ALTER TABLE `student_reward_type`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `student_school_status`
--
ALTER TABLE `student_school_status`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `stuset_attendance_option`
--
ALTER TABLE `stuset_attendance_option`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=17;

--
-- 使用表AUTO_INCREMENT `stuset_health_model`
--
ALTER TABLE `stuset_health_model`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `stuset_health_option`
--
ALTER TABLE `stuset_health_option`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `stuset_health_option_list`
--
ALTER TABLE `stuset_health_option_list`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=21;

--
-- 使用表AUTO_INCREMENT `stuset_imp_score`
--
ALTER TABLE `stuset_imp_score`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `stuset_reward`
--
ALTER TABLE `stuset_reward`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=17;

--
-- 使用表AUTO_INCREMENT `stuset_student_score`
--
ALTER TABLE `stuset_student_score`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `system_authority`
--
ALTER TABLE `system_authority`
  MODIFY `id` tinyint NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `system_log`
--
ALTER TABLE `system_log`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=1009;

--
-- 使用表AUTO_INCREMENT `system_nav`
--
ALTER TABLE `system_nav`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT '行号', AUTO_INCREMENT=201;

--
-- 使用表AUTO_INCREMENT `tb_login`
--
ALTER TABLE `tb_login`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id', AUTO_INCREMENT=23;

--
-- 使用表AUTO_INCREMENT `tb_message`
--
ALTER TABLE `tb_message`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `tb_message_read`
--
ALTER TABLE `tb_message_read`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `tb_mylabel`
--
ALTER TABLE `tb_mylabel`
  MODIFY `id` tinyint NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `tb_userhead`
--
ALTER TABLE `tb_userhead`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=9;

--
-- 使用表AUTO_INCREMENT `teacher_department`
--
ALTER TABLE `teacher_department`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `teacher_education`
--
ALTER TABLE `teacher_education`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `teacher_info`
--
ALTER TABLE `teacher_info`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=19;

--
-- 使用表AUTO_INCREMENT `teacher_performance`
--
ALTER TABLE `teacher_performance`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `teacher_performance_imp`
--
ALTER TABLE `teacher_performance_imp`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `teacher_qualification`
--
ALTER TABLE `teacher_qualification`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `teach_alter_class`
--
ALTER TABLE `teach_alter_class`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `teach_class_course`
--
ALTER TABLE `teach_class_course`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=29;

--
-- 使用表AUTO_INCREMENT `teach_class_schedule`
--
ALTER TABLE `teach_class_schedule`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=19;

--
-- 使用表AUTO_INCREMENT `teach_evaluation`
--
ALTER TABLE `teach_evaluation`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `teach_evaluation_report`
--
ALTER TABLE `teach_evaluation_report`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `teach_head_teacher`
--
ALTER TABLE `teach_head_teacher`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `teach_patrol`
--
ALTER TABLE `teach_patrol`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `teach_patrol_option`
--
ALTER TABLE `teach_patrol_option`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `teach_patrol_option_list`
--
ALTER TABLE `teach_patrol_option_list`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `teach_semester_class`
--
ALTER TABLE `teach_semester_class`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=18;

--
-- 使用表AUTO_INCREMENT `teach_semester_course`
--
ALTER TABLE `teach_semester_course`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=15;

--
-- 使用表AUTO_INCREMENT `teach_teacher_schedule`
--
ALTER TABLE `teach_teacher_schedule`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'id序号', AUTO_INCREMENT=13;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
